[
  "Você sabia que o primeiro computador eletrônico, o ENIAC, pesava 30 toneladas e ocupava 180 m²?",
  "Você sabia que o ENIAC consumia 150 kW de energia, o suficiente para alimentar uma pequena cidade?",
  "Você sabia que o primeiro bug de computador foi literalmente uma mariposa presa em um relé do Harvard Mark II?",
  "Você sabia que Grace Hopper encontrou a mariposa e a colou no livro de registros com a nota 'First actual case of bug being found'?",
  "Você sabia que a Ada Lovelace escreveu o primeiro algoritmo destinado a ser processado por uma máquina em 1843?",
  "Você sabia que Alan Turing criou o teste de Turing em 1950 para determinar se uma máquina pode pensar?",
  "Você sabia que o primeiro mouse foi inventado por Douglas Engelbart em 1964 e era feito de madeira?",
  "Você sabia que o mouse original tinha apenas um botão e duas rodas perpendiculares?",
  "Você sabia que a primeira interface gráfica (GUI) foi desenvolvida no Xerox PARC nos anos 70?",
  "Você sabia que Steve Jobs visitou o Xerox PARC e se inspirou na GUI para criar o Macintosh?",
  "Você sabia que a Apple foi fundada em 1 de abril de 1976 na garagem dos pais de Steve Jobs?",
  "Você sabia que o primeiro produto da Apple foi o Apple I, vendido por $666.66?",
  "Você sabia que Steve Wozniak construiu o Apple I sozinho, à mão?",
  "Você sabia que a Microsoft foi fundada em 1975 por Bill Gates e Paul Allen?",
  "Você sabia que o primeiro produto da Microsoft foi uma versão do BASIC para o Altair 8800?",
  "Você sabia que Bill Gates abandonou Harvard para fundar a Microsoft?",
  "Você sabia que a Google foi fundada em uma garagem em 1998 por Larry Page e Sergey Brin?",
  "Você sabia que o nome Google vem de 'googol', um número 1 seguido de 100 zeros?",
  "Você sabia que o primeiro escritório da Google foi alugado de Susan Wojcicki, que depois se tornou CEO do YouTube?",
  "Você sabia que a Amazon começou como uma livraria online na garagem de Jeff Bezos em 1994?",
  "Você sabia que Jeff Bezos queria chamar a empresa de 'Cadabra', mas mudou para Amazon?",
  "Você sabia que a Amazon foi nomeada assim para aparecer no topo das listas alfabéticas?",
  "Você sabia que a Netflix foi fundada em 1997 após Reed Hastings receber uma multa de $40 por atraso?",
  "Você sabia que a Netflix originalmente enviava DVDs pelo correio?",
  "Você sabia que o Facebook foi criado em 2004 no dormitório de Harvard por Mark Zuckerberg?",
  "Você sabia que o Facebook era originalmente chamado de 'TheFacebook' e era exclusivo para Harvard?",
  "Você sabia que a Intel foi fundada em 1968 por Gordon Moore e Robert Noyce?",
  "Você sabia que o nome Intel vem de 'Integrated Electronics'?",
  "Você sabia que a Samsung começou em 1938 como uma empresa de exportação de vegetais e peixe seco?",
  "Você sabia que a Nokia começou em 1865 como uma fábrica de papel na Finlândia?",
  "Você sabia que a linguagem C foi criada por Dennis Ritchie no Bell Labs entre 1969 e 1973?",
  "Você sabia que a linguagem C foi criada para reescrever o sistema Unix?",
  "Você sabia que o C++ foi criado por Bjarne Stroustrup em 1979 como 'C com Classes'?",
  "Você sabia que o nome C++ vem do operador de incremento ++ em C?",
  "Você sabia que o Java foi criado por James Gosling na Sun Microsystems em 1995?",
  "Você sabia que o Java era originalmente chamado de Oak, em homenagem a uma árvore?",
  "Você sabia que o Python foi criado por Guido van Rossum e lançado em 1991?",
  "Você sabia que Python foi nomeado em homenagem ao grupo de comédia Monty Python?",
  "Você sabia que o JavaScript foi criado por Brendan Eich em apenas 10 dias em 1995?",
  "Você sabia que o JavaScript foi originalmente chamado de Mocha, depois LiveScript?",
  "Você sabia que o PHP foi criado por Rasmus Lerdorf em 1994?",
  "Você sabia que PHP significava originalmente 'Personal Home Page'?",
  "Você sabia que o Ruby foi criado por Yukihiro Matsumoto no Japão em 1995?",
  "Você sabia que o Ruby foi projetado para ser uma linguagem mais feliz que Perl e Python?",
  "Você sabia que o Swift foi criado pela Apple e lançado em 2014?",
  "Você sabia que o Rust foi criado por Graydon Hoare na Mozilla em 2010?",
  "Você sabia que o Go foi criado no Google por Robert Griesemer, Rob Pike e Ken Thompson?",
  "Você sabia que o Kotlin foi criado pela JetBrains e é a linguagem oficial do Android?",
  "Você sabia que o TypeScript foi criado pela Microsoft em 2012?",
  "Você sabia que o Lisp foi criado por John McCarthy em 1958?",
  "Você sabia que o Unix foi criado por Ken Thompson e Dennis Ritchie no Bell Labs em 1969?",
  "Você sabia que o Linux foi criado por Linus Torvalds em 1991 quando ele tinha 21 anos?",
  "Você sabia que Linus Torvalds criou o Linux como um hobby enquanto estudava na Universidade de Helsinki?",
  "Você sabia que o primeiro anúncio do Linux foi feito em um grupo de discussão da Usenet?",
  "Você sabia que o mascote do Linux, o Tux, é um pinguim?",
  "Você sabia que o Windows 1.0 foi lançado em 1985?",
  "Você sabia que o Windows 95 vendeu 7 milhões de cópias nas primeiras 5 semanas?",
  "Você sabia que o Windows XP foi um dos sistemas operacionais mais longevos da Microsoft?",
  "Você sabia que o macOS é baseado em Unix?",
  "Você sabia que o macOS era originalmente chamado de Mac OS X?",
  "Você sabia que o Android é baseado no kernel Linux?",
  "Você sabia que o Android foi fundado em 2003 e comprado pelo Google em 2005?",
  "Você sabia que o iOS foi lançado em 2007 junto com o primeiro iPhone?",
  "Você sabia que a World Wide Web foi inventada por Tim Berners-Lee em 1989 no CERN?",
  "Você sabia que o primeiro site da web ainda está online em info.cern.ch?",
  "Você sabia que o primeiro navegador web se chamava WorldWideWeb?",
  "Você sabia que o Mosaic foi o primeiro navegador popular com suporte a imagens?",
  "Você sabia que o Netscape Navigator dominou o mercado de navegadores nos anos 90?",
  "Você sabia que o Internet Explorer foi lançado em 1995 como parte do Windows 95?",
  "Você sabia que o Firefox nasceu das cinzas do Netscape em 2004?",
  "Você sabia que o Google Chrome foi lançado em 2008?",
  "Você sabia que o Chrome é baseado no projeto open source Chromium?",
  "Você sabia que o primeiro domínio .com registrado foi symbolics.com em 1985?",
  "Você sabia que o primeiro email foi enviado por Ray Tomlinson em 1971?",
  "Você sabia que Ray Tomlinson escolheu o símbolo @ para separar o nome do usuário do servidor?",
  "Você sabia que o protocolo HTTP foi criado por Tim Berners-Lee?",
  "Você sabia que o HTTPS adiciona criptografia SSL/TLS ao HTTP?",
  "Você sabia que o DNS foi criado em 1983 para substituir arquivos hosts?",
  "Você sabia que existem 13 servidores DNS raiz no mundo?",
  "Você sabia que o primeiro microprocessador comercial foi o Intel 4004 em 1971?",
  "Você sabia que o Intel 4004 tinha apenas 2.300 transistores?",
  "Você sabia que os processadores modernos têm bilhões de transistores?",
  "Você sabia que a Lei de Moore prevê que o número de transistores dobra a cada 2 anos?",
  "Você sabia que Gordon Moore formulou a Lei de Moore em 1965?",
  "Você sabia que o primeiro disco rígido, o IBM 305 RAMAC, pesava mais de uma tonelada?",
  "Você sabia que o IBM 305 RAMAC armazenava apenas 5 MB de dados?",
  "Você sabia que o primeiro SSD comercial foi lançado pela SanDisk em 1991?",
  "Você sabia que a memória RAM é volátil e perde dados quando desligada?",
  "Você sabia que a memória ROM é não-volátil e mantém dados sem energia?",
  "Você sabia que o USB foi desenvolvido por um consórcio liderado pela Intel em 1996?",
  "Você sabia que o USB-C é reversível e pode transferir até 40 Gbps?",
  "Você sabia que o Bluetooth foi nomeado em homenagem ao rei viking Harald Bluetooth?",
  "Você sabia que o símbolo do Bluetooth combina as runas nórdicas H e B?",
  "Você sabia que o Wi-Fi não significa 'Wireless Fidelity'?",
  "Você sabia que o termo Wi-Fi foi criado como uma jogada de marketing?",
  "Você sabia que o primeiro vírus de computador foi o Creeper em 1971?",
  "Você sabia que o Creeper exibia a mensagem 'I'm the creeper, catch me if you can'?",
  "Você sabia que o primeiro antivírus foi o Reaper, criado para remover o Creeper?",
  "Você sabia que o Morris Worm foi o primeiro worm a ganhar atenção significativa em 1988?",
  "Você sabia que o Morris Worm infectou cerca de 10% dos computadores conectados à internet?",
  "Você sabia que o Stuxnet foi descoberto em 2010 e atacava sistemas industriais?",
  "Você sabia que o Stuxnet foi projetado para sabotar centrífugas nucleares iranianas?",
  "Você sabia que o WannaCry infectou mais de 200.000 computadores em 150 países em 2017?",
  "Você sabia que o WannaCry explorava uma vulnerabilidade do Windows chamada EternalBlue?",
  "Você sabia que a criptografia RSA foi inventada em 1977?",
  "Você sabia que RSA significa Rivest-Shamir-Adleman, os nomes dos inventores?",
  "Você sabia que o HTTPS usa certificados SSL/TLS para criptografar dados?",
  "Você sabia que o Let's Encrypt oferece certificados SSL gratuitos desde 2015?",
  "Você sabia que o primeiro tweet foi enviado por Jack Dorsey em 2006?",
  "Você sabia que o Twitter era originalmente chamado de 'twttr'?",
  "Você sabia que o limite de 140 caracteres do Twitter foi baseado no SMS?",
  "Você sabia que o Instagram foi criado em 2010 por Kevin Systrom e Mike Krieger?",
  "Você sabia que o Instagram foi vendido para o Facebook por $1 bilhão em 2012?",
  "Você sabia que o YouTube foi fundado em 2005 por três ex-funcionários do PayPal?",
  "Você sabia que o primeiro vídeo do YouTube foi 'Me at the zoo' com 18 segundos?",
  "Você sabia que o YouTube foi comprado pelo Google por $1.65 bilhões em 2006?",
  "Você sabia que o LinkedIn foi fundado em 2002 e lançado em 2003?",
  "Você sabia que o WhatsApp foi fundado em 2009 por ex-funcionários do Yahoo?",
  "Você sabia que o WhatsApp foi comprado pelo Facebook por $19 bilhões em 2014?",
  "Você sabia que o Snapchat foi criado em 2011 por estudantes de Stanford?",
  "Você sabia que o TikTok é a versão internacional do app chinês Douyin?",
  "Você sabia que o primeiro videogame comercial foi o Pong em 1972?",
  "Você sabia que o Tetris foi criado por Alexey Pajitnov na União Soviética em 1984?",
  "Você sabia que o Super Mario Bros vendeu mais de 40 milhões de cópias?",
  "Você sabia que o Minecraft é o jogo mais vendido de todos os tempos?",
  "Você sabia que o Minecraft foi criado por Markus Persson (Notch) em 2009?",
  "Você sabia que a Valve criou o Steam em 2003?",
  "Você sabia que o PlayStation foi lançado pela Sony em 1994?",
  "Você sabia que o Xbox foi lançado pela Microsoft em 2001?",
  "Você sabia que o Nintendo Switch vendeu mais de 100 milhões de unidades?",
  "Você sabia que o Bitcoin foi criado em 2009 por Satoshi Nakamoto?",
  "Você sabia que a identidade de Satoshi Nakamoto permanece desconhecida?",
  "Você sabia que o primeiro bloco do Bitcoin é chamado de Genesis Block?",
  "Você sabia que a blockchain é uma tecnologia de registro distribuído?",
  "Você sabia que o Ethereum foi criado por Vitalik Buterin em 2015?",
  "Você sabia que o Ethereum permite a criação de contratos inteligentes?",
  "Você sabia que o primeiro NFT foi criado em 2014?",
  "Você sabia que a computação em nuvem permite acessar recursos via internet?",
  "Você sabia que a AWS (Amazon Web Services) foi lançada em 2006?",
  "Você sabia que a AWS é o maior provedor de nuvem do mundo?",
  "Você sabia que o Docker foi lançado em 2013?",
  "Você sabia que o Docker revolucionou a forma como aplicações são empacotadas?",
  "Você sabia que o Kubernetes foi criado pelo Google e lançado em 2014?",
  "Você sabia que o Git foi criado por Linus Torvalds em 2005?",
  "Você sabia que o Git foi criado em apenas 2 semanas?",
  "Você sabia que o GitHub foi fundado em 2008?",
  "Você sabia que o GitHub foi comprado pela Microsoft por $7.5 bilhões em 2018?",
  "Você sabia que o primeiro emoji foi criado no Japão em 1999?",
  "Você sabia que existem mais de 3.000 emojis diferentes?",
  "Você sabia que o QR Code foi inventado pela Denso Wave no Japão em 1994?",
  "Você sabia que QR significa 'Quick Response'?",
  "Você sabia que o CAPTCHA significa 'Completely Automated Public Turing test'?",
  "Você sabia que o reCAPTCHA ajuda a digitalizar livros antigos?",
  "Você sabia que o PDF foi criado pela Adobe em 1993?",
  "Você sabia que o formato MP3 foi desenvolvido na Alemanha nos anos 80?",
  "Você sabia que o JPEG foi criado em 1992?",
  "Você sabia que o PNG foi criado em 1996 como alternativa ao GIF?",
  "Você sabia que o GIF suporta animações desde sua criação em 1987?",
  "Você sabia que o criador do GIF diz que se pronuncia 'jif'?",
  "Você sabia que o primeiro spam foi enviado em 1978?",
  "Você sabia que o termo 'spam' vem de um esquete do Monty Python?",
  "Você sabia que o primeiro banner publicitário online foi em 1994?",
  "Você sabia que o banner tinha 44% de taxa de cliques?",
  "Você sabia que o Google processa mais de 8.5 bilhões de buscas por dia?",
  "Você sabia que o algoritmo PageRank do Google foi nomeado em homenagem a Larry Page?",
  "Você sabia que a Wikipédia foi lançada em 2001?",
  "Você sabia que a Wikipédia tem mais de 60 milhões de artigos?",
  "Você sabia que o Reddit foi fundado em 2005?",
  "Você sabia que o Stack Overflow foi lançado em 2008?",
  "Você sabia que o Spotify foi fundado na Suécia em 2006?",
  "Você sabia que o Zoom foi fundado em 2011 por Eric Yuan?",
  "Você sabia que o Slack foi lançado em 2013?",
  "Você sabia que o Discord foi lançado em 2015?",
  "Você sabia que o Twitch foi lançado em 2011?",
  "Você sabia que o Twitch foi comprado pela Amazon por $970 milhões em 2014?",
  "Você sabia que o Uber foi fundado em 2009?",
  "Você sabia que o Airbnb foi fundado em 2008?",
  "Você sabia que o primeiro iPhone foi lançado em 2007?",
  "Você sabia que o iPhone original não tinha App Store?",
  "Você sabia que a App Store foi lançada em 2008?",
  "Você sabia que a App Store tem mais de 2 milhões de apps?",
  "Você sabia que o Google Play foi lançado em 2012?",
  "Você sabia que o iPad foi lançado em 2010?",
  "Você sabia que o Apple Watch foi lançado em 2015?",
  "Você sabia que o AirPods foi lançado em 2016?",
  "Você sabia que o Tesla Model S foi lançado em 2012?",
  "Você sabia que o SpaceX foi fundado por Elon Musk em 2002?",
  "Você sabia que o Falcon 1 foi o primeiro foguete privado a alcançar órbita?",
  "Você sabia que o primeiro pouso de foguete reutilizável foi em 2015?",
  "Você sabia que o Starlink é uma constelação de satélites da SpaceX?",
  "Você sabia que o ChatGPT foi lançado em novembro de 2022?",
  "Você sabia que o ChatGPT alcançou 1 milhão de usuários em 5 dias?",
  "Você sabia que o GPT significa 'Generative Pre-trained Transformer'?",
  "Você sabia que o primeiro computador quântico comercial foi vendido em 2011?",
  "Você sabia que a computação quântica usa qubits em vez de bits?",
  "Você sabia que um qubit pode estar em superposição de estados?",
  "Você sabia que o Google alcançou supremacia quântica em 2019?",
  "Você sabia que o 5G pode atingir velocidades de até 20 Gbps?",
  "Você sabia que o 5G tem latência de menos de 1 milissegundo?",
  "Você sabia que o Wi-Fi 6 foi lançado em 2019?",
  "Você sabia que o Wi-Fi 6 é até 40% mais rápido que o Wi-Fi 5?",
  "Você sabia que o HDMI foi lançado em 2003?",
  "Você sabia que o DisplayPort foi lançado em 2006?",
  "Você sabia que o Thunderbolt foi desenvolvido pela Intel e Apple?",
  "Você sabia que o Thunderbolt 4 pode transferir até 40 Gbps?",
  "Você sabia que o NVMe é até 7x mais rápido que o SATA?",
  "Você sabia que o PCIe 5.0 dobra a velocidade do PCIe 4.0?",
  "Você sabia que o DDR5 oferece o dobro de largura de banda do DDR4?",
  "Você sabia que o primeiro SSD consumer de 1TB custava mais de $3.000?",
  "Você sabia que a tecnologia OLED não precisa de backlight?",
  "Você sabia que o MicroLED é considerado a próxima geração após OLED?",
  "Você sabia que o primeiro monitor 4K foi lançado em 2012?",
  "Você sabia que o 8K tem 4 vezes mais pixels que o 4K?",
  "Você sabia que o HDR melhora o contraste e as cores das imagens?",
  "Você sabia que o ray tracing simula o comportamento real da luz?",
  "Você sabia que o DLSS usa IA para melhorar performance em jogos?",
  "Você sabia que o FSR é a alternativa da AMD ao DLSS?",
  "Você sabia que o primeiro processador de 64 bits consumer foi o AMD Athlon 64?",
  "Você sabia que o ARM é a arquitetura mais usada no mundo?",
  "Você sabia que o Apple M1 foi o primeiro chip ARM da Apple para Mac?",
  "Você sabia que o M1 superou muitos processadores Intel em eficiência?",
  "Você sabia que o RISC-V é uma arquitetura open source?",
  "Você sabia que o WebAssembly permite rodar código nativo no navegador?",
  "Você sabia que o Progressive Web App pode funcionar offline?",
  "Você sabia que o HTTP/2 foi lançado em 2015?",
  "Você sabia que o HTTP/3 usa QUIC em vez de TCP?",
  "Você sabia que o IPv6 foi criado porque os endereços IPv4 estavam acabando?",
  "Você sabia que o IPv6 tem 340 undecilhões de endereços possíveis?",
  "Você sabia que o Tor foi criado pela Marinha dos EUA?",
  "Você sabia que o Tor significa 'The Onion Router'?",
  "Você sabia que o VPN cria um túnel criptografado na internet?",
  "Você sabia que o WireGuard é um protocolo VPN moderno e rápido?",
  "Você sabia que o OpenVPN é um dos protocolos VPN mais populares?",
  "Você sabia que o SSH substituiu o Telnet por ser criptografado?",
  "Você sabia que o SSH foi criado em 1995?",
  "Você sabia que o FTP foi criado em 1971?",
  "Você sabia que o SFTP é FTP sobre SSH?",
  "Você sabia que o rsync é usado para sincronizar arquivos eficientemente?",
  "Você sabia que o BitTorrent foi criado em 2001?",
  "Você sabia que o BitTorrent usa protocolo peer-to-peer?",
  "Você sabia que o IPFS é um sistema de arquivos distribuído?",
  "Você sabia que o WebRTC permite comunicação em tempo real no navegador?",
  "Você sabia que o WebSocket mantém conexão bidirecional aberta?",
  "Você sabia que o GraphQL foi criado pelo Facebook em 2012?",
  "Você sabia que o REST foi definido por Roy Fielding em 2000?",
  "Você sabia que o SOAP usa XML para troca de mensagens?",
  "Você sabia que o JSON é mais leve que o XML?",
  "Você sabia que o YAML é usado para arquivos de configuração?",
  "Você sabia que o TOML foi criado como alternativa ao YAML?",
  "Você sabia que o Markdown foi criado em 2004?",
  "Você sabia que o LaTeX foi criado em 1984?",
  "Você sabia que o Vim foi lançado em 1991?",
  "Você sabia que o Emacs foi criado em 1976?",
  "Você sabia que o VS Code foi lançado em 2015?",
  "Você sabia que o VS Code é baseado no Electron?",
  "Você sabia que o Sublime Text foi lançado em 2008?",
  "Você sabia que o Atom foi descontinuado em 2022?",
  "Você sabia que o IntelliJ IDEA foi lançado em 2001?",
  "Você sabia que o Eclipse foi lançado em 2001?",
  "Você sabia que o Visual Studio foi lançado em 1997?",
  "Você sabia que o Xcode é a IDE oficial da Apple?",
  "Você sabia que o Android Studio é baseado no IntelliJ?",
  "Você sabia que o PyCharm é feito pela JetBrains?",
  "Você sabia que o WebStorm é focado em desenvolvimento web?",
  "Você sabia que o Rider é uma IDE para .NET?",
  "Você sabia que o CLion é uma IDE para C e C++?",
  "Você sabia que o GoLand é uma IDE para Go?",
  "Você sabia que o RubyMine é uma IDE para Ruby?",
  "Você sabia que o PhpStorm é uma IDE para PHP?",
  "Você sabia que o DataGrip é uma IDE para bancos de dados?",
  "Você sabia que o MySQL foi criado em 1995?",
  "Você sabia que o PostgreSQL foi lançado em 1996?",
  "Você sabia que o MongoDB foi lançado em 2009?",
  "Você sabia que o Redis foi criado em 2009?",
  "Você sabia que o SQLite é o banco de dados mais usado no mundo?",
  "Você sabia que o SQLite está em bilhões de dispositivos?",
  "Você sabia que o MariaDB é um fork do MySQL?",
  "Você sabia que o Oracle Database foi lançado em 1979?",
  "Você sabia que o Microsoft SQL Server foi lançado em 1989?",
  "Você sabia que o Cassandra foi criado pelo Facebook?",
  "Você sabia que o CouchDB usa JSON para armazenar dados?",
  "Você sabia que o Neo4j é um banco de dados de grafos?",
  "Você sabia que o InfluxDB é otimizado para séries temporais?",
  "Você sabia que o Elasticsearch é usado para busca e análise?",
  "Você sabia que o Apache Kafka foi criado no LinkedIn?",
  "Você sabia que o RabbitMQ implementa o protocolo AMQP?",
  "Você sabia que o Apache Hadoop foi inspirado no Google MapReduce?",
  "Você sabia que o Apache Spark é até 100x mais rápido que Hadoop?",
  "Você sabia que o TensorFlow foi criado pelo Google?",
  "Você sabia que o PyTorch foi criado pelo Facebook?",
  "Você sabia que o Keras é uma API de alto nível para redes neurais?",
  "Você sabia que o scikit-learn é uma biblioteca de machine learning?",
  "Você sabia que o NumPy é fundamental para computação científica em Python?",
  "Você sabia que o Pandas é usado para análise de dados?",
  "Você sabia que o Jupyter Notebook foi lançado em 2014?",
  "Você sabia que o R foi criado em 1993?",
  "Você sabia que o MATLAB foi lançado em 1984?",
  "Você sabia que o Julia foi criado em 2012?",
  "Você sabia que o Scala roda na JVM?",
  "Você sabia que o Clojure é um dialeto de Lisp que roda na JVM?",
  "Você sabia que o Erlang foi criado pela Ericsson?",
  "Você sabia que o Elixir roda na máquina virtual do Erlang?",
  "Você sabia que o Haskell é uma linguagem puramente funcional?",
  "Você sabia que o OCaml influenciou o desenvolvimento do Rust?",
  "Você sabia que o F# é uma linguagem funcional da Microsoft?",
  "Você sabia que o Dart foi criado pelo Google?",
  "Você sabia que o Flutter usa Dart?",
  "Você sabia que o React Native foi criado pelo Facebook?",
  "Você sabia que o Xamarin permite desenvolvimento cross-platform?",
  "Você sabia que o Ionic usa tecnologias web para apps mobile?",
  "Você sabia que o Cordova permite empacotar apps web como apps nativos?",
  "Você sabia que o Electron permite criar apps desktop com web?",
  "Você sabia que o Tauri é uma alternativa mais leve ao Electron?",
  "Você sabia que o WebView2 usa o Edge Chromium?",
  "Você sabia que o React foi criado pelo Facebook?",
  "Você sabia que o Vue.js foi criado por Evan You?",
  "Você sabia que o Angular foi criado pelo Google?",
  "Você sabia que o Svelte compila em tempo de build?",
  "Você sabia que o Next.js é um framework React?",
  "Você sabia que o Nuxt.js é um framework Vue?",
  "Você sabia que o Gatsby é um gerador de sites estáticos?",
  "Você sabia que o Astro é focado em performance?",
  "Você sabia que o Remix é um framework full-stack?",
  "Você sabia que o SolidJS é similar ao React mas mais rápido?",
  "Você sabia que o Qwik tem resumability em vez de hydration?",
  "Você sabia que o Alpine.js é uma alternativa leve ao Vue?",
  "Você sabia que o htmx permite interatividade sem JavaScript?",
  "Você sabia que o Tailwind CSS é utility-first?",
  "Você sabia que o Bootstrap foi criado no Twitter?",
  "Você sabia que o Material Design foi criado pelo Google?",
  "Você sabia que o Sass foi criado em 2006?",
  "Você sabia que o Less é um pré-processador CSS?",
  "Você sabia que o PostCSS transforma CSS com plugins?",
  "Você sabia que o Webpack é um module bundler?",
  "Você sabia que o Vite é até 100x mais rápido que Webpack?",
  "Você sabia que o esbuild é escrito em Go?",
  "Você sabia que o Rollup é otimizado para bibliotecas?",
  "Você sabia que o Parcel não precisa de configuração?",
  "Você sabia que o Babel transpila JavaScript moderno?",
  "Você sabia que o ESLint é um linter para JavaScript?",
  "Você sabia que o Prettier formata código automaticamente?",
  "Você sabia que o Jest é um framework de testes?",
  "Você sabia que o Mocha é um framework de testes para Node?",
  "Você sabia que o Cypress é usado para testes E2E?",
  "Você sabia que o Playwright suporta múltiplos navegadores?",
  "Você sabia que o Selenium foi criado em 2004?",
  "Você sabia que o Puppeteer controla o Chrome headless?",
  "Você sabia que o npm foi criado em 2010?",
  "Você sabia que o Yarn foi criado pelo Facebook?",
  "Você sabia que o pnpm economiza espaço em disco?",
  "Você sabia que o Bun é um runtime JavaScript alternativo?",
  "Você sabia que o Deno foi criado pelo criador do Node.js?",
  "Você sabia que o Node.js foi criado em 2009?",
  "Você sabia que o Express é o framework mais popular para Node?",
  "Você sabia que o Fastify é mais rápido que o Express?",
  "Você sabia que o NestJS é inspirado no Angular?",
  "Você sabia que o Django foi criado em 2005?",
  "Você sabia que o Flask é um microframework Python?",
  "Você sabia que o FastAPI é baseado em type hints?",
  "Você sabia que o Ruby on Rails foi lançado em 2004?",
  "Você sabia que o Laravel é o framework PHP mais popular?",
  "Você sabia que o Symfony influenciou o Laravel?",
  "Você sabia que o Spring é o framework Java mais usado?",
  "Você sabia que o ASP.NET foi criado pela Microsoft?",
  "Você sabia que o .NET Core é cross-platform?",
  "Você sabia que o Blazor permite usar C# no frontend?",
  "Você sabia que o Phoenix é um framework Elixir?",
  "Você sabia que o Gin é um framework web para Go?",
  "Você sabia que o Actix é um framework Rust?",
  "Você sabia que o primeiro worm de computador, o Morris Worm, foi criado para medir o tamanho da internet, não para causar danos?",
  "Você sabia que o termo 'Hacker' surgiu no MIT nos anos 60 para descrever estudantes que criavam soluções criativas para problemas?",
  "Você sabia que o vírus 'ILOVEYOU' em 2000 causou danos globais estimados em 10 bilhões de dólares?",
  "Você sabia que a criptografia Caesar Cipher era usada por Júlio César para proteger mensagens militares?",
  "Você sabia que a técnica 'SQL Injection' foi descoberta por Jeff Forristal em 1998 e ele avisou que era uma falha crítica na época?",
  "Você sabia que o ataque 'Conficker' em 2008 infectou milhões de computadores governamentais e militares em todo o mundo?",
  "Você sabia que o 'White Hat' hacker Kevin Mitnick foi uma das pessoas mais procuradas pelo FBI nos anos 90?",
  "Você sabia que a vulnerabilidade 'Heartbleed' no OpenSSL expôs milhões de chaves privadas em 2014?",
  "Você sabia que o protocolo TLS substituiu o SSL após a vulnerabilidade POODLE mostrar que o SSL 3.0 era inseguro?",
  "Você sabia que a NSA ajudou a fortalecer o algoritmo DES original, mas também foi suspeita de inserir backdoors?",
  "Você sabia que o algoritmo AES (Advanced Encryption Standard) foi escolhido após um concurso público vencido por dois criptógrafos belgas?",
  "Você sabia que o ataque 'Man-in-the-Middle' em redes Wi-Fi públicas é facilitado por ferramentas simples como o Kali Linux?",
  "Você sabia que a esteganografia permite esconder mensagens dentro de imagens sem alterar a aparência visual da foto?",
  "Você sabia que o 'Zero Day' mais caro já vendido em mercados de exploit passou da casa dos milhões de dólares?",
  "Você sabia que o vírus 'Brain', o primeiro para PCs, exibia o endereço e telefone dos criadores no Paquistão?",
  "Você sabia que o ataque 'BlueKeep' afetava o protocolo RDP e permitia execução remota de código sem autenticação?",
  "Você sabia que o hardware security module (HSM) é um chip físico dedicado apenas a gerenciar chaves criptográficas?",
  "Você sabia que o ataque de 'DDoS' mais longo registrado durou mais de 10 dias seguidos de bombardeio ininterrupto?",
  "Você sabia que o 'Phishing' recebeu esse nome porque os atacantes usam iscas (lures) para pescar usuários na rede?",
  "Você sabia que o ransomware 'DeepBlue' foi um dos primeiros a usar algoritmos de curva elíptica para criptografar arquivos?",
  "Você sabia que a técnica de 'Fuzzing' consiste em enviar dados aleatórios para um programa até que ele trave para encontrar falhas?",
  "Você sabia que o 'Buffer Overflow' ocorre por falta de verificação de limites (bounds checking) em linguagens como C e C++?",
  "Você sabia que o 'Air Gap' é uma medida de segurança onde o computador é fisicamente desconectado de qualquer rede?",
  "Você sabia que o vírus 'Michelangelo' em 1992 causou um pânico global de que todos os PCs seriam apagados no dia do aniversário do artista?",
  "Você sabia que o 'Social Engineering' é responsável por mais de 80% dos incidentes de segurança cibernética bem-sucedidos?",
  "Você sabia que o algoritmo de hashing MD5 é considerado quebrado desde 2004 devido à facilidade de gerar colisões?",
  "Você sabia que o ataque 'Meltdown' permitia que um processo simples lesse a memória de qualquer outro processo ou do kernel?",
  "Você sabia que a falha 'Spectre' afeta quase todos os processadores modernos devido à execução especulativa de instruções?",
  "Você sabia que o 'Evil Twin' é um ponto de acesso Wi-Fi falso criado para roubar credenciais de quem se conecta?",
  "Você sabia que a análise de malware em sandbox permite ver o comportamento de um vírus sem infectar a máquina real?",
  "Você sabia que o 'Cross-Site Scripting' (XSS) permite injetar scripts maliciosos em páginas web visualizadas por outros usuários?",
  "Você sabia que o cookie 'HttpOnly' impede que scripts de terceiros acessem dados de sessão no navegador?",
  "Você sabia que o 'Salting' impede que dois usuários com a mesma senha tenham o mesmo hash no banco de dados?",
  "Você sabia que o ataque 'Sybil' ocorre quando um invasor cria múltiplas identidades para controlar uma rede descentralizada?",
  "Você sabia que o 'Rootkit' recebe esse nome porque permite acesso com privilégios de 'root' sem ser detectado pelo sistema operacional?",
  "Você sabia que o vírus 'Melissa' em 1999 se espalhava através de documentos do Word e desabilitava os envios de email da Microsoft?",
  "Você sabia que a técnica 'Pretexting' é uma forma de engenharia social onde o atacante cria um cenário falso para obter informações?",
  "Você sabia que o ataque de 'Brute Force' em senhas de 8 caracteres pode levar apenas alguns minutos em máquinas modernas com GPUs?",
  "Você sabia que o 'Double Pulsar' foi um backdoor desenvolvido pela NSA e depois vazado pelo grupo Shadow Brokers?",
  "Você sabia que o protocolo HTTPS não protege contra phishing, apenas garante que a conexão com o site (mesmo que falso) seja cifrada?",
  "Você sabia que em Assembly, a instrução 'NOP' (No Operation) é usada para criar atrasos minúsculos ou preencher espaços de memória?",
  "Você sabia que o BIOS (Basic Input/Output System) é o primeiro software a rodar quando você liga o computador?",
  "Você sabia que o UEFI substituiu o BIOS moderno para suportar discos maiores que 2TB e boot seguro?",
  "Você sabia que em C, o tamanho de um 'int' pode variar dependendo da arquitetura (16, 32 ou 64 bits)?",
  "Você sabia que o 'Big Endian' e 'Little Endian' definem a ordem em que os bytes de um número são armazenados na RAM?",
  "Você sabia que em sistemas x86, a pilha (stack) de memória cresce de endereços altos para endereços baixos?",
  "Você sabia que o 'Heap' é a área de memória usada para alocação dinâmica, onde o desenvolvedor é responsável por liberar o espaço?",
  "Você sabia que um 'Kernel Panic' no Linux ou Unix é equivalente à 'Tela Azul da Morte' do Windows?",
  "Você sabia que o 'Garbage Collector' em linguagens como Java retira a necessidade de liberar memória manualmente, mas causa pausas no programa?",
  "Você sabia que o código de máquina é composto inteiramente por números hexadecimais ou binários que a CPU executa diretamente?",
  "Você sabia que o 'Interrupt Request' (IRQ) é um sinal enviado pelo hardware para a CPU parar o que está fazendo e tratar um evento?",
  "Você sabia que o 'Page Fault' ocorre quando a CPU tenta acessar um endereço de memória que não está carregado na RAM física?",
  "Você sabia que o Windows NT foi o primeiro sistema da Microsoft a usar uma arquitetura de kernel moderna e totalmente 32-bit?",
  "Você sabia que em C++, o uso de 'ponteiros inteligentes' (smart pointers) ajuda a prevenir vazamentos de memória (memory leaks)?",
  "Você sabia que o 'Direct Memory Access' (DMA) permite que componentes de hardware transfiram dados entre si sem passar pela CPU?",
  "Você sabia que a 'Tabela de Interrupções' é um índice que diz à CPU onde estão os drivers que cuidam de cada periférico?",
  "Você sabia que o código Assembly 'JMP' é similar ao infame 'GOTO', mas é essencial para o funcionamento de loops no baixo nível?",
  "Você sabia que o 'Segmented Memory' era uma técnica usada no MS-DOS para acessar mais de 64KB de memória?",
  "Você sabia que o 'Ring 0' é o nível de privilégio mais alto da CPU, onde apenas o Kernel e drivers críticos podem rodar?",
  "Você sabia que o 'Context Switch' é o processo da CPU salvar o estado de um programa para alternar para outro, permitindo o multitarefa?",
  "Você sabia que a instrução x86 'MOV' não move o dado, mas sim copia o valor de uma origem para um destino?",
  "Você sabia que o 'Microcódigo' é um nível de instrução ainda mais baixo dentro do processador que traduz instruções complexas em operações simples?",
  "Você sabia que em C, um 'void pointer' pode apontar para qualquer tipo de dado, mas exige um cast explícito para ser lido?",
  "Você sabia que o 'Memory Mapping' permite acessar arquivos no disco como se estivessem carregados diretamente na memória RAM?",
  "Você sabia que o 'Bootloader' (como o GRUB) é responsável por carregar o Kernel do disco para a memória principal?",
  "Você sabia que o 'Memory Alignment' organiza dados na RAM de forma que a CPU consiga lê-los em um único ciclo, melhorando a performance?",
  "Você sabia que em Assembly x86, o registrador 'EAX' é historicamente usado como o acumulador principal para operações matemáticas?",
  "Você sabia que a técnica 'Zero-Copy' permite que dados sejam enviados de um driver para a rede sem serem copiados entre buffers do Kernel?",
  "Você sabia que o 'Address Space Layout Randomization' (ASLR) muda o local de endereços na memória para dificultar ataques de exploit?",
  "Você sabia que em C, a função 'malloc' pede memória ao sistema operacional, mas a função 'free' avisa que ela pode ser usada por outros?",
  "Você sabia que o 'Bus Error' ocorre quando um programa tenta acessar endereços de memória que o hardware não consegue mapear?",
  "Você sabia que o 'System Call' (syscall) é a única forma de um programa pedir permissão ao Kernel para escrever no disco ou usar a rede?",
  "Você sabia que a arquitetura 'Harvard' separa a memória de código da memória de dados, ao contrário da arquitetura 'Von Neumann'?",
  "Você sabia que em C++, um 'Destrutor' é uma função chamada automaticamente quando um objeto sai de escopo para limpar recursos?",
  "Você sabia que o 'Deadlock' ocorre quando dois processos ficam esperando um ao outro liberar um recurso de memória infinitamente?",
  "Você sabia que os processadores modernos usam 'Caches L1, L2 e L3' para evitar a lentidão de buscar dados na memória RAM principal?",
  "Você sabia que o 'Dynamic Linking' carrega bibliotecas (.dll ou .so) apenas quando o programa está rodando, economizando memória no disco?",
  "Você sabia que a 'Tabela Hash' é considerada a estrutura de dados mais eficiente para buscas rápidas em termos de complexidade de tempo?",
  "Você sabia que as instruções 'SIMD' permitem que a CPU processe múltiplos dados em uma única instrução, sendo vital para edição de vídeo e jogos?",
  "Você sabia que o 'Bitwise Shift' (deslocamento de bits) é uma forma extremamente rápida de multiplicar ou dividir números por potências de 2?",
  "Você sabia que o silício foi escolhido como base para chips porque é abundante e pode ser transformado em condutor ou isolante facilmente?",
  "Você sabia que a fabricação de um chip moderno acontece em salas limpas 10.000 vezes mais puras que um centro cirúrgico?",
  "Você sabia que o 'Wafer' de silício é um disco de cristal puro onde centenas de chips são impressos simultaneamente usando luz UV?",
  "Você sabia que a empresa ASML é a única no mundo que fabrica as máquinas capazes de imprimir os chips mais avançados do planeta?",
  "Você sabia que um transistor moderno é tão pequeno que milhares deles caberiam no diâmetro de um único fio de cabelo humano?",
  "Você sabia que o calor gerado por processadores potentes é resultado da resistência elétrica de bilhões de transistores mudando de estado?",
  "Você sabia que os processadores ARM são preferidos em celulares porque gastam muito menos energia que os processadores x86 da Intel?",
  "Você sabia que a técnica 'Overclocking' aumenta a frequência do processador além do limite de fábrica, gerando ganho de performance e calor extremo?",
  "Você sabia que o 'Thermal Throttling' é um sistema de proteção que reduz a velocidade da CPU quando ela atinge temperaturas perigosas?",
  "Você sabia que os antigos computadores de válvulas falhavam constantemente porque as válvulas queimavam como lâmpadas comuns?",
  "Você sabia que o primeiro disco rígido de 1GB foi lançado pela IBM em 1980 e era do tamanho de uma geladeira?",
  "Você sabia que em discos rígidos (HDD), a cabeça de leitura voa a uma distância menor que a espessura de uma impressão digital sobre o disco?",
  "Você sabia que o 'Blue Laser' permitiu o surgimento do Blu-ray por ter um comprimento de onda menor, permitindo gravar dados mais próximos?",
  "Você sabia que o SSD não possui partes móveis, o que o torna imune a danos por choques físicos ao contrário dos HDDs?",
  "Você sabia que o padrão HDMI foi criado especificamente para transmitir vídeo e áudio digitais de alta definição em um único cabo?",
  "Você sabia que as GPUs têm milhares de núcleos simples para cálculos paralelos, enquanto CPUs têm poucos núcleos muito complexos?",
  "Você sabia que o 'Clock' do processador é medido em Hertz, indicando quantos bilhões de ciclos ele executa por segundo?",
  "Você sabia que a arquitetura RISC foca em instruções curtas e rápidas, sendo a base de processadores modernos como o Apple M3?",
  "Você sabia que no passado, o 'Copilotador Matemático' era um chip extra que você comprava para ajudar o processador com números decimais?",
  "Você sabia que o termo 'Bug' no sentido eletrônico já existia no século XIX, antes mesmo do computador ser inventado?",
  "Você sabia que o sistema binário usado pelos computadores modernos foi formalizado por Gottfried Leibniz no século XVII?",
  "Você sabia que o 'Y2K Bug' (Bug do Milênio) custou bilhões de dólares em correções para evitar que sistemas fechassem datas como 1900 em vez de 2000?",
  "Você sabia que o sistema hexadecimal é usado por programadores porque 2 dígitos hexadecimais representam exatamente 1 byte de informação?",
  "Você sabia que o código ASCII original suportava apenas 128 caracteres, o que deixava de fora acentos e emojis?",
  "Você sabia que o padrão UNICODE foi criado para suportar todos os idiomas do mundo, incluindo símbolos antigos e modernos?",
  "Você sabia que a inteligência artificial moderna não 'pensa', mas processa estatísticas em redes neurais de larga escala?",
  "Você sabia que o algoritmo de compressão ZIP foi criado por Phil Katz e o formato é aberto para qualquer um implementar?",
  "Você sabia que a primeira mensagem SMS da história foi enviada em 1992 e dizia apenas 'Merry Christmas'?",
  "Você sabia que o kernel do Linux está dentro de quase todos os televisores inteligentes, carros modernos e roteadores do mundo?",
  "Você sabia que o sistema operacional de tempo real (RTOS) é obrigatório em aviões e equipamentos médicos para garantir respostas em milissegundos?",
  "Você sabia que o 'Shell' é a camada de texto que envolve o Kernel, permitindo que o usuário envie comandos diretamente ao sistema?",
  "Você sabia que o arquivo '.exe' no Windows segue o padrão PE (Portable Executable), que contém cabeçalhos para carregar o programa na RAM?",
  "Você sabia que o 'Symbolic Link' (Symlink) é um arquivo pequeno que aponta para outro arquivo ou pasta, economizando espaço e organização?",
  "Você sabia que em sistemas Unix-like, literalmente 'tudo é um arquivo', incluindo seu teclado e o tráfego da rede?",
  "Você sabia que o diretório '/dev/null' no Linux é um buraco negro digital: tudo o que você envia para lá desaparece para sempre?",
  "Você sabia que o formato de imagem PNG foi criado como uma alternativa livre de patentes ao formato GIF nos anos 90?",
  "Você sabia que fotos em JPG perdem qualidade toda vez que são salvas novamente devido ao algoritmo de compressão com perdas?",
  "Você sabia que o sistema de arquivos NTFS da Microsoft usa um 'Journal' para registrar mudanças e evitar corrupção de arquivos em quedas de luz?",
  "Você sabia que o 'Swap' é um espaço no disco usado como memória RAM virtual quando a memória física do computador acaba?",
  "Você sabia que o código-fonte de sites populares como o Google tem bilhões de linhas de código armazenadas em um único repositório gigante?",
  "Você sabia que o vírus 'Ika-Tako' no Japão substituía todos os arquivos do usuário por imagens de lulas e polvos?",
  "Você sabia que o 'Dark Web' é apenas uma parte da Deep Web que exige softwares específicos como o Tor para ser acessada?",
  "Você sabia que a vulnerabilidade 'Log4Shell' em 2021 permitia que hackers controlassem servidores rodando Java apenas enviando uma string de texto?",
  "Você sabia que o primeiro firewall comercial foi o DEC SEAL, lançado em 1991?",
  "Você sabia que o ataque 'Pass-the-Hash' permite que um invasor use a senha cifrada de um usuário para se logar sem nunca saber a senha real?",
  "Você sabia que a técnica 'Clickjacking' induz o usuário a clicar em algo invisível ou disfarçado em uma página web?",
  "Você sabia que o ataque 'Replay' captura uma transmissão de rede legítima e a repete para ganhar acesso não autorizado?",
  "Você sabia que o 'Botnet' é uma rede de milhares de computadores infectados que podem ser controlados por um único hacker?",
  "Você sabia que o primeiro ataque de ransomware da história foi distribuído via disquetes físicos em uma conferência de AIDS em 1989?",
  "Você sabia que a técnica 'Degaussing' usa campos magnéticos fortes para apagar dados de discos rígidos de forma irrecuperável?",
  "Você sabia que o ataque 'Side-channel' extrai informações monitorando o consumo de energia ou as ondas eletromagnéticas de um processador?",
  "Você sabia que o padrão de segurança Wi-Fi WPA2 foi quebrado pelo ataque KRACK, forçando o surgimento do WPA3?",
  "Você sabia que o 'White Hat' é um hacker do bem, o 'Black Hat' é o criminoso, e o 'Grey Hat' atua em uma área ética cinzenta?",
  "Você sabia que o ataque 'Slowloris' permite que um único computador derrube um servidor web enviando requisições extremamente lentas?",
  "Você sabia que a vulnerabilidade 'ProxyLogon' em servidores Microsoft Exchange permitiu ataques em massa contra governos em 2021?",
  "Você sabia que a análise heurística em antivírus tenta prever se um programa é vírus baseado em comportamentos suspeitos, não apenas assinaturas?",
  "Você sabia que o 'Malvertising' usa anúncios legítimos em sites famosos para espalhar malware sem que o dono do site saiba?",
  "Você sabia que o ataque de 'Dicionário' testa apenas as palavras e senhas mais comuns em vez de tentar combinações aleatórias?",
  "Você sabia que a biometria não é uma senha, mas sim um identificador de usuário que não pode ser resetado se for roubado?",
  "Você sabia que o protocolo Kerberos recebeu o nome do cão de três cabeças da mitologia grega que guarda o inferno?",
  "Você sabia que o 'Cold Boot Attack' permite ler dados da memória RAM mesmo após o computador ter sido desligado, se os chips forem resfriados?",
  "Você sabia que o 'Judicial Overlay' é uma técnica em dispositivos móveis que desenha uma tela falsa sobre o app do banco para roubar a senha?",
  "Você sabia que o ataque 'Juice Jacking' ocorre quando você carrega seu celular em portas USB públicas modificadas para roubar dados?",
  "Você sabia que a vulnerabilidade 'Bash Door' (Shellshock) permitia executar comandos no Linux através de variáveis de ambiente maliciosas?",
  "Você sabia que o 'Script Kiddie' é um termo pejorativo para pessoas que usam ferramentas de hacking prontas sem entender como funcionam?",
  "Você sabia que o 'Penetration Testing' (Pentest) é uma simulação autorizada de um ataque real para medir a segurança de uma empresa?",
  "Você sabia que a 'Cerca de Ar' (Air Gap) pode ser burlada usando vibrações do cooler ou frequências de rádio geradas pela CPU?",
  "Você sabia que o ataque 'Zero Font' esconde códigos maliciosos em emails usando fontes de tamanho zero para enganar filtros de spam?",
  "Você sabia que o 'Rainbow Table' é um banco de dados gigante pré-calculado para reverter senhas cifradas de volta ao texto original?",
  "Você sabia que o primeiro worm de celular, o 'Cabir', se espalhava via Bluetooth em celulares Symbian em 2004?",
  "Você sabia que a 'Autenticação Multifator' (MFA) pode envolver: algo que você sabe, algo que você tem e algo que você é?",
  "Você sabia que o ataque 'Waling' é um tipo de phishing direcionado especificamente a executivos de alto nível (as baleias)?",
  "Você sabia que a 'Análise Forense Computacional' é a ciência de coletar evidências digitais que podem ser aceitas em tribunais?",
  "Você sabia que o ataque 'SIM Swap' permite que criminosos roubem seu número de telefone ligando para a operadora e se passando por você?",
  "Você sabia que em C, uma string é apenas um array de caracteres que termina obrigatoriamente com o caractere nulo '\\0'?",
  "Você sabia que o 'Little Endian' armazena o byte menos significativo no endereço de memória mais baixo?",
  "Você sabia que o compilador Clang foi criado como uma alternativa mais rápida e modular ao antigo GCC?",
  "Você sabia que o 'Instruction Set Architecture' (ISA) é o contrato entre o hardware do processador e o software que roda nele?",
  "Você sabia que a instrução de Assembly 'XOR EAX, EAX' é uma forma comum e rápida de zerar o registrador EAX?",
  "Você sabia que o 'Memory Leak' ocorre quando um programa pede RAM ao sistema mas 'esquece' de devolver ao terminar de usar?",
  "Você sabia que o 'Inline Assembly' permite escrever código de baixo nível diretamente dentro de um programa em C ou C++?",
  "Você sabia que a 'Recursão Infinita' em um código causa o erro de 'Stack Overflow' porque a pilha de memória esgota seu limite?",
  "Você sabia que os processadores de 32 bits podem gerenciar no máximo 4GB de memória RAM?",
  "Você sabia que a transição para 64 bits permitiu que computadores endereçassem até 16 exabytes de RAM?",
  "Você sabia que o cache L1 da CPU é centenas de vezes mais rápido que a memória RAM comum, mas também muito menor?",
  "Você sabia que um 'Arquivo Binário' não pode ser lido em editores de texto comuns porque seus dados não seguem o padrão de codificação de caracteres?",
  "Você sabia que o 'Garbage Collector' do Java pode causar o efeito 'Stop the World', onde toda a aplicação para para limpar a memória?",
  "Você sabia que o 'Kernel Mode' permite acesso ilimitado ao hardware, enquanto o 'User Mode' restringe o que um app comum pode fazer?",
  "Você sabia que o 'Microkernel' é um design de sistema operacional onde apenas as funções mínimas rodam com privilégios de núcleo?",
  "Você sabia que o 'Kernel Monolítico' (como o do Linux) inclui drivers e sistemas de arquivos rodando no espaço mais privilegiado?",
  "Você sabia que as instruções 'Vectored I/O' permitem ler ou escrever dados em múltiplos buffers de memória com uma única operação?",
  "Você sabia que o 'Dirty Bit' é uma flag na memória que indica se um dado foi modificado e precisa ser salvo de volta no disco?",
  "Você sabia que o 'Thrashing' é uma condição onde o sistema gasta mais tempo movendo dados para o disco (Virtual Memory) do que executando o programa?",
  "Você sabia que a técnica 'Copy-on-Write' otimiza o uso de memória permitindo que múltiplos processos compartilhem a mesma RAM até que um deles altere o dado?",
  "Você sabia que o 'Segmentation Fault' é o erro que ocorre quando um programa tenta ler memória que pertence ao Kernel ou a outro programa?",
  "Você sabia que em C, o operador '&' retorna o endereço de memória de uma variável, enquanto o '*' acessa o valor naquele endereço?",
  "Você sabia que a 'Tabela GOT' (Global Offset Table) permite que programas em baixo nível chamem funções de bibliotecas dinâmicas?",
  "Você sabia que o 'Spinlock' é um tipo de trava onde um processo fica rodando em loop infinito até que um recurso seja liberado?",
  "Você sabia que em Assembly x86_64 existem 16 registradores de propósito geral, o dobro da arquitetura de 32 bits?",
  "Você sabia que o 'Critical Section' é a parte de um código que acessa recursos compartilhados e que nunca deve ser executada por dois processos ao mesmo tempo?",
  "Você sabia que a instrução 'INT 3' é usada por debuggers para criar um ponto de parada (breakpoint) no código executável?",
  "Você sabia que o 'Big-O notation' é usado para medir quão lento um algoritmo fica à medida que o volume de dados aumenta?",
  "Você sabia que a 'Arquitetura de von Neumann' descreve computadores que usam a mesma memória para dados e para o código do programa?",
  "Você sabia que o registrador 'Instruction Pointer' (IP) armazena o endereço da próxima instrução que a CPU deve executar?",
  "Você sabia que o 'Dangling Pointer' é um ponteiro que aponta para uma memória que já foi deletada, podendo causar crashes ou falhas de segurança?",
  "Você sabia que em baixo nível, um 'Hello World' exige abrir um arquivo especial de saída padrão (stdout) e escrever bytes nele?",
  "Você sabia que o 'Memory Barrier' é uma instrução que força a CPU a terminar todas as operações de memória pendentes antes de continuar?",
  "Você sabia que o 'Self-modifying code' é um programa que altera seu próprio código em tempo de execução, técnica usada por vírus e proteções?",
  "Você sabia que o sinal 'SIGKILL' no Linux força o encerramento imediato de um processo sem dar tempo para ele salvar nada?",
  "Você sabia que em C++, nomes de funções sofrem 'Name Mangling' para suportar sobrecarga, o que as torna estranhas no arquivo binário final?",
  "Você sabia que o 'Endianness' é um problema comum ao transferir arquivos binários entre processadores Intel (Little) e processadores de rede (Big)?",
  "Você sabia que o 'Assembly' não é uma linguagem única, mas cada família de processadores tem o seu próprio conjunto de instruções?",
  "Você sabia que a técnica 'Bitfield' permite armazenar múltiplos estados booleanos dentro de um único byte em C?",
  "Você sabia que o 'Semaphore' foi inventado por Edsger Dijkstra para gerenciar o acesso de processos a recursos limitados?",
  "Você sabia que a função 'printf' em C é uma das mais pesadas da biblioteca padrão por ter que analisar strings de formato complexas?",
  "Você sabia que em C, declarar uma variável como 'volatile' avisa ao compilador para nunca otimizar aquela variável pois seu valor pode mudar externamente?",
  "Você sabia que o erro 'Integer Overflow' ocorre quando um cálculo ultrapassa o valor máximo que o registrador pode armazenar, voltando para zero?",
  "Você sabia que a instrução 'LEA' (Load Effective Address) é frequentemente usada por compiladores para fazer cálculos matemáticos rápidos em x86?",
  "Você sabia que o 'Symbol Table' em um compilador guarda o nome de todas as variáveis e funções para que o código possa ser linkado?",
  "Você sabia que as 'Flags' da CPU (como Zero Flag ou Carry Flag) informam o resultado da última operação matemática realizada?",
  "Você sabia que o 'Assembler' transforma o texto do código em bytes, mas o 'Linker' é quem resolve as chamadas entre diferentes arquivos?",
  "Você sabia que o 'Kernel' é o único programa que roda com privilégios totais sobre o hardware do seu computador?",
  "Você sabia que no Linux o processo de ID número 1 é o 'init', pai de todos os outros processos do sistema?",
  "Você sabia que o 'Z-buffering' é uma técnica de hardware para decidir qual objeto 3D deve aparecer na frente de outro na tela?",
  "Você sabia que o 'RAID 0' aumenta a velocidade do disco mas se um dos discos falhar, todos os seus dados são perdidos?",
  "Você sabia que a fibra óptica usa reflexão interna total para guiar a luz por milhares de quilômetros com perda mínima de sinal?",
  "Você sabia que o 'Latency' é o tempo que um dado leva para viajar, enquanto 'Bandwidth' é a quantidade de dados que cabe no canal?",
  "Você sabia que o chip 'CMOS' na placa-mãe guarda a data e hora do sistema usando uma pequena bateria de relógio?",
  "Você sabia que o 'Socket' em redes é a combinação de um endereço IP e uma porta de comunicação?",
  "Você sabia que o protocolo UDP é chamado de 'não confiável' porque ele envia dados sem conferir se eles chegaram ao destino?",
  "Você sabia que o 'MAC Address' é o endereço físico gravado de fábrica em cada placa de rede no mundo?",
  "Você sabia que a subrede IP permite dividir uma rede grande em pedaços menores para melhorar a segurança e o tráfego?",
  "Você sabia que no protocolo TCP, cada pacote recebido deve ser confirmado com um 'ACK', ou o computador enviará o dado novamente?",
  "Você sabia que o 'Ping' usa o protocolo ICMP para testar a comunicação entre dois computadores na rede?",
  "Você sabia que o 'TTL' (Time to Live) em um pacote de rede impede que ele fique circulando na internet para sempre em caso de erro?",
  "Você sabia que o 'Gateway' é o endereço do roteador que seu computador usa para sair da rede local para a internet?",
  "Você sabia que o 'DNS Cache Poisoning' é um ataque que engana o seu computador para ele ir para um site falso em vez do real?",
  "Você sabia que o 'Hot-Swapping' permite trocar discos rígidos ou componentes com o computador ligado sem causar travamentos?",
  "Você sabia que o 'Multicast' permite enviar um único fluxo de dados (como um vídeo ao vivo) para milhares de usuários ao mesmo tempo?",
  "Você sabia que a 'VLAN' (Virtual LAN) permite criar redes separadas dentro do mesmo switch físico para isolar departamentos?",
  "Você sabia que em 1970, o tempo Unix (Epoch) começou a contar os segundos a partir de 1º de Janeiro?",
  "Você sabia que o sistema 'VMS' influenciou pesadamente o design interno do Windows NT?",
  "Você sabia que a primeira planilha eletrônica do mundo foi o VisiCalc, lançado em 1979?",
  "Você sabia que o compilador 'Fortran' foi um dos primeiros a ser capaz de otimizar código para alta performance?",
  "Você sabia que o protocolo Bluetooth usa 'Frequency Hopping' para mudar de canal 1600 vezes por segundo e evitar interferências?",
  "Você sabia que o CD-ROM original foi projetado para áudio e só depois adaptado para dados de computador?",
  "Você sabia que o formato de arquivo 'PDF' significa Portable Document Format e visava ser independente de plataforma?",
  "Você sabia que o padrão 'Wi-Fi' original operava a apenas 2 Mbps em 1997?",
  "Você sabia que os teclados de membrana são mais baratos, mas teclados mecânicos usam switches individuais para cada tecla?",
  "Você sabia que o mouse de bola usava sensores ópticos internos para detectar o movimento dos rodízios?",
  "Você sabia que o sistema 'Solaris' era um dos sistemas Unix comerciais mais poderosos antes do Linux dominar?",
  "Você sabia que a arquitetura 'X64' foi inventada pela AMD e depois adotada pela Intel como padrão?",
  "Você sabia que a primeira versão do Microsoft Office continha apenas Word, Excel e PowerPoint?",
  "Você sabia que o arquivo 'BIOS.BIN' é a imagem física que fica gravada num chip de memória flash na placa-mãe?",
  "Você sabia que o processador 'Pentium' da Intel teve um bug famoso em 1994 que errava cálculos de divisão?",
  "Você sabia que o 'BitTorrent' revolucionou a distribuição de arquivos pesados usando a banda dos próprios usuários?",
  "Você sabia que o 'Napster' foi o primeiro grande serviço de compartilhamento P2P a abalar a indústria da música?",
  "Você sabia que o 'Steam' da Valve foi criado originalmente apenas para atualizar o jogo Counter-Strike?",
  "Você sabia que a linguagem 'Erlang' foi criada para gerenciar switches de telefonia com estabilidade de 99.999%?",
  "Você sabia que o 'Cobol' ainda é responsável por rodar os sistemas centrais da maioria das instituições bancárias do mundo?",
  "Você sabia que o 'PostgreSQL' começou como um projeto de pesquisa chamado POSTGRES na Universidade de Berkeley?",
  "Você sabia que o 'MySQL' recebeu esse nome em homenagem à filha do cofundador, chamada My?",
  "Você sabia que o 'SQLite' não é um servidor, mas uma biblioteca que você anexa diretamente ao seu código?",
  "Você sabia que os endereços IPv4 suportam apenas cerca de 4.3 bilhões de conexões simultâneas no mundo?",
  "Você sabia que o 'IPv6' usa endereços de 128 bits, permitindo trilhões de vezes mais conexões que o IPv4?",
  "Você sabia que o 'Border Gateway Protocol' (BGP) é o sistema que decide qual caminho os seus dados farão entre os países?",
  "Você sabia que o código de erro '404' foi padronizado pelo criador da web para indicar que um recurso não foi encontrado?",
  "Você sabia que a 'Apple' quase lançou um smartphone com disco rígido interno antes do iPhone?",
  "Você sabia que o 'Android' era focado em ser um sistema para câmeras digitais antes de ser adaptado para celulares?",
  "Você sabia que o 'Symbian' foi o sistema operacional de smartphones mais usado no mundo nos anos 2000?",
  "Você sabia que o 'Blackberry' era o celular preferido de executivos por causa de seu teclado físico e segurança no email?",
  "Você sabia que a 'Nokia' já foi a maior fabricante de celulares do mundo por 14 anos seguidos?",
  "Você sabia que o 'iPad' foi testado internamente pela Apple anos antes de lançarem o iPhone?",
  "Você sabia que o primeiro 'Smartphone' da história foi o IBM Simon em 1992?",
  "Você sabia que os 'Emojis' foram criados no Japão para economizar caracteres em mensagens curtas de pager?",
  "Você sabia que o 'Snake' (jogo da cobrinha) foi o primeiro sucesso massivo de entretenimento móvel nos celulares Nokia?",
  "Você sabia que o 'Flash' da Adobe dominou a animação na web por 15 anos antes de ser morto pelo HTML5?",
  "Você sabia que o 'Netscape' foi o navegador que introduziu os cookies, SSL e JavaScript no mundo?",
  "Você sabia que a 'Google' quase foi vendida para o Yahoo por apenas 1 milhão de dólares no começo?",
  "Você sabia que o 'AltaVista' era o buscador mais potente do mundo antes da chegada do PageRank do Google?",
  "Você sabia que o 'ICQ' foi o primeiro programa de mensagens instantâneas a se tornar viral no mundo?",
  "Você sabia que o 'MSN Messenger' foi o sucessor espiritual de bate-papos que dominou os anos 2000?",
  "Você sabia que o 'Gmail' foi lançado em 1 de abril de 2004 e muitos acharam que era uma piada de primeiro de abril?",
  "Você sabia que a 'Wikipédia' recebe mais de 15 bilhões de visualizações de páginas por mês?",
  "Você sabia que o 'GitHub' usa o sistema Git por trás de tudo para versionar o código dos desenvolvedores?",
  "Você sabia que o 'Vercel' e o 'Netlify' popularizaram o deploy instantâneo de sites estáticos modernos?",
  "Você sabia que o 'Cloudflare' protege cerca de 20% de todo o tráfego da internet contra ataques?",
  "Você sabia que o 'Heroku' foi um dos pioneiros no conceito de plataforma como serviço (PaaS)?",
  "Você sabia que o 'Slack' começou como um sistema de chat interno de uma empresa que estava tentando criar um jogo?",
  "Você sabia que o 'Trello' popularizou o uso de quadros Kanban digitais para gestão de tarefas?",
  "Você sabia que o 'Docker' usa recursos do kernel Linux chamados Cgroups e Namespaces para isolar containers?",
  "Você sabia que o 'Kubernetes' foi aberto pelo Google para que outras empresas pudessem gerenciar containers em escala?",
  "Você sabia que o 'Terraform' permite criar infraestrutura inteira (servidores, redes) apenas escrevendo arquivos de texto?",
  "Você sabia que o 'Ansible' usa o protocolo SSH para configurar servidores sem precisar de um agente instalado neles?",
  "Você sabia que o 'Jenkins' é o servidor de automação de build (CI/CD) mais usado do mundo?",
  "Você sabia que o 'VsCode' é o editor de código mais popular hoje e é escrito inteiramente em TypeScript?",
  "Você sabia que o 'Sublime Text' foi amado por anos por ser extremamente rápido e ter o famoso minimapa lateral?",
  "Você sabia que o 'Vim' é um editor focado em produtividade onde você nunca precisa tirar as mãos do teclado?",
  "Você sabia que o 'Emacs' é um editor de texto tão potente que permite ler emails, navegar na web e até rodar jogos dentro dele?",
  "Você sabia que o 'IntelliJ IDEA' é considerado a melhor IDE para desenvolvimento Java por sua inteligência de código?",
  "Você sabia que o 'Android Studio' é baseado na engine do IntelliJ para facilitar a vida dos devs mobile?",
  "Você sabia que o 'Xcode' é a ferramenta obrigatória da Apple para quem quer criar apps para iPhone ou Mac?",
  "Você sabia que o 'Postman' começou como uma simples extensão do Chrome e hoje é a maior plataforma de testes de API do mundo?",
  "Você sabia que o 'Insomnia' é o principal concorrente do Postman focado em simplicidade e design?",
  "Você sabia que o 'Wireshark' é a ferramenta definitiva para quem precisa analisar cada pacote que viaja pela placa de rede?",
  "Você sabia que o 'Nmap' é usado até em filmes de Hollywood (como Matrix) por ser uma ferramenta real de escaneamento de rede?",
  "Você sabia que a 'Burp Suite' é o canivete suíço para profissionais que fazem pentest em aplicações web?",
  "Você sabia que o 'Metasploit' é um framework que reúne milhares de exploits prontos para uso em auditorias de segurança?",
  "Você sabia que o 'Zabbix' e o 'Nagios' são os veteranos no monitoramento de servidores e rede?",
  "Você sabia que o 'Prometheus' e o 'Grafana' são o par perfeito para monitorar aplicações modernas em containers?",
  "Você sabia que o 'Elasticsearch' permite fazer buscas em segundos dentro de terabytes de logs de servidores?",
  "Você sabia que o 'Redis' é um banco de dados in-memory tão rápido que é usado para cache de sessões em tempo real?",
  "Você sabia que o 'Apache Kafka' permite processar trilhões de eventos por dia em sistemas de big data?",
  "Você sabia que o 'RabbitMQ' é um serviço de mensageria que permite que partes diferentes de um sistema se comuniquem?",
  "Você sabia que o 'Zookeeper' é usado para coordenar serviços em sistemas distribuídos complexos?",
  "Você sabia que o 'Nginx' é o servidor web que substituiu o Apache em performance gerenciando milhões de conexões?",
  "Você sabia que o 'Apache HTTP Server' já foi o responsável por rodar mais de 60% de toda a internet?",
  "Você sabia que os 'Microserviços' dividem um sistema pesado em pequenas partes independentes que se comunicam?",
  "Você sabia que as 'Serverless Functions' rodam seu código na nuvem sem que você precise gerenciar um servidor sequer?",
  "Você sabia que o 'JAMStack' foca em performance pré-renderizando páginas HTML para entrega via CDN?",
  "Você sabia que as 'Progressive Web Apps' (PWA) agem como apps instalados mas rodam dentro do navegador?",
  "Você sabia que o 'WebAssembly' permite rodar código C++ ou Rust no navegador com performance quase nativa?",
  "Você sabia que o 'Shadow DOM' permite isolar o CSS de um componente web para que ele não afete o resto da página?",
  "Você sabia que o 'React' popularizou o uso do Virtual DOM para atualizar telas de forma extremamente eficiente?",
  "Você sabia que o 'Vue.js' foi criado para ser o melhor dos dois mundos entre Angular e React?",
  "Você sabia que o 'Svelte' remove todo o framework na hora do build, entregando apenas código JavaScript puro?",
  "Você sabia que o 'Angular' do Google impôs o uso massivo de TypeScript no mundo do frontend?",
  "Você sabia que as 'Single Page Applications' (SPA) carregam o site uma única vez e trocam as páginas sem recarregar o navegador?",
  "Você sabia que o 'CSS Grid' e o 'Flexbox' acabaram com a era sombria de alinhar layouts usando tabelas ou floats?",
  "Você sabia que o 'WebRTC' é a tecnologia que permite você fazer videochamadas diretamente pelo navegador sem plugins?",
  "Você sabia que o 'Socket.io' permite criar chats em tempo real garantindo a conexão mesmo em redes instáveis?",
  "Você sabia que o 'JSON' substituiu o XML por ser muito mais fácil de ler e mais leve para trafegar na rede?",
  "Você sabia que o 'GraphQL' permite que o frontend peça exatamente os dados que precisa, evitando o over-fetching?",
  "Você sabia que o 'OAuth 2.0' é o sistema que permite você 'logar com Google' em outros sites sem dar sua senha?",
  "Você sabia que os 'JWT Tokens' guardam informações do usuário cifradas e são usados para autenticação em APIs?",
  "Você sabia que o 'CORS' é um sistema de segurança do navegador que bloqueia um site de ler dados de outro site diferente?",
  "Você sabia que o 'V8' é o motor de JavaScript do Google que tornou o Chrome e o Node.js tão rápidos?",
  "Você sabia que o 'Bun' é um novo runtime que promete ser muito mais rápido que o Node.js usando a engine do Safari?",
  "Você sabia que o 'Deno' foi criado pelo pai do Node.js corrigindo erros de design (como o node_modules)?",
  "Você sabia que o 'TypeScript' é apenas um 'superset' que adiciona tipos ao JavaScript e depois desaparece no build?",
  "Você sabia que o 'Rust' é a linguagem mais amada pelos programadores por anos no Stack Overflow devido à sua segurança?",
  "Você sabia que o 'Go' foi criado no Google especificamente para facilitar o desenvolvimento de servidores escaláveis?",
  "Você sabia que o 'Python' se tornou a rainha da ciência de dados por causa de bibliotecas matemáticas incríveis?",
  "Você sabia que o 'C#' é a base da engine de jogos Unity, usada por milhões de desenvolvedores indie?",
  "Você sabia que o 'Swift' substituiu o Objective-C na Apple para tornar o desenvolvimento de apps muito mais simples?",
  "Você sabia que o 'Kotlin' é a linguagem moderna para Android que reduziu drasticamente o código repetitivo do Java?",
  "Você sabia que o 'PHP 8' trouxe melhorias de performance JIT que o tornaram competitivo com o Node.js?",
  "Você sabia que o 'Laravel' transformou o ecossistema PHP focando em elegância e ferramentas modernas?",
  "Você sabia que o 'Ruby on Rails' foi o framework que inspirou quase todos os outros frameworks web modernos?",
  "Você sabia que o 'C++' ainda é a escolha número 1 quando o assunto é performance máxima em jogos e browsers?",
  "Você sabia que a linguagem 'C' é a mãe de quase todos os sistemas operacionais modernos que usamos hoje?",
  "Você sabia que o 'Assembly' ainda é usado hoje para otimizar partes críticas de drivers e sistemas de segurança?",
  "Você sabia que as 'Instruções Vetoriais' permitem acelerar cálculos de IA em milhares de vezes?",
  "Você sabia que a 'Computação Quântica' usa o fenômeno da superposição para testar bilhões de caminhos ao mesmo tempo?",
  "Você sabia que a 'Blockchain' é tecnicamente inquebrável por causa da rede descentralizada que valida cada transação?",
  "Você sabia que os 'Smart Contracts' são códigos que auto-executam transações financeiras sem intermediários barulhentos?",
  "Você sabia que as 'NFTs' usam a blockchain para garantir a raridade digital de um arquivo ou arte?",
  "Você sabia que a 'Web3' visa tirar o controle da internet das Big Techs e devolver aos usuários?",
  "Você sabia que o 'Metaverso' busca unir a internet 2D com mundos virtuais imersivos em 3D?",
  "Você sabia que as 'Redes Neurais' são inspiradas no funcionamento básico de neurônios do cérebro humano?",
  "Você sabia que o 'Deep Learning' usa múltiplas camadas de redes neurais para reconhecer vozes e faces?",
  "Você sabia que o 'Natural Language Processing' (NLP) é a tecnologia que permite chatubots entenderem o que você escreve?",
  "Você sabia que o 'Large Language Model' (LLM) como o GPT foi treinado lendo quase toda a internet aberta?",
  "Você sabia que a 'Visão Computacional' permite que robôs e carros entendam obstáculos usando apenas câmeras?",
  "Você sabia que a 'IA Generativa' pode criar imagens, músicas e códigos do zero baseada apenas em comandos de texto?",
  "Você sabia que o 'Turing Complete' é um termo para sistemas que conseguem realizar qualquer cálculo computável?",
  "Você sabia que até o jogo 'Minecraft' é Turing Complete, permitindo criar computadores funcionais dentro dele?",
  "Você sabia que os 'Algoritmos Genéticos' simulam a evolução natural para encontrar a melhor solução para um problema?",
  "Você sabia que o 'Heuristic Search' tenta encontrar soluções rápidas quando uma busca exaustiva levaria séculos?",
  "Você sabia que o 'Data Mining' busca padrões escondidos em montanhas de dados aparentemente sem sentido?",
  "Você sabia que a 'Data Visualization' transforma números complexos em gráficos que humanos conseguem entender rápido?",
  "Você sabia que o 'Big Data' lida com os 3 Vs: Volume, Velocidade e Variedade de dados?",
  "Você sabia que a 'Computação em Nuvem' (Cloud) permite alugar supercomputadores pagando apenas pelo que você usa por minuto?",
  "Você sabia que o 'Datacenter' moderno é refrigerado por sistemas gigantescos para evitar que os chips derretam de calor?",
  "Você sabia que os 'Cabos de Fibra Óptica' submarinos atravessam oceanos inteiros para conectar a internet global?",
  "Você sabia que a 'Satélite (Starlink)' é o futuro da internet para lugares remotos onde cabos não conseguem chegar?",
  "Você sabia que o 'Wi-Fi 7' promete ser tão estável e rápido quanto um cabo de rede tradicional?",
  "Você sabia que o '5G' não é só para celular, mas para conectar milhões de dispositivos IoT (Internet das Coisas)?",
  "Você sabia que a 'Internet das Coisas' (IoT) conecta desde geladeiras até sensores em turbinas de aviões?",
  "Você sabia que as 'Smart Homes' usam protocolos como Zigbee e Matter para conversar entre dispositivos de marcas diferentes?",
  "Você sabia que os 'Wearables' (relógios inteligentes) monitoram sua saúde cruzando dados em tempo real com seu celular?",
  "Você sabia que a 'Realidade Virtual' (VR) engana seu cérebro criando uma visão 3D completa ao redor dos seus olhos?",
  "Você sabia que a 'Realidade Aumentada' (AR) projeta informações digitais sobre o mundo real que você vê através da câmera?",
  "Você sabia que a 'Impressão 3D' permite criar peças complexas de metal ou plástico partindo de um modelo digital?",
  "Você sabia que o 'Lidar' é a tecnologia de laser que permite que carros autônomos 'enxerguem' o mundo em 3D?",
  "Você sabia que a 'Criptografia de Curva Elíptica' é o que garante a segurança do seu WhatsApp com chaves pequenas e potentes?",
  "Você sabia que o 'Zero Trust' é um modelo de segurança que não confia em ninguém, mesmo que já esteja dentro da rede da empresa?",
  "Você sabia que o 'SOC' (Security Operations Center) é a sala de guerra onde especialistas monitoram ataques hacker 24 horas?",
  "Você sabia que o 'Blue Team' defende o sistema enquanto o 'Red Team' simula o ataque para encontrar falhas?",
  "Você sabia que o 'Bug Bounty' é um programa onde empresas pagam hackers para encontrarem erros em seus sistemas de forma ética?",
  "Você sabia que a 'Engenharia Social' é a arte de manipular pessoas para que elas entreguem segredos técnicos ou senhas?",
  "Você sabia que o 'MFA' (Multi Factor Auth) é a defesa mais simples e eficiente contra o roubo de senhas?",
  "Você sabia que a 'Privacidade Diferencial' permite analisar dados de usuários sem que ninguém consiga identificar quem é quem?",
  "Você sabia que a 'Computação de Borda' (Edge) aproxima o processamento de dados do usuário final para reduzir o lag?",
  "Você sabia que os 'Supercomputadores' modernos usam milhares de GPUs ligadas juntas para simular o clima do planeta?",
  "Você sabia que a 'Litografia' de 3 nanômetros é o limite físico atual da fabricação de chips de silício?",
  "Você sabia que a 'Fotônica' busca substituir elétrons por luz dentro dos chips para acabar com o problema do calor?",
  "Você sabia que o 'BIOS' foi substituído pelo 'UEFI' para que computadores pudessem iniciar em discos gigantes de forma segura?",
  "Você sabia que o 'Zabbix' e o 'Nagios' monitoram a saúde de servidores de grandes empresas em todo o mundo?",
  "Você sabia que a 'Nginx' processa milhões de sites simultâneos hoje por ser incrivelvelmente leve em memória?",
  "Você sabia que o 'Apache' ainda é o rei da compatibilidade e roda em quase qualquer servidor antigo?",
  "Você sabia que o 'V8' é tão rápido que permitiu que o JavaScript saísse do navegador e fosse rodar no servidor com Node.js?",
  "Você sabia que o 'JSON' é baseado na forma como o JavaScript escreve objetos, mas hoje é usado por todas as linguagens?",
  "Você sabia que o 'Kubernetes' gerencia os frotas de containers para que se um servidor cair, outro assuma na hora?",
  "Você sabia que a 'AWS' é tão grande que quando ela tem uma queda, metade dos sites famosos da internet param junto?",
  "Você sabia que o 'Open Source' mudou o mundo permitindo que código de qualidade seja gratuito e seguro para todos usarem?",
  "Você sabia que o 'Linux' é o maior exemplo de colaboração humana na história da tecnologia?",
  "Você sabia que o 'Git' facilitou o trabalho de milhões de programadores permitindo que equipes mexam no mesmo código sem brigas?",
  "Você sabia que o 'Sudo' é um comando que dá poderes de superusuário para quem precisa configurar coisas críticas?",
  "Você sabia que a 'Terminal' é a ferramenta mais poderosa de um programador, permitindo controlar tudo apenas com texto?",
  "Você sabia que a 'API' é a ponte que permite que o seu app de comida converse com o sistema de pagamentos de forma segura?",
  "Você sabia que o 'Backend' é onde a lógica pesada e os dados moram, enquanto o 'Frontend' é o que você vê e toca?",
  "Você sabia que a 'UX (User Experience)' estuda como o usuário se sente ao usar um sistema para tornar tudo mais fácil e agradável?",
  "Você sabia que a 'UI (User Interface)' foca na beleza e disposição visual dos botões e cores de um aplicativo?",
  "Você sabia que o 'SEO' é o conjunto de técnicas para fazer o Google encontrar e rankear o seu site no topo das buscas?",
  "Você sabia que o 'DevOps' é a cultura de unir quem programa com quem cuida dos servidores para um ciclo de vida mais rápido?",
  "Você sabia que o 'Clean Code' prega que código deve ser escrito para humanos lerem, e não apenas para máquinas rodarem?",
  "Você sabia que os 'Design Patterns' são soluções prontas para problemas que todo programador encontra ao criar sistemas?",
  "Você sabia que os 'Algoritmos' são apenas receitas de bolo passo-a-passo para o computador resolver uma tarefa?",
  "Você sabia que o 'Custo Computacional' mede quanto tempo ou memória um algoritmo gasta para terminar?",
  "Você sabia que a 'Engenharia de Software' aplica métodos científicos para criar sistemas robustos, seguros e fáceis de manter?",
  "Você sabia que o CVE-2021-44228 (Log4Shell) permitia execução remota via JNDI e LDAP?",
  "Você sabia que o protocolo Kerberos usa o conceito de 'Tickets' para evitar o envio de senhas pela rede?",
  "Você sabia que a vulnerabilidade 'Poodle' forçou a aposentadoria definitiva do protocolo SSL 3.0?",
  "Você sabia que o ataque 'Golden Ticket' permite que um invasor se passe por qualquer usuário em um domínio Active Directory?",
  "Você sabia que o 'Salt' em criptografia de senhas deve ser único por usuário e cryptograficamente forte?",
  "Você sabia que o algoritmo ChaCha20 é frequentemente mais rápido que o AES em dispositivos que não possuem aceleração de hardware?",
  "Você sabia que o 'Perfect Forward Secrecy' (PFS) garante que, se uma chave mestre for roubada, as sessões passadas continuem seguras?",
  "Você sabia que o ataque 'Padding Oracle' permite que um invasor decifre mensagens CBC sem saber a chave?",
  "Você sabia que o protocolo TLS 1.3 removeu suporte a algoritmos antigos e inseguros como MD5 e SHA-1?",
  "Você sabia que o 'HSTS' instrui o navegador a sempre usar HTTPS para um domínio específico, evitando ataques de downgrade?",
  "Você sabia que a técnica de 'Typosquatting' consiste em registrar domínios parecidos com sites famosos (ex: g0ogle.com)?",
  "Você sabia que o 'Whaling' é um ataque de phishing focado especificamente em diretores e CEOs (as baleias da empresa)?",
  "Você sabia que o 'Stalkerware' é um tipo de malware silencioso usado para espionar parceiros ou familiares?",
  "Você sabia que o 'Ransomware-as-a-Service' (RaaS) permite que criminosos sem conhecimento técnico aluguem ransomwares prontos?",
  "Você sabia que o ataque 'SIM-Jacker' usava mensagens SMS invisíveis para rastrear a localização de celulares?",
  "Você sabia que o 'Blueborne' permitia que atacantes controlassem dispositivos via Bluetooth sem que o usuário fizesse nada?",
  "Você sabia que o 'Rowhammer' é um ataque de hardware que usa acessos rápidos à RAM para inverter bits e ganhar privilégios?",
  "Você sabia que o 'Dirty COW' foi uma vulnerabilidade no kernel Linux que permitia escalonamento de privilégios local por 9 anos?",
  "Você sabia que a falha 'Stagefright' no Android permitia invadir o celular apenas enviando um vídeo via MMS?",
  "Você sabia que o 'BadUSB' permite transformar qualquer pendrive em um teclado fantasma que digita comandos maliciosos?",
  "Você sabia que o 'SQLMap' é uma ferramenta automatizada capaz de detectar e explorar quase qualquer tipo de SQL Injection?",
  "Você sabia que o 'Aircrack-ng' é a suíte de ferramentas padrão para testar a segurança de redes Wi-Fi WEP e WPA?",
  "Você sabia que o 'Hashcat' é o quebrador de senhas mais rápido do mundo, explorando o poder bruto das GPUs?",
  "Você sabia que a 'Certificação CISSP' é uma das mais respeitadas mundialmente para profissionais de gestão de segurança?",
  "Você sabia que o 'Tor Browser' usa três camadas de nós (Entrance, Middle e Exit) para ocultar sua identidade?",
  "Você sabia que as 'Onion Services' ending in .onion não são indexadas por buscadores comuns como Google ou Bing?",
  "Você sabia que o 'BlackHat' e a 'DEF CON' são as maiores e mais famosas conferências de segurança do mundo em Las Vegas?",
  "Você sabia que o 'Chaos Communication Congress' (C3) é o maior encontro anual de hackers da Europa?",
  "Você sabia que o 'OSCP' é um exame de certificação de segurança 100% prático, onde você tem 24h para invadir servidores?",
  "Você sabia que o ataque 'Beaconing' é quando um malware sinaliza para o servidor do hacker pedindo novas ordens?",
  "Você sabia que o protocolo MESI é usado para manter a coerência dos dados entre os diferentes caches de uma CPU multinúcleo?",
  "Você sabia que o 'Translation Lookaside Buffer' (TLB) é um cache pequeno que acelera a tradução de endereços virtuais para físicos?",
  "Você sabia que em Assembly x86, a instrução 'CPUID' permite identificar qual o modelo exato e as funções suportadas pelo processador?",
  "Você sabia que o 'Microcódigo' permite que os fabricantes corrijam bugs críticos de hardware enviando atualizações via software?",
  "Você sabia que a 'Execução Especulativa' faz a CPU prever o caminho de um 'if' antes mesmo dele ser testado para ganhar velocidade?",
  "Você sabia que o 'Out-of-Order Execution' permite que a CPU execute instruções em uma ordem diferente da que foi escrita para nunca ficar ociosa?",
  "Você sabia que a 'Pilha de Segmentação' era como os processadores antigos organizavam a memória antes do modo protegido de 32 bits?",
  "Você sabia que o 'SMM' (System Management Mode) é o anel de privilégio -2 da CPU, rodando 'abaixo' do próprio Kernel?",
  "Você sabia que o 'VMX' (Virtual Machine Extensions) é o conjunto de instruções da Intel que permite rodar máquinas virtuais com alta performance?",
  "Você sabia que o 'Hyper-threading' permite que um único núcleo físico processe duas threads simultaneamente simulando dois núcleos lógicos?",
  "Você sabia que a instrução 'REP STOSB' em Assembly é usada para preencher blocos de memória com um valor específico de forma ultra rápida?",
  "Você sabia que em C, 'size_t' é o tipo correto para representar tamanhos de objetos porque ele se adapta à arquitetura (32 ou 64 bits)?",
  "Você sabia que o 'Linker Script' define exatamente em qual endereço de memória física cada parte do seu kernel será carregada?",
  "Você sabia que o 'Interrupt Latency' é o tempo que a CPU leva para responder a um sinal de hardware, sendo crítico para sistemas industriais?",
  "Você sabia que a 'Tabela de Mapeamento de E/S' (I/O Map) define quais portas a CPU deve usar para falar com o teclado ou disco?",
  "Você sabia que o 'Kernel Preemption' permite que uma tarefa importante interrompa o próprio Kernel para garantir o tempo real?",
  "Você sabia que o sistema de arquivos 'ZFS' usa somas de verificação em todos os dados para detectar e corrigir bits corrompidos no disco?",
  "Você sabia que o 'EXT4' usa o conceito de 'Extents' para reduzir a fragmentação e acelerar o acesso a arquivos gigantes?",
  "Você sabia que o 'Btrfs' permite criar 'Snapshots' instantâneos do sistema usando a técnica Copy-on-Write?",
  "Você sabia que o scheduler 'CFS' do Linux busca garantir que todos os processos recebam uma fatia justa de tempo de CPU?",
  "Você sabia que o 'OOM Killer' (Out of Memory) é o processo do Linux que escolhe qual programa matar quando a RAM acaba totalmente?",
  "Você sabia que a 'Pilha Atômica' garante que uma operação matemática seja concluída sem que outro núcleo da CPU interfira no meio?",
  "Você sabia que em C++ 'RAII' significa que a vida de um recurso (como um arquivo) está ligada ao tempo de vida de um objeto?",
  "Você sabia que o 'ELF' (Executable and Linkable Format) é o padrão de arquivos executáveis no Linux e sistemas BSD?",
  "Você sabia que o 'Mach-O' é o formato equivalente ao ELF usado nos sistemas da Apple (macOS e iOS)?",
  "Você sabia que o 'Dwarf' é o padrão de informações de debug que permite que o GDB saiba em qual linha do código fonte o programa travou?",
  "Você sabia que o 'Dynamic Loader' (ld.so) é o programa que carrega as bibliotecas .so necessárias antes de um app Linux iniciar?",
  "Você sabia que o comando 'strace' permite ver em tempo real todas as System Calls que um programa está fazendo para o Kernel?",
  "Você sabia que o 'GDB' (GNU Debugger) é capaz de pausar um programa e alterar valores na memória em tempo de execução?",
  "Você sabia que a 'Memória Compartilhada' (shm) permite que dois processos diferentes leiam e escrevam na mesma área da RAM?",
  "Você sabia que a 'Litografia de Extremo Ultravioleta' (EUV) usa luz com comprimento de onda de 13.5nm para imprimir chips?",
  "Você sabia que os espelhos das máquinas da ASML são tão planos que, se tivessem o tamanho da Alemanha, o maior calombo teria milímetros?",
  "Você sabia que o chip 'Apple M3' possui 25 bilhões de transistores condensados em uma área menor que uma moeda?",
  "Você sabia que o 'TDP' (Thermal Design Power) indica a quantidade de calor em Watts que o sistema de refrigeração precisa dissipar?",
  "Você sabia que as memórias 'ECC' conseguem detectar e corrigir erros de bits causados por raios cósmicos que atingem o chip?",
  "Você sabia que o 'NVMe' usa o barramento PCIe para falar diretamente com a CPU, eliminando o gargalo do antigo padrão SATA?",
  "Você sabia que os discos rígidos de hélio são lacrados para reduzir a resistência do ar e permitir que os pratos girem mais rápido?",
  "Você sabia que o 'Coil Whine' é o ruído agudo causado pela vibração mecânica de componentes eletrônicos sob carga?",
  "Você sabia que os capacitores de estado sólido em placas-mãe duram muito mais que os antigos capacitores eletrolíticos que vazavam?",
  "Você sabia que o 'S.M.A.R.T.' é um sistema dentro do seu disco que prevê quando ele vai falhar antes mesmo de acontecer?",
  "Você sabia que a tecnologia 'G-Sync' ou 'FreeSync' sincroniza a taxa de atualização do monitor com a geração de quadros da GPU?",
  "Você sabia que um monitor 'OLED' tem contraste infinito porque a cor preta é literalmente um pixel desligado?",
  "Você sabia que o 'Dead Pixel' é um transistor que travou aberto ou fechado em uma tela de LCD?",
  "Você sabia que as placas-mãe atuais possuem de 6 a 12 camadas de trilhas de cobre impressas umas sobre as outras?",
  "Você sabia que a pasta térmica preenche as imperfeições microscópicas entre o processador e o dissipador?",
  "Você sabia que o 'Cold Plate' é a parte de cobre de um water cooler que toca diretamente o processador?",
  "Você sabia que a fonte '80 Plus Gold' garante que pelo menos 90% da energia da tomada chegue de fato aos componentes?",
  "Você sabia que o 'Power Throttling' reduz a voltagem da CPU para poupar bateria em notebooks mas sacrifica a velocidade?",
  "Você sabia que o 'CMOS Password' fica gravado em uma memória volátil que é apagada se você remover a bateria da placa-mãe?",
  "Você sabia que o chip 'TPM 2.0' (Trusted Platform Module) guarda chaves de criptografia e é obrigatório para o Windows 11?",
  "Você sabia que o primeiro teclado QWERTY foi projetado em 1873 para evitar que as hastes das máquinas batessem uma na outra?",
  "Você sabia que o 'CapsLock' existe apenas pelas limitações de mecânica das antigas máquinas de escrever?",
  "Você sabia que os teclados 'Dvorak' foram desenhados para reduzir o esforço das mãos e aumentar a velocidade?",
  "Você sabia que o 'MousePad' era essencial nos anos 90 porque os mouses de bola escorregavam no vidro?",
  "Você sabia que a primeira impressora laser ocupava uma sala inteira e custava milhares de dólares?",
  "Você sabia que a 'Injeção de Tinta' funciona aquecendo bicos tão pequenos que a gota de tinta é menor que um glóbulo vermelho?",
  "Você sabia que a bateria do celular morre mais rápido no frio porque reações químicas ficam mais lentas?",
  "Você sabia que a 'Energia Estática' pode fritar chips se um técnico não usar uma pulseira de aterramento?",
  "Você sabia que a CPU 'Pentium' da Intel em 1994 tinha um bug que errava divisões matemáticas?",
  "Você sabia que o 'Napster' mudou o mundo ao ser o primeiro grande sistema P2P de compartilhamento de músicas?",
  "Você sabia que o 'Bluetooth' muda de canal 1600 vezes por segundo para evitar interferência de outros aparelhos?",
  "Você sabia que o 'GPS' precisa compensar a relatividade de Einstein para que os relógios dos satélites fiquem certos?",
  "Você sabia que existem menos de 20 endereços de Root Servers que controlam o destino de todo o tráfego da internet?",
  "Você sabia que o 'IPv6' tem endereços suficientes para dar um IP para cada grão de areia do planeta?",
  "Você sabia que a velocidade da internet via fibra óptica é limitada apenas pela rapidez com que a luz viaja pelo vidro?",
  "Você sabia que o 'Deep Web' é apenas o conteúdo que não é indexado por robôs, como seu extrato bancário?",
  "Você sabia que o primeiro 'Smartphone' da história foi o IBM Simon de 1992 e ele já tinha tela touch?",
  "Você sabia que o 'Snake' da Nokia foi o jogo que provou que celulares podiam ser plataformas de entretenimento?",
  "Você sabia que o primeiro vídeo do YouTube 'Me at the Zoo' foi gravado em San Diego em 2005?",
  "Você sabia que a 'Google' quase se chamou Googol, mas um cheque assinado errado mudou o nome?",
  "Você sabia que o 'F5' para recarregar a página vem dos tempos do DOS onde as teclas de função ganharam ordens?",
  "Você sabia que o '404' é apenas um número de erro padrão da IETF sem nenhuma história mística por trás?",
  "Você sabia que a internet consome cerca de 1 a 2% de toda a energia gerada no planeta terra?",
  "Você sabia que a 'Câmera do Notebook' usa o mesmo sensor minúsculo que câmeras de celulares antigos?",
  "Você sabia que o 'QR Code' foi inventado para rastrear peças de carros em fábricas da Toyota?",
  "Você sabia que o 'PDF' foi criado pela Adobe para que documentos parecessem iguais em qualquer sistema?",
  "Você sabia que o 'MP3' foi criado para fazer caber músicas num CD sem perder muita qualidade pros ouvidos?",
  "Você sabia que o 'ZIP' foi criado em 1989 e usa um algoritmo chamado DEFLATE para diminuir arquivos?",
  "Você sabia que o 'WiFi' é apenas uma marca comercial e o nome técnico é o protocolo IEEE 802.11?",
  "Você sabia que a 'Nuvem' na verdade são datacenters gigantescos protegidos como fortalezas militares?",
  "Você sabia que o 'Open Source' não significa apenas grátis, mas que você pode ler e mudar o código?",
  "Você sabia que o 'Linux' roda 100% dos 500 computadores mais potentes do mundo hoje?",
  "Você sabia que o 'Git' foi criado pelo Linus Torvalds em apenas duas semanas em 2005?",
  "Você sabia que 'Bug' era o termo para qualquer defeito mecânico muito antes de existir o computador?",
  "Você sabia que o primeiro domínio '.com' registrado foi o symbolics.com em 15 de março de 1985?",
  "Você sabia que a 'Apple' foi fundada no dia da mentira e por isso alguns achavam que era piada?",
  "Você sabia que a 'Microsoft' começou fazendo um interpretador da linguagem BASIC no Novo México?",
  "Você sabia que o 'IBM Simon' já tinha calculadora, bloco de notas e fax em 1992?",
  "Você sabia que o 'Nintendo 64' foi o último console de mesa de grande porte a usar cartuchos?",
  "Você sabia que o 'PlayStation' nasceu de um projeto que a Sony estava fazendo com a Nintendo?",
  "Você sabia que o 'Vim' e o 'Emacs' têm uma guerra de usuários que dura mais de 30 anos?",
  "Você sabia que o 'Fortran' é tão rápido em cálculos que até hoje a NASA usa em suas simulações?",
  "Você sabia que 'Cobol' ainda move o mundo financeiro processando milhões de dólares por segundo?",
  "Você sabia que 'Assembly' é a linguagem que fala os números exatos que o seu processador entende?",
  "Você sabia que um 'Processador de 32 bits' não consegue ler mais de 4GB de memória RAM?",
  "Você sabia que a 'Pasta Térmica' serve para tirar o ar entre o chip e o metal de refrigeração?",
  "Você sabia que as 'GPU's' são melhores para IA porque sabem fazer milhares de cálculos simples ao mesmo tempo?",
  "Você sabia que o 'Overclock' pode reduzir a vida útil do seu componente se não for feito com cuidado?",
  "Você sabia que a 'Tela Azul' acontece quando o Windows perde o controle de um erro crítico de memória?",
  "Você sabia que um 'Cursor de Mouse' é desenhado levemente inclinado para ser mais fácil de ver no monitor?",
  "Você sabia que a 'Arpanet', avó da internet, conectou apenas 4 computadores em seu primeiro dia?",
  "Você sabia que o 'Protocolo HTTP' é o que permite que o seu navegador peça o site para o servidor?",
  "Você sabia que o 'Brave' e o 'Firefox' são os navegadores que mais lutam pela privacidade do usuário hoje?",
  "Você sabia que o 'Edge' da Microsoft hoje usa o mesmo motor de renderização do Google Chrome?",
  "Você sabia que a 'Pilha de Protocolos OSI' tem 7 níveis que explicam como o dado viaja cabo acima?",
  "Você sabia que o 'Switch' é mais inteligente que o 'Hub' porque ele envia o dado apenas para quem pediu?",
  "Você sabia कि o 'Roteador' decide qual é o caminho mais curto para os dados chegarem ao destino?",
  "Você sabia que os 'Cabos de Rede' modernos têm 8 fios internos trançados de dois em dois?",
  "Você sabia que o 'NFC' do seu celular induz uma corrente elétrica na tag para poder ler os dados?",
  "Você sabia que 'Bit' é 0 ou 1, mas 'Byte' é um conjunto de 8 deles?",
  "Você sabia que o 'Binary' é a base de tudo porque os transistores só podem estar Ligados ou Desligados?",
  "Você sabia que 'Ponteiro' é o endereço de uma casa na memória RAM onde o dado está morando?",
  "Você sabia que 'Cache' é o segredo de por que a CPU não precisa esperar a RAM ler todos os dados?",
  "Você sabia que o 'Thread' é como se fosse um braço extra que o programa ganha para fazer duas coisas ao mesmo tempo?",
  "Você sabia que 'Recursão' é quando uma função chama a si mesma até o problema ficar pequeno o suficiente?",
  "Você sabia que 'Framework' é uma caixa de ferramentas gigante que já vem com o esqueleto do site pronto?",
  "Você sabia que o 'Docker' é como um contêiner de navio: o que estiver lá dentro roda igual em qualquer lugar?",
  "Você sabia que o 'GitHub' foi comprado pela Microsoft em 2018 e se tornou a maior rede de códigos do mundo?",
  "Você sabia que 'Sudo' é a abreviação de Super User Do, dando permissão de deus no sistema?",
  "Você sabia que o 'Terminal' gasta menos energia e memória que uma interface de janelas bonita?",
  "Você sabia que o 'Unix' foi o pai de quase todos os sistemas que usamos hoje, incluindo iOS e Mac?",
  "Você sabia que o 'Kernel' é o coração do sistema que controla quem pode usar a memória e o disco?",
  "Você sabia que 'Boot' vem do termo 'Bootstrap', que significa carregar o sistema pelas suas próprias alças?",
  "Você sabia que o 'BIOS' morre assim que o sistema operacional assume o controle total da máquina?",
  "Você sabia que o 'Ping' é um comando que funciona como um sonar de morcego para achar outros PCs?",
  "Você sabia que 'Latência' é o tempo que leva pro seu comando de tiro chegar no servidor do jogo?",
  "Você sabia que 'Bandwidth' é o tamanho do cano: quanto mais grosso, mais dados passam ao mesmo tempo?",
  "Você sabia que o 'SSD' é milhares de vezes mais rápido que o HD porque ele não tem um braço mecânico?",
  "Você sabia que o 'Chipset' é o gerente da placa-mãe que decide como a CPU fala com o USB e o Som?",
  "Você sabia que o 'V8' mudou o mundo ao fazer o JavaScript rodar fora da internet com o Node.js?",
  "Você sabia que o 'TypeScript' foi criado para que programadores grandes não fizessem bagunça no JavaScript?",
  "Você sabia que o 'Swift' foi criado para que fazer apps de iPhone fosse menos doloroso que no C?",
  "Você sabia que o 'Rust' é a linguagem que impede que você faça bobagem com a memória RAM por design?",
  "Você sabia que o 'Python' é a linguagem número um em inteligência artificial no mundo todo?",
  "Você sabia que o 'C#' foi a resposta da Microsoft para quem queria um Java muito mais moderno?",
  "Você sabia que o 'Kotlin' é tão bom que a Google o tornou a linguagem oficial do Android?",
  "Você sabia que o 'Ruby on Rails' foi o responsável por ensinar o mundo a fazer startups rápidas?",
  "Você sabia que as 'Single Page Applications' (SPA) fazem o site parecer um app que nunca recarrega?",
  "Você sabia que o 'Virtual DOM' é a técnica secreta do React para ser tão rápido em telas complexas?",
  "Você sabia que o 'CSS Grid' é a ferramenta definitiva para alinhar sites sem sofrimento?",
  "Você sabia que o 'Flexbox' serve para empilhar coisas no site de forma inteligente e responsiva?",
  "Você sabia que os 'NPM' e 'Yarn' são as geladeiras de pacotes de onde os devs pegam código pronto?",
  "Você sabia que 'Debugging' é a arte de ser detetive em um crime onde você mesmo é o culpado?",
  "Você sabia que o 'Git Flow' é como um mapa de trânsito para o código não bater em outros códigos?",
  "Você sabia que 'Clean Code' é escrever código que sua avó entenderia se fosse programadora?",
  "Você sabia que 'Solid' é um acrônimo de 5 regras que fazem seu código não quebrar no futuro?",
  "Você sabia que 'Open Source' permitiu que o mundo inteiro construísse a internet de graça?",
  "Você sabia que o 'Linux' é o maior projeto de colaboração da humanidade até hoje?",
  "Você sabia que o 'Github' abriga bilhões de linhas de código que movem o mundo agora mesmo?",
  "Você sabia que 'Engenharia de Software' é aplicar ciência para que o programa não caia amanhã?",
  "Você sabia que o 'Postgres' é considerado por muitos o banco de dados mais robusto e sério que existe?",
  "Você sabia que o 'Redis' é tão rápido que ele guarda tudo na memória RAM e zero no disco enquanto trabalha?",
  "Você sabia que um 'Hackathon' é uma maratona onde devs não dormem para criar um app do zero em 48h?",
  "Você sabia que o 'Raspberry Pi' é um computador inteiro do tamanho de um cartão de crédito?",
  "Você sabia que o 'Arduino' é o cérebro que permite você criar robôs e automações domésticas na raça?",
  "Você sabia que o 'Silicon Valley' tem esse nome por causa da areia (sílica) usada para fazer chips?",
  "Você sabia que 'Cybersecurity' é uma guerra silenciosa que acontece 24 horas por dia em cada roteador?",
  "Você sabia que a 'Blockchain' é uma corrente de dados que ninguém consegue apagar ou mudar sozinho?",
  "Você sabia que 'NFT' é como se fosse um autógrafo digital único para um arquivo de computador?",
  "Você sabia que a 'Realidade Virtual' engana o equilíbrio do seu ouvido através dos seus olhos?",
  "Você sabia que a 'Realidade Aumentada' mistura o mundo real com hologramas do seu celular?",
  "Você sabia que 'Chat GPT' foi treinado lendo trilhões de frases para aprender a falar como nós?",
  "Você sabia que 'Deep Learning' são neurônios digitais que aprendem a ver o que tem numa foto?",
  "Você sabia que a 'IA' não tem consciência, ela apenas sabe qual é a próxima palavra mais provável?",
  "Você sabia que 'Engenharia Social' é quando o hacker invade a sua mente em vez do seu PC?",
  "Você sabia que 'Pentest' é quando a empresa paga um hacker do bem para tentar invadi-la?",
  "Você sabia que 'Zero Trust' é a regra de ouro: nunca confie em ninguém na sua rede, nem em você?",
  "Você sabia que o 'MFA' pode evitar 99% dos roubos de contas em todo o mundo?",
  "Você sabia que a 'Nuvem' é só o computador de outra pessoa?",
  "Você sabia que a 'Data Visualization' transforma números chatos em gráficos que contam uma história?",
  "Você sabia que o 'Markdown' permite você escrever textos bonitos sem precisar de um Word pesado?",
  "Você sabia que o 'Vercel' é a Ferrari de onde os devs de hoje colocam seus sites no ar?",
  "Você sabia que o 'Ansible' é a ferramenta que configura mil servidores ao mesmo tempo rodando scripts?",
  "Você sabia que o 'Kubernetes' é o capitão que gerencia milhares de contêineres Docker no mar da internet?",
  "Você sabia que a 'Fibra Óptica' usa lasers para mandar dados em altíssima velocidade por cabos de vidro?",
  "Você sabia que o '5G' foi feito para que até a sua torradeira possa ter internet estável?",
  "Você sabia que 'Internet das Coisas' (IoT) é o termo para quando objetos físicos ganham vida online?",
  "Você sabia que 'Algoritmo' é apenas uma receita de bolo para o computador resolver um problema?",
  "Você sabia que a 'Engenharia de Software' é a arte de construir pontes digitais que não caem?",
  "Você sabia que o protocolo de roteamento BGP não possui mecanismos de segurança nativos, o que permite o sequestro de rotas (BGP Hijacking)?",
  "Você sabia que o ataque 'Timing Attack' permite descobrir uma senha medindo quanto tempo o processador leva para comparar cada caractere?",
  "Você sabia que o 'ASLR' (Address Space Layout Randomization) torna o endereço de memória de um programa imprevisível para evitar exploits?",
  "Você sabia que as instruções 'VEX' e 'EVEX' em processadores modernos permitem manipular vetores de dados de até 512 bits?",
  "Você sabia que o 'Cache Side-Channel' permite que um programa malicioso descubra o que outro programa está fazendo apenas monitorando o tempo de acesso ao cache?",
  "Você sabia que o 'Instruction Pointer' (RIP em x64) é o registrador que aponta exatamente para a próxima linha de código que a CPU vai executar?",
  "Você sabia que o 'BIOS Interrupt Call' era o método usado no MS-DOS para desenhar na tela ou ler o teclado antes dos drivers modernos?",
  "Você sabia que a técnica 'Return-to-libc' permite que um hacker execute funções da biblioteca padrão do sistema ignorando a proteção de pilha não-executável?",
  "Você sabia que o 'SPECint' é um dos benchmarks mais respeitados para medir a performance real de processamento de inteiros em CPUs?",
  "Você sabia que a arquitetura 'RISC-V' é totalmente aberta, permitindo que qualquer empresa crie seus próprios processadores sem pagar royalties?",
  "Você sabia que o 'MMU' (Memory Management Unit) é o hardware dentro da CPU que traduz os endereços que seu programa vê em endereços reais na RAM?",
  "Você sabia que os 'Interrupt Handlers' são pequenas funções no Kernel que respondem instantaneamente a cliques de mouse ou pacotes de rede?",
  "Você sabia que o 'Page Table' é o índice gigante que o sistema operacional usa para organizar quais partes da RAM pertencem a qual programa?",
  "Você sabia que o 'Ring -3' é o nível de privilégio do Intel Management Engine, um computador inteiro dentro do processador que roda mesmo com o PC desligado?",
  "Você sabia que a 'Microarquitetura' define como os componentes internos de um chip (como ALUs e Decoders) são organizados fisicamente?",
  "Você sabia que o 'Out-of-Order Execution' permite que a CPU execute instruções futuras se os dados necessários já estiverem prontos no cache?",
  "Você sabia que o 'Branch Predictor' usa história e estatística para tentar adivinhar se um código vai entrar em um 'if' ou no 'else'?",
  "Você sabia que a técnica 'Shadow Stack' protege o endereço de retorno das funções na memória para impedir ataques de Buffer Overflow?",
  "Você sabia que o 'Kernel Mode' (Ring 0) dá acesso total às instruções da CPU, incluindo a capacidade de desligar o computador ou limpar a RAM?",
  "Você sabia que o 'User Mode' (Ring 3) isola os aplicativos para que um erro no navegador não consiga corromper a memória do sistema operacional?",
  "Você sabia que o 'System Call' é a transição controlada entre o modo de usuário e o modo de kernel através de uma instrução especial como 'SYSCALL'?",
  "Você sabia que a 'Tabela de Vetores de Interrupção' (IDT) é um dos primeiros dados que o Kernel preenche na memória durante o boot?",
  "Você sabia que o 'Cold Boot Attack' funciona porque os dados na memória RAM não desaparecem instantaneamente, especialmente se os chips estiverem congelados?",
  "Você sabia que a técnica de 'Hooking' permite que softwares de segurança (ou vírus) interceptem chamadas de sistema antes que elas cheguem ao Kernel?",
  "Você sabia que o 'Prefetching' é quando o processador antecipa quais dados serão necessários e os traz para o cache antes de serem pedidos?",
  "Você sabia que 'Endianness' (Big vs Little) define se o byte mais importante de um número vem no começo ou no fim do endereço de memória?",
  "Você sabia que o 'Garbage Collector' do tipo 'Reference Counting' deleta um dado da memória assim que o número de referências a ele chega a zero?",
  "Você sabia que em C++ um 'Smart Pointer' garante que a memória seja liberada automaticamente assim que ninguém mais estiver usando o dado?",
  "Você sabia que o 'Linker' resolve endereços de funções entre arquivos diferentes, permitindo que um programa chame códigos de bibliotecas externas?",
  "Você sabia que o 'Debugger' usa a instrução 'INT 3' (0xCC) para substituir um byte do seu código e forçar a CPU a pausar a execução?",
  "Você sabia que em 1945, Vannevar Bush descreveu o 'Memex', um precursor teórico da internet e do hipertexto?",
  "Você sabia que o primeiro compilador foi desenvolvido por Grace Hopper em 1952 para a linguagem A-0?",
  "Você sabia que John Backus liderou a equipe da IBM que criou o FORTRAN em 1957, a primeira linguagem de alto nível?",
  "Você sabia que a linguagem COBOL foi criada em 1959 por um comitê (CODASYL) inspirado no trabalho de Grace Hopper?",
  "Você sabia que o primeiro videogame de computador, 'Spacewar!', foi criado por Steve Russell no MIT em 1962?",
  "Você sabia que a linguagem BASIC foi criada em 1964 por John Kemeny e Thomas Kurtz para tornar a computação acessível?",
  "Você sabia que o conceito de 'Programação Orientada a Objetos' foi cunhado por Alan Kay nos anos 60?",
  "Você sabia que a linguagem Simula 67, criada por Kristen Nygaard e Ole-Johan Dahl, foi a primeira com suporte real a objetos?",
  "Você sabia que o sistema operacional Multics (1964) foi o projeto ambicioso que falhou e deu origem ao Unix?",
  "Você sabia que em 1968, Douglas Engelbart deu 'A Mãe de Todas as Demonstrações', mostrando mouse, janelas e edição em tempo real?",
  "Você sabia que a linguagem Pascal foi criada por Niklaus Wirth em 1970 em homenagem ao matemático Blaise Pascal?",
  "Você sabia que a linguagem C original (1972) não tinha suporte oficial a strings, apenas buffers de caracteres?",
  "Você sabia que Bill Gates e Paul Allen escreveram o código do Altair BASIC em papel antes de testarem em uma máquina real?",
  "Você sabia que a linguagem SQL foi baseada no modelo relacional proposto por Edgar F. Codd em 1970?",
  "Você sabia que a Xerox Alto (1973) foi o primeiro computador a oferecer uma interface gráfica funcional com mouse?",
  "Você sabia que em 1975, o MITS Altair 8800 deu início à revolução do computador pessoal?",
  "Você sabia que a linguagem Scheme foi criada em 1975 por Guy Steele e Gerald Jay Sussman?",
  "Você sabia que a primeira planilha eletrônica, VisiCalc, foi criada por Dan Bricklin e Bob Frankston em 1979?",
  "Você sabia que o protocolo SMTP para emails foi padronizado em 1982 por Jon Postel?",
  "Você sabia que o sistema GNU foi anunciado por Richard Stallman em 27 de setembro de 1983?",
  "Você sabia que a linguagem C++ foi originalmente chamada de 'C with Classes' por Bjarne Stroustrup em 1979?",
  "Você sabia que o Turbo Pascal, lançado em 1983 por Anders Hejlsberg, custava apenas $49.95 e era incrivelmente rápido?",
  "Você sabia que a linguagem Perl foi lançada por Larry Wall em 18 de dezembro de 1987?",
  "Você sabia que o comando 'sudo' foi escrito originalmente por Robert Coggeshall e Cliff Spencer em 1980?",
  "Você sabia que o protocolo FTP foi definido originalmente por Abhay Bhushan em 1971?",
  "Você sabia que a linguagem Python começou como um hobby de Guido van Rossum durante as férias de Natal de 1989?",
  "Você sabia que Linus Torvalds anunciou o Linux em 25 de agosto de 1991 em uma mensagem de Usenet?",
  "Você sabia que o navegador Mosaic foi criado em 1993 por Marc Andreessen e Eric Bina no NCSA?",
  "Você sabia que a linguagem PHP foi criada por Rasmus Lerdorf em 1994 para rastrear visitas ao seu currículo?",
  "Você sabia que o JavaScript foi inicialmente chamado de 'Mocha' pelo CEO da Netscape, James H. Clark?",
  "Você sabia que a linguagem Ruby foi lançada publicamente por Yukihiro Matsumoto em 21 de dezembro de 1995?",
  "Você sabia que o Java foi demonstrado pela primeira vez na conferência TED em 1995 rodando em uma TV?",
  "Você sabia que a linguagem Delphi foi criada pela Borland em 1995 como sucessora do Turbo Pascal?",
  "Você sabia que o protocolo HTTP 1.0 foi oficialmente documentado apenas em 1996?",
  "Você sabia que a técnica de 'Garbage Collection' foi inventada por John McCarthy por volta de 1959 para a linguagem Lisp?",
  "Você sabia que o primeiro servidor web dos EUA foi instalado por Paul Kunz no SLAC em 1991?",
  "Você sabia que o termo 'Open Source' foi cunhado em uma reunião em Palo Alto em 1998?",
  "Você sabia que o framework Ruby on Rails foi extraído do software de gestão Basecamp por David Heinemeier Hansson em 2004?",
  "Você sabia que o Git foi criado por Linus Torvalds em 2005 porque ele perdeu o acesso gratuito ao software BitKeeper?",
  "Você sabia que a linguagem Swift foi desenvolvida por Chris Lattner na Apple e lançada em 2014?",
  "Você sabia que a Apollo 11 tinha menos poder de processamento do que um carregador de celular moderno?",
  "Você sabia que se você imprimisse todo o código do kernel Linux atual em papel, a pilha teria a altura de um prédio de 20 andares?",
  "Você sabia que existem mais de 50 bilhões de dispositivos conectados à internet hoje, mais que o dobro da população humana?",
  "Você sabia que o Google processa cerca de 40.000 buscas por segundo, totalizando 3.5 bilhões por dia?",
  "Você sabia que a primeira bateria do mundo, a Pilha de Volta (1800), gerava eletricidade usando discos de zinco e cobre em salmoura?",
  "Você sabia que 90% de todos os dados existentes no mundo foram criados apenas nos últimos dois anos?",
  "Você sabia que o cérebro humano processa informações a uma velocidade estimada de 60 bits por segundo, mas o subconsciente chega a 11 milhões?",
  "Você sabia que o primeiro site da internet ainda está ativo e pode ser visitado em info.cern.ch?",
  "Você sabia que a velocidade da luz é o limite de velocidade da internet, e o ping nunca poderá ser menor que o tempo da luz cruzar a fibra?",
  "Você sabia que o YouTube recebe mais de 500 horas de vídeo a cada minuto?",
  "Você sabia que a Voyager 1 está a mais de 23 bilhões de quilômetros da Terra e ainda executa código escrito nos anos 70?",
  "Você sabia que os cabos de fibra óptica submarinos são tão finos quanto um fio de cabelo, mas transmitem terabytes por segundo?",
  "Você sabia que um disco rígido moderno pode ler dados a uma velocidade onde a cabeça de leitura 'voa' a nanômetros do disco?",
  "Você sabia que se você tentasse contar todos os bits em 1 Zettabyte à razão de um por segundo, levaria 30 trilhões de anos?",
  "Você sabia que o erro de software mais caro da história foi o foguete Ariane 5, que explodiu em 1996 por causa de um 'Integer Overflow' de 64 para 16 bits?",
  "Você sabia que a senha inicial dos silos de mísseis nucleares dos EUA foi '00000000' por 20 anos?",
  "Você sabia que o primeiro microprocessador da Intel, o 4004, foi desenhado para uma calculadora japonesa chamada Busicom?",
  "Você sabia que o termo 'Spam' foi inspirado no Monty Python porque, na esquete, o garçom repetia a palavra 'Spam' até ninguém conseguir falar mais nada?",
  "Você sabia que o primeiro domínio .com, symbolics.com, foi registrado em 1985 e hoje é um pequeno museu online?",
  "Você sabia que a Microsoft salvou a Apple de ir à falência em 1997 com um investimento de 150 milhões de dólares?",
  "Você sabia que o nome 'Wi-Fi' não significa nada? Foi escolhido apenas porque rimava com 'Hi-Fi'.",
  "Você sabia que o primeiro 'hard drive' de 5MB da IBM alugava por $3.200 mensais em 1956?",
  "Você sabia que se você assistisse a todos os vídeos do YouTube postados em um dia, levaria 82 anos de vida ininterrupta?",
  "Você sabia que o primeiro mouse de computador era de madeira e tinha rodas de metal pesadas?",
  "Você sabia que o sinal '@' foi escolhido para emails justamente porque era um símbolo pouco usado em documentos contábeis da época?",
  "Você sabia que a primeira webcam filmava apenas uma cafeteira para que cientistas não perdessem tempo indo à cozinha se o café estivesse vazio?",
  "Você sabia que o kernel do Windows contém milhões de linhas de código focadas apenas em manter compatibilidade com apps de 1995?",
  "Você sabia que se a Amazon cair por apenas um minuto, ela perde cerca de 220 mil dólares em vendas?",
  "Você sabia que o primeiro vírus de computador móvel se espalhava via Bluetooth em 2004 e infectava celulares Nokia?",
  "Você sabia que o 'Captunda' (CAPTCHA) foi criado para ajudar a digitalizar livros que os computadores comuns não conseguiam ler?",
  "Você sabia que as fotos em JPEG perdem um pouco de qualidade cada vez que você as edita e salva novamente?",
  "Você sabia que um pendrive de 128GB hoje tem mais capacidade do que todos os supercomputadores da NASA nos anos 60 somados?",
  "Você sabia que o código-fonte da Margaret Hamilton para a missão Apollo foi escrito à mão antes de ser perfurado em cartões?",
  "Você sabia que o primeiro email de spam foi enviado através da ARPANET para 400 pessoas em 1978?",
  "Você sabia que a cada segundo o Google emite cerca de 500kg de CO2 devido ao consumo de energia de seus datacenters?",
  "Você sabia que um bit pode ser representado por um único elétron em tecnologias de computação quântica de ponta?",
  "Você sabia que o GPS funciona graças à Relatividade de Einstein; sem correção de tempo relativístico, os mapas errariam por 10km ao dia?",
  "Você sabia que o primeiro logo da Google foi criado em um programa gratuito chamado GIMP por um de seus fundadores?",
  "Você sabia que a primeira mensagem enviada pelo WhatsApp foi 'Hello', mas o sistema ainda era apenas um app de status?",
  "Você sabia que o código do jogo original de Pong foi feito sem nenhum software, apenas usando chips lógicos de hardware?",
  "Você sabia que o primeiro computador portátil, o Osborne 1 (1981), pesava 11kg e tinha uma tela de apenas 5 polegadas?",
  "Você sabia que a memória RAM é chamada de 'volátil' porque ela precisa de eletricidade constante para 'lembrar' dos dados?",
  "Você sabia que o termo 'Robot' vem de uma peça de teatro tcheca de 1920 e significa 'trabalho forçado'?",
  "Você sabia que a primeira pessoa a ser chamada de 'computador' era, na verdade, alguém cujo trabalho era fazer cálculos matemáticos?",
  "Você sabia que a arquitetura ARM, presente em quase todos os celulares, nasceu na Inglaterra em uma empresa chamada Acorn Computers?",
  "Você sabia que o primeiro 'emoticon' foi criado em 1982 por Scott Fahlman para avisar que uma mensagem era piada? :-)",
  "Você sabia que se você tentar processar um único segundo de vídeo 8K, o computador faz bilhões de cálculos matemáticos para cada quadro?",
  "Você sabia que o 'Big Data' permite que empresas prevejam se uma pessoa está grávida apenas analisando seus hábitos de compra?",
  "Você sabia que a internet pesa aproximadamente o mesmo que um morango médio, se medirmos apenas a energia dos elétrons ativos?",
  "Você sabia que os supercomputadores modernos são tão potentes que podem simular a formação de galáxias inteiras em segundos?",
  "Você sabia que HTML não é uma linguagem de programação, mas sim uma linguagem de marcação de texto?",
  "Você sabia que CSS serve para dar estilo (cores, fontes, tamanhos) às páginas HTML?",
  "Você sabia que JavaScript é a linguagem que traz interatividade (botões, animações) para os sites?",
  "Você sabia que Java e JavaScript são linguagens completamente diferentes e não têm relação direta?",
  "Você sabia que Git é uma ferramenta de versionamento, enquanto GitHub é uma plataforma para armazenar esses códigos?",
  "Você sabia que o endereço IP é como se fosse o CEP da sua conexão na internet?",
  "Você sabia que o Navegador (Chrome, Firefox, Safari) é o programa que interpreta o código para te mostrar o site?",
  "Você sabia que 'Frontend' é a parte do site que você vê e interage, e 'Backend' é onde a lógica e o banco de dados moram?",
  "Você sabia que um 'Algoritmo' nada mais é do que um passo a passo para resolver um problema?",
  "Você sabia que a Memória RAM é temporária e serve para o que você está usando agora?",
  "Você sabia que o Disco Rígido (HD ou SSD) é onde você guarda seus arquivos permanentemente?",
  "Você sabia que o CPU é o 'cérebro' do computador que processa todas as ordens?",
  "Você sabia que o Bit é a menor unidade de dado (0 ou 1) e o Byte é um conjunto de 8 bits?",
  "Você sabia que o Windows, o Linux e o macOS são Sistemas Operacionais que gerenciam o hardware?",
  "Você sabia que o roteador Wi-Fi é o aparelho que distribui a internet sem fio na sua casa?",
  "Você sabia que o domínio (como google.com) é o nome 'bonito' para esconder o endereço IP real de um servidor?",
  "Você sabia que a palavra 'Bug' é usada quando um programa de computador apresenta um erro?",
  "Você sabia que o termo 'Deploy' significa publicar o seu código para que o mundo possa usá-lo?",
  "Você sabia que Python é considerada uma das melhores linguagens para iniciantes por sua sintaxe parecida com o inglês?",
  "Você sabia que C é uma das linguagens de programação mais antigas ainda muito usadas para sistemas de baixo nível?",
  "Você sabia que o SQL é a linguagem padrão para conversar com bancos de dados relacionais?",
  "Você sabia que 1 Kilobyte na computação real equivale a 1.024 bytes, não 1.000?",
  "Você sabia que o termo 'Open Source' significa que qualquer um pode ver, modificar e distribuir o código de um programa?",
  "Você sabia que o protocolo HTTPS é a versão segura do HTTP e protege os dados que você envia aos sites?",
  "Você sabia que o ícone de 'Salvar' na maioria dos programas é um desenho de um disquete, um objeto que caiu em desuso?",
  "Você sabia que as extensões de arquivo (como .jpg, .mp3, .exe) dizem ao sistema que tipo de conteúdo está lá dentro?",
  "Você sabia que o comando 'Ctrl + C' copia e o 'Ctrl + V' cola conteúdos no Windows e Linux?",
  "Você sabia que reiniciar o computador resolve muitos problemas porque limpa processos travados na memória RAM?",
  "Você sabia que a internet e a World Wide Web (WWW) não são a mesma coisa? A web é apenas um serviço que roda na internet.",
  "Você sabia que o teclado QWERTY foi feito para ser lento e evitar que as máquinas de escrever travassem?",
  "Você sabia que o 'Cloud Computing' (Nuvem) significa usar o processamento e armazenamento de computadores de outras empresas?",
  "Você sabia que o 'Kernel' é o núcleo do sistema operacional que fala diretamente com as peças físicas do PC?",
  "Você sabia que 'Framework' é uma coleção de ferramentas prontas que ajudam a desenvolver softwares mais rápido?",
  "Você sabia que 'API' é a ponte que permite que dois aplicativos diferentes conversem entre si?",
  "Você sabia que um 'Script' é um conjunto de instruções que o computador executa em sequência?",
  "Você sabia que 'Responsive Design' é quando um site se adapta automaticamente ao tamanho da tela do celular ou PC?",
  "Você sabia que 'Hardcode' é o ato não recomendado de colocar valores fixos (como senhas) direto no código?",
  "Você sabia que o 'Cache' do navegador guarda partes dos sites para que eles carreguem mais rápido na próxima visita?",
  "Você sabia que 'Vulnerabilidade' é uma brecha de segurança que pode ser explorada por hackers?",
  "Você sabia que a 'Linguagem de Máquina' é composta apenas por 0 e 1, o único idioma que o processador entende?",
  "Você sabia que a linguagem APL foi criada por Kenneth Iverson em 1962 e usa símbolos matemáticos únicos?",
  "Você sabia que o termo 'Internet' foi usado pela primeira vez em um documento técnico do TCP em 1974?",
  "Você sabia que a linguagem Smalltalk-80 foi a primeira a popularizar o conceito de janelas e janelas sobrepostas?",
  "Você sabia que o primeiro sistema de arquivos hierárquico foi introduzido no sistema Multics?",
  "Você sabia que a linguagem Prolog, criada em 1972 por Alain Colmerauer, é focada em lógica e inteligência artificial?",
  "Você sabia que o primeiro computador da Apple, o Apple I, foi vendido sem gabinete, teclado ou monitor?",
  "Você sabia que a linguagem Modula-2 foi criada por Niklaus Wirth em 1978 como sucessora do Pascal?",
  "Você sabia que o primeiro console de videogame a usar cartuchos trocáveis foi o Fairchild Channel F em 1976?",
  "Você sabia que a linguagem Objective-C foi criada por Brad Cox e Tom Love em 1983?",
  "Você sabia que o PostScript, criado pela Adobe em 1982, é tecnicamente uma linguagem de programação completa?",
  "Você sabia que o primeiro computador a oferecer voz sintética integrada foi o Macintosh em 1984?",
  "Você sabia que a linguagem Eiffel foi criada por Bertrand Meyer em 1985 focando em 'Design por Contrato'?",
  "Você sabia que o protocolo IRC foi criado por Jarkko Oikarinen em 1988 na Finlândia?",
  "Você sabia que o primeiro navegador web com suporte a CSS foi o Internet Explorer 3 em 1996?",
  "Você sabia que a linguagem Haskell foi nomeada em homenagem ao lógico Haskell Curry em 1990?",
  "Você sabia que o primeiro servidor de nomes (DNS) foi implementado por Paul Mockapetris em 1983?",
  "Você sabia que a linguagem Tcl foi criada por John Ousterhout em 1988 como uma linguagem de comando embutida?",
  "Você sabia que o termo 'Cookie' foi inventado por Lou Montulli em 1994 enquanto trabalhava no Netscape?",
  "Você sabia que o primeiro site de busca da história foi o Archie, criado em 1990 por Alan Emtage?",
  "Você sabia que a linguagem Lua foi criada no Brasil em 1993 por pesquisadores da PUC-Rio?",
  "Você sabia que o termo 'Bug' já era usado por Thomas Edison para descrever problemas técnicos em 1878?",
  "Você sabia que o primeiro disco rígido de 1TB foi lançado pela Hitachi apenas em 2007?",
  "Você sabia que a linguagem Erlang foi criada pela Ericsson em 1986 para switches de telefonia?",
  "Você sabia que o primeiro sistema operacional de 64 bits foi o UNICOS da Cray em 1985?",
  "Você sabia que a linguagem Go foi anunciada pelo Google em novembro de 2009?",
  "Você sabia que o primeiro smartphone Android foi o T-Mobile G1 (HTC Dream), lançado em 2008?",
  "Você sabia que o termo 'Blog' é uma abreviação de 'Weblog', cunhado por Jorn Barger em 1997?",
  "Você sabia que o primeiro vídeo viral da internet foi 'Dancing Baby' em 1996?",
  "Você sabia que o sistema de arquivos FAT foi criado por Bill Gates e Marc McDonald em 1977?",
  "Você sabia que a linguagem ColdFusion foi criada por Jeremy Allaire em 1995?",
  "Você sabia que o primeiro console de 64 bits foi o Atari Jaguar, lançado em 1993?",
  "Você sabia que o protocolo SSH foi criado por Tatu Ylönen em 1995 após um ataque de sniffing em sua universidade?",
  "Você sabia que a linguagem Groovy foi lançada para a JVM em 2003?",
  "Você sabia que o primeiro processador dual-core para PCs foi o Athlon 64 X2 em 2005?",
  "Você sabia que a linguagem Scala foi criada por Martin Odersky e lançada em 2004?",
  "Você sabia que o primeiro iPad foi lançado por Steve Jobs em 27 de janeiro de 2010?",
  "Você sabia que a linguagem Clojure foi lançada por Rich Hickey em 2007?",
  "Você sabia que o primeiro SSD comercial de 1GB custava $1.000 em 1991?",
  "Você sabia que a linguagem Dart foi revelada pelo Google em 2011?",
  "Você sabia que o primeiro computador com arquitetura ARM foi o Acorn Archimedes em 1987?",
  "Você sabia que a linguagem PostScript influenciou diretamente a criação do formato PDF?",
  "Você sabia que o termo 'Hypertext' foi cunhado por Ted Nelson em 1963?",
  "Você sabia que a primeira câmera digital foi construída por Steven Sasson na Kodak em 1975?",
  "Você sabia que o primeiro servidor de arquivos Ethernet foi demonstrado pela Xerox em 1973?",
  "Você sabia que a linguagem VHDL foi criada pelo Departamento de Defesa dos EUA em 1983?",
  "Você sabia que o primeiro domínio .org foi mitre.org em 1985?",
  "Você sabia que a linguagem Rust começou como um projeto pessoal de Graydon Hoare em 2006?",
  "Você sabia que o primeiro roteador comercial foi o AGS, lançado pela Cisco em 1986?",
  "Você sabia que a linguagem Kotlin recebeu o nome de uma ilha russa perto de São Petersburgo?",
  "Você sabia que o primeiro modem a alcançar 56kbps foi lançado pela USRobotics em 1997?",
  "Você sabia que o protocolo HTTPS foi criado pela Netscape em 1994 para o navegador Navigator?",
  "Você sabia que a linguagem Fortran 77 foi a primeira versão a padronizar o comando 'IF-THEN-ELSE'?",
  "Você sabia que o primeiro notebook com tela colorida foi o Commodore SX-64 em 1984?",
  "Você sabia que a linguagem BCPL (precursora do B e C) foi criada por Martin Richards em 1967?",
  "Você sabia que o primeiro mouse óptico moderno sem fio foi lançado pela Logitech em 2001?",
  "Você sabia que o sistema operacional OS/2 foi desenvolvido conjuntamente pela IBM e Microsoft nos anos 80?",
  "Você sabia que a linguagem PL/I foi criada pela IBM para substituir o Fortran e o Cobol ao mesmo tempo?",
  "Você sabia que o primeiro microcomputador de 16 bits foi o Texas Instruments TI-99/4 em 1979?",
  "Você sabia que o termo 'User Experience' foi popularizado por Don Norman na Apple nos anos 90?",
  "Você sabia que a primeira versão do Photoshop foi escrita por Thomas e John Knoll em 1987?",
  "Você sabia que a Microsoft ganha bilhões de dólares anualmente em royalties de patentes do Android?",
  "Você sabia que se o Facebook fosse um país, ele seria o terceiro mais populoso do mundo?",
  "Você sabia que o primeiro vírus de macro do Word, o Concept (1995), não causava danos, apenas exibia mensagens?",
  "Você sabia que o teclado virtual do iPhone original usava um dicionário inteligente porque a precisão do toque era baixa?",
  "Você sabia que a HP foi fundada em uma garagem com apenas $538 dólares de capital inicial?",
  "Você sabia que a primeira interface gráfica da Microsoft foi lançada apenas como um 'gerenciador de arquivos' sobre o DOS?",
  "Você sabia que o kernel do Linux hoje possui mais de 30 milhões de linhas de código?",
  "Você sabia que a cada dia são registrados cerca de 100 mil novos nomes de domínio na internet?",
  "Você sabia que se você desativasse o GPS do mundo hoje, sistemas financeiros e redes elétricas entrariam em colapso?",
  "Você sabia que a velocidade de um elétron em um chip é de apenas alguns centímetros por segundo, mas o sinal elétrico viaja quase à luz?",
  "Você sabia que existem computadores rodando em Marte agora (os Rovers) usando processadores PowerPC antigos?",
  "Você sabia que o primeiro sistema de reconhecimento de voz (1952) conseguia entender apenas números de 0 a 9?",
  "Você sabia que a empresa IBM já foi a maior fabricante de máquinas de escrever e cortadoras de queijo do mundo?",
  "Você sabia que o primeiro banner publicitário da web (1994) tinha a frase 'Você já clicou o seu mouse aqui? Você vai.'?",
  "Você sabia que o YouTube era originalmente um site de namoro por vídeo chamado 'Tune In, Hook Up'?",
  "Você sabia que o nome 'Siri' significa 'mulher bonita que te leva à vitória' em norueguês?",
  "Você sabia que a Intel fabrica chips tão precisos que uma contaminação de poeira destruiria milhões de dólares em produção?",
  "Você sabia que o sistema operacional da SpaceX (Starlink e Foguetes) roda quase inteiramente em Linux customizado?",
  "Você sabia que a tela do primeiro iPhone era feita de plástico, mas Steve Jobs mandou trocar por vidro semanas antes do lançamento?",
  "Você sabia que a linguagem C++ foi considerada 'impossível de aprender totalmente' até pelo seu próprio criador?",
  "Você sabia que fotos enviadas pelo WhatsApp perdem cerca de 80% da sua resolução original para economizar dados?",
  "Você sabia que se um bit de memória RAM for atingido por um raio cósmico, ele pode mudar de 0 para 1 sozinho?",
  "Você sabia que existe um servidor web rodando continuamente desde 1991 em um computador NeXT original?",
  "Você sabia que o código-fonte original do World Wide Web foi vendido como NFT por 5.4 milhões de dólares?",
  "Você sabia que se você tentar ler o código do Windows inteiro, o texto teria o comprimento de 30 mil livros médios?",
  "Você sabia que o carregador do MacBook tem mais poder de processamento do que o computador que levou o homem à Lua?",
  "Você sabia que o primeiro item comprado com Bitcoin foram duas pizzas por 10.000 BTC em 2010?",
  "Você sabia que 99.9% de todos os emails transmitidos diariamente no mundo são filtrados como Spam?",
  "Você sabia que a primeira linguagem de programação para crianças foi o Logo (1967), que usava uma tartaruga robô?",
  "Você sabia que o Windows 95 foi o primeiro sistema a ter o botão 'Iniciar', que mudou a forma de usar o PC?",
  "Você sabia que o mouse foi apelidado assim porque o cabo saindo por trás parecia o rabo de um rato?",
  "Você sabia que o comando 'ping' recebeu esse nome devido ao som de um sonar de submarino?",
  "Você sabia que o primeiro robô humanoide, Elektro (1939), conseguia fumar cigarros e falar 700 palavras?",
  "Você sabia que o sistema operacional mais usado no mundo por número de dispositivos instalados não é o Windows, mas o Android?",
  "Você sabia que o Google aluga cabras para aparar a grama de seus escritórios em vez de usar cortadores barulhentos?",
  "Você sabia que o termo 'Geek' originalmente descrevia artistas de circo que faziam coisas bizarras?",
  "Você sabia que a cada minuto, mais de 4 milhões de buscas são feitas no Google no mundo todo?",
  "Você sabia que os primeiros computadores usavam cartões perfurados porque a memória eletrônica ainda era muito cara?",
  "Você sabia que a internet inteira seria desligada se os 13 detentores das 'chaves mestras' do DNS não se reunissem?",
  "Você sabia que o primeiro microprocessador de 32 bits foi o Intel 80386, lançado em 1985?",
  "Você sabia que 'Stack Overflow' é quando a memória reservada para funções de um programa se esgota?",
  "Você sabia que o protocolo TCP garante que o arquivo chegue inteiro, enquanto o UDP foca apenas na velocidade?",
  "Você sabia que um 'Endereço MAC' é fixo na peça física e não muda como o IP?",
  "Você sabia que 'DPI' em mouses significa 'Dots Per Inch' e mede a precisão do movimento?",
  "Você sabia que 'VPN' cria um túnel criptografado para impedir que seu provedor veja o que você acessa?",
  "Você sabia que o Linux é um 'Kernel', não um sistema operacional completo sozinho (ele precisa das ferramentas GNU)?",
  "Você sabia que o 'Github Copilot' usa inteligência artificial para sugerir linhas de código enquanto você escreve?",
  "Você sabia que o 'Bluetooth' recebeu esse nome em homenagem a um rei viking que unificou tribos na Escandinávia?",
  "Você sabia que 'Compilar' é traduzir o código humano para o código que a máquina entende?",
  "Você sabia que 'Interpretador' executa o código linha por linha em vez de traduzir tudo de uma vez?",
  "Você sabia que um 'Framework' pode aumentar a segurança do seu site por já ter proteções contra ataques comuns?",
  "Você sabia que o 'JSON' é hoje o formato mais usado para enviar dados entre sites e aplicativos mobile?",
  "Você sabia que 'Node_modules' é a pasta famosa por ocupar gigabytes de espaço em projetos JavaScript?",
  "Você sabia que 'CSS Grid' e 'Flexbox' são formas modernas de organizar o layout de um site sem tabelas?",
  "Você sabia que 'Firebase' é uma plataforma da Google que oferece banco de dados e autenticação prontos?",
  "Você sabia que 'Docker' permite que você rode um servidor inteiro dentro de uma 'caixa' virtual leve?",
  "Você sabia que 'AWS' (Amazon Web Services) é a maior empresa de nuvem do planeta terra?",
  "Você sabia que 'Google Cloud' e 'Microsoft Azure' são os principais rivais da Amazon em servidores de nuvem?",
  "Você sabia que 'DevOps' é a fusão de desenvolvedores com a equipe que cuida da infraestrutura dos servidores?",
  "Você sabia que 'Elasticsearch' é um motor de busca ultra rápido usado para procurar dados em segundos?",
  "Você sabia que 'Typescript' é como um JavaScript com 'superpoderes' de segurança e organização?",
  "Você sabia que 'Markdown' é usado por programadores para escrever documentações bonitas rapidamente?",
  "Você sabia que 'Responsive Web Design' garante que seu site funcione bem desde um relógio até uma TV 4K?",
  "Você sabia que 'Backend-as-a-Service' permite criar apps sem precisar programar um servidor do zero?",
  "Você sabia que 'Serverless' não significa que não tem servidor, mas que você não precisa se preocupar com ele?",
  "Você sabia que 'Cybersecurity' é hoje uma das áreas mais bem pagas do mundo da tecnologia?",
  "Você sabia que 'Data Science' usa estatística e programação para prever comportamentos de mercado?",
  "Você sabia que 'Python' é a linguagem oficial para ensinar robôs a aprenderem sozinhos (Machine Learning)?",
  "Você sabia que 'Web3' é a ideia de uma internet onde você é o dono dos seus dados através de redes descentralizadas?",
  "Você sabia que 'CORS' é um erro comum de segurança que impede seu site de ler dados de outro site não autorizado?",
  "Você sabia que 'Cookies' de terceiros serão banidos da internet para proteger a privacidade dos usuários?",
  "Você sabia que 'Dark Mode' (Modo Escuro) ajuda a economizar bateria em telas de tecnologia OLED?",
  "Você sabia que 'Megabit' (internet) é diferente de 'Megabyte' (arquivo)? 8 Megabits equivalem a 1 Megabyte.",
  "Você sabia que o 'Modem' transforma o sinal analógico do cabo em sinal digital para o seu computador?",
  "Você sabia que a 'Fibra Óptica' usa luz em vez de eletricidade, por isso ela não sofre interferência de relâmpagos?",
  "Você sabia que 'Open Source' mudou o mundo ao tornar códigos caros (como sistemas operacionais) gratuitos?",
  "Você sabia que o 'Stack Overflow' é o site onde programadores ajudam uns aos outros a resolver bugs?",
  "Você sabia que o 'Code Review' é quando um programador lê o código do outro para garantir que não tem erros?",
  "Você sabia que 'Peer-to-Peer' (P2P) permite baixar arquivos diretamente de outras pessoas sem um servidor central?",
  "Você sabia que a 'Nuvem' é na verdade apenas o computador de uma grande empresa sendo alugado por você?",
  "Você sabia que o primeiro sistema de gerenciamento de banco de dados (DBMS), o IDS, foi criado por Charles Bachman em 1963?",
  "Você sabia que a linguagem SMALLTALK-72 foi o primeiro ambiente que permitiu a crianças programarem objetos visualmente?",
  "Você sabia que o primeiro monitor de computador colorido foi o do Commodore VIC-20, lançado em 1980?",
  "Você sabia que a linguagem Forth foi criada por Charles H. Moore em 1970 para controlar radiotelescópios?",
  "Você sabia que o protocolo Gopher era o principal rival da World Wide Web no início dos anos 90?",
  "Você sabia que o primeiro processador de 64 bits para o mercado doméstico foi o Nintendo 64 (VR4300) em 1996?",
  "Você sabia que a linguagem de programação Julia foi criada por um grupo do MIT e lançada em 2012?",
  "Você sabia que o primeiro computador a usar a interface SCSI foi o Apple Macintosh Plus em 1986?",
  "Você sabia que o protocolo IMAP foi criado por Mark Crispin em 1986 como alternativa superior ao POP?",
  "Você sabia que a linguagem de programação D foi criada por Walter Bright em 2001 para ser sucessora do C++?",
  "Você sabia que o primeiro browser escrito em Java foi o HotJava da Sun Microsystems em 1995?",
  "Você sabia que a linguagem COBOL 2002 foi a primeira versão a introduzir o suporte oficial a objetos?",
  "Você sabia que o termo 'Digital Divide' foi popularizado no governo de Bill Clinton em 1995?",
  "Você sabia que o primeiro disco óptico (LaserDisc) foi demonstrado publicamente em 1972?",
  "Você sabia que a linguagem de programação Rust lançou sua versão 1.0 estável apenas em 2015?",
  "Você sabia que o primeiro serviço de música via streaming do mundo não foi o Spotify, mas sim o Pandora em 2005?",
  "Você sabia que o protocolo NTP (Network Time Protocol) é um dos mais antigos da internet, criado em 1985?",
  "Você sabia que a linguagem Logo foi a primeira a introduzir o conceito de 'geometria da tartaruga' para ensinar lógica?",
  "Você sabia que o primeiro sistema de diretório LDAP (Lightweight Directory Access Protocol) foi lançado em 1993?",
  "Você sabia que a linguagem Scala deve seu nome à palavra 'Scalable', indicando que ela cresce conforme a necessidade?",
  "Você sabia que o primeiro site a usar o nome 'Portal' foi o Netscape em 1996?",
  "Você sabia que o termo 'Wiki' vem do havaiano 'Wiki-Wiki', que significa 'rápido'?",
  "Você sabia que a linguagem de script Lua foi usada para programar jogos famosos como World of Warcraft e Angry Birds?",
  "Você sabia que o primeiro computador a integrar rede Ethernet de fábrica foi o Xerox Star em 1981?",
  "Você sabia que a linguagem Clojure é um dialeto de Lisp que roda sobre a máquina virtual do Java (JVM)?",
  "Você sabia que o protocolo TLS 1.2 foi publicado apenas em 2008, dez anos após a versão 1.0?",
  "Você sabia que a linguagem Swift foi a linguagem de crescimento mais rápido na história do GitHub após seu lançamento?",
  "Você sabia que o primeiro sistema de busca a indexar o texto completo das páginas foi o AltaVista em 1995?",
  "Você sabia que a linguagem C# foi originalmente chamada internamente de COOL (C-like Object Oriented Language)?",
  "Você sabia que o primeiro microcomputador portátil alimentado por bateria foi o Epson HX-20 em 1981?",
  "Você sabia que se todos os bits transmitidos em um segundo na internet fossem folhas de papel, elas cobririam a Lua?",
  "Você sabia que o primeiro computador de Steve Jobs na NeXT foi o que Tim Berners-Lee usou para criar a Web?",
  "Você sabia que o Google tem uma cópia offline de quase todos os sites que já existiram na história?",
  "Você sabia que as baterias de lítio perdem cerca de 20% de sua capacidade a cada 500 ciclos de carga completos?",
  "Você sabia que o primeiro computador gamer do mundo foi o PDP-1, rodando o jogo Spacewar! em 1961?",
  "Você sabia que o código do kernel Linux aumenta cerca de 10 mil linhas por dia em novas contribuições?",
  "Você sabia que se você abrir um processador moderno, verá que as trilhas de ouro e cobre são 1000x menores que uma formiga?",
  "Você sabia que o primeiro mouse da Apple custava $150 dólares para fabricar e tinha apenas um botão por exigência de Jobs?",
  "Você sabia que o sinal do Wi-Fi pode ser bloqueado até pela água do seu corpo, já que o corpo humano é 70% água?",
  "Você sabia que o sistema de arquivos FAT32 não permite que você guarde um único arquivo maior que 4 Gigabytes?",
  "Você sabia que a cada minuto são criados 500 novos perfis no LinkedIn em todo o mundo?",
  "Você sabia que um teclado comum é mais sujo que um assento de banheiro público devido à falta de limpeza?",
  "Você sabia que o termo 'Cyber' vem do grego 'Kybernetes', que significa o timoneiro ou governador de um navio?",
  "Você sabia que a IBM 5100 (1975) foi o primeiro computador a caber em cima de uma mesa sem precisar de um refrigerador externo?",
  "Você sabia que o primeiro hacker condenado nos EUA, Kevin Mitnick, ficou em isolamento porque o juiz achou que ele podia 'assobiar em um telefone e lançar um míssil nuclear'?",
  "Você sabia que o algoritmo de compressão do MP3 foi desenhado para remover primeiro os sons que os humanos não ouvem bem devido à idade?",
  "Você sabia que se você tentar processar um arquivo de áudio 'Lossless' (sem perdas), ele ocupa 10x mais espaço que um MP3 comum?",
  "Você sabia que o motor de busca Shodan consegue encontrar qualquer webcam, semáforo ou usina nuclear conectada à internet sem senha?",
  "Você sabia que a maioria dos ataques de hackers hoje não usa vírus complexos, mas sim engana o funcionário para ele dar a senha?",
  "Você sabia que o primeiro servidor DHCP foi lançado em 1993 para acabar com a bagunça de configurar IPs manualmente em cada rede?",
  "Você sabia que o formato de imagem WebP do Google carrega 30% mais rápido que um JPEG com a mesma qualidade visual?",
  "Você sabia que as telas de alta frequência (Hz) diminuem o cansaço visual de quem passa o dia programando?",
  "Você sabia que a inteligência artificial do Facebook teve que ser desligada uma vez porque criou uma linguagem própria que humanos não entendiam?",
  "Você sabia que o primeiro 'hard disk' pesava o mesmo que 5 cavalos adultos juntos?",
  "Você sabia que a luz da sua tela à noite engana o seu cérebro fazendo ele achar que ainda é dia, prejudicando o sono?",
  "Você sabia que o robô 'Curiosity' em Marte tem em seu interior uma memória flash de apenas 2 Gigabytes?",
  "Você sabia que o sistema operacional macOS usa nomes de felinos e montanhas da Califórnia para suas versões?",
  "Você sabia que o erro de segurança 'Ghost' afetava o Linux desde o ano 2000 antes de ser descoberto 15 anos depois?",
  "Você sabia que o Google guarda um histórico de todos os lugares que você já esteve com seu celular Android?",
  "Você sabia que se você excluir um arquivo da lixeira, os dados continuam no disco até que outro arquivo seja gravado por cima?",
  "Você sabia que o primeiro smartphone a ter uma App Store não foi o iPhone, mas o Nokia N95 com a 'Download!' store?",
  "Você sabia que a tecnologia Bluetooth foi batizada assim para representar a união de dispositivos de marcas diferentes?",
  "Você sabia que se você digitar seu nome no Google entre aspas, ele buscará apenas o seu nome exato e não partes dele?",
  "Você sabia que o comando 'Ctrl + F' é o melhor segredo para quem quer achar qualquer palavra em um texto gigante da internet?",
  "Você sabia que a primeira linguagem de alta nível, Fortran, era escrita em cartões perfurados que podiam cair no chão e arruinar meses de trabalho?",
  "Você sabia que a cada segundo o sol emite mais energia do que a humanidade consome em bilhões de anos de eletricidade?",
  "Você sabia que se você abrir o Prompt de Comando e digitar 'tree', verá uma representação visual de todas as pastas do seu PC?",
  "Você sabia que o protocolo HTTPS garante que ninguém entre você e o site saiba qual página exata você está olhando?",
  "Você sabia que o termo 'Software Engineering' foi defendido por Margaret Hamilton para dar a mesma importância à programação que à engenharia de foguetes?",
  "Você sabia que o robô da Google que indexa o mundo chama-se Googlebot e ele lê cada cantinho de texto que você posta hoje?",
  "Você sabia que a linguagem Rust foi eleita a linguagem mais amada pelos programadores no Stack Overflow por 7 anos seguidos?",
  "Você sabia que o criador do JavaScript, Brendan Eich, é também o cofundador do projeto Mozilla e do navegador Brave?",
  "Você sabia que o termo 'Deep Learning' foi popularizado em 2006 pelo Geoffrey Hinton, considerado o 'Padrinho da IA'?",
  "Você sabia que o primeiro disco rígido de 5MB da IBM (1956) era transportado por aviões cargueiros devido ao seu tamanho?",
  "Você sabia que o Windows 3.1 (1992) foi a versão que popularizou o Minesweeper e o Paciência para ensinar o uso do mouse?",
  "Você sabia que o sistema operacional BeOS (1991) quase foi comprado pela Apple antes deles escolherem o sistema da NeXT de Steve Jobs?",
  "Você sabia que a linguagem de programação Swift foi inspirada em linguagens como Ruby, Haskell e Rust?",
  "Você sabia que o primeiro videogame portátil de sucesso, o Game Boy (1989), tinha um processador de apenas 4 Megahertz?",
  "Você sabia que o criador do Gmail, Paul Buchheit, iniciou o projeto como um experimento paralelo secreto nas horas vagas?",
  "Você sabia que o primeiro domínio .com do mundo, symbolics.com, foi registrado por uma empresa de computadores de Lisp?",
  "Você sabia que a linguagem de programação Swift foi tornada open source pela Apple em dezembro de 2015?",
  "Você sabia que o primeiro microprocessador de 64 bits da Intel, o Itanium, foi considerado um dos maiores fracassos comerciais da empresa?",
  "Você sabia que o protocolo TCP/IP substituiu o antigo protocolo NCP na ARPANET em 1º de janeiro de 1983?",
  "Você sabia que a linguagem Python 3 foi lançada em 2008 tirando a compatibilidade com a versão 2 para limpar o design da linguagem?",
  "Você sabia que o primeiro scanner de código de barras foi usado em um pacote de chicletes Wrigley's em 1974?",
  "Você sabia que o criador do Python, Guido van Rossum, trabalhou para o Google de 2005 até 2012?",
  "Você sabia que a linguagem Lua (1993) nasceu no Brasil porque as sanções comerciais da época dificultavam a importação de software?",
  "Você sabia que a linguagem C# (2000) foi inicialmente chamada de 'Project Cool'?",
  "Você sabia que o PHP 4 foi o primeiro a introduzir o motor Zend, criado por Andi Gutmans e Zeev Suraski?",
  "Você sabia que o criador do C++, Bjarne Stroustrup, escreveu o livro 'The C++ Programming Language' em 1985?",
  "Você sabia que a linguagem Swift (2014) foi inspirada em Rust, Haskell, Ruby e Python?",
  "Você sabia que a linguagem Smalltalk foi criada por Alan Kay, Dan Ingalls e Adele Goldberg no Xerox PARC em 1972?",
  "Você sabia que o criador do JavaScript, Brendan Eich, levou apenas 10 dias para escrever a primeira versão da linguagem?",
  "Você sabia que a linguagem Kotlin foi oficialmente lançada pela JetBrains em 2011 após um ano de desenvolvimento?",
  "Você sabia que o criador do Ruby, Yukihiro Matsumoto, lançou a primeira versão estável (1.0) no dia de Natal de 1996?",
  "Você sabia que a linguagem Ada (1980) foi encomendada pelo Departamento de Defesa dos EUA para padronizar seus sistemas?",
  "Você sabia que Anders Hejlsberg, criador do TypeScript, também foi o arquiteto principal do Delphi e do C#?",
  "Você sabia que o criador do Go, Rob Pike, também é um dos autores do sistema operacional Plan 9?",
  "Você sabia que o criador do Erlang, Joe Armstrong, faleceu em 2019, mas seu legado mantém sistemas de telefonia globais ativos?",
  "Você sabia que a linguagem Perl (1987) foi criada para ser a 'linguagem cola' definitiva para processamento de texto no Unix?",
  "Você sabia que o criador do Prolog, Alain Colmerauer, usou a linguagem originalmente para processamento de linguagem natural?",
  "Você sabia que a linguagem Pascal (1970) foi criada para forçar os alunos a usarem programação estruturada?",
  "Você sabia que o criador do Scheme, Guy Steele, também foi um dos editores principais da especificação original do Java?",
  "Você sabia que a linguagem Delphi (1995) recebeu esse nome em referência ao Oráculo de Delfos, por ser capaz de falar com o Oracle (banco de dados)?",
  "Você sabia que o criador do Markdown, John Gruber, é o autor do blog tech 'Daring Fireball'?",
  "Você sabia que em 1969, o primeiro nó da ARPANET foi estabelecido entre a UCLA e o Stanford Research Institute?",
  "Você sabia que em 1983, a Microsoft anunciou o Windows 1.0, mas levou dois anos de 'vaporware' até o lançamento real em 1985?",
  "Você sabia que o primeiro comercial do Macintosh de 1984 foi exibido apenas uma vez durante o Super Bowl?",
  "Você sabia que o domínio google.com foi registrado em 15 de setembro de 1997?",
  "Você sabia que o dia 1 de janeiro de 1970 é o marco zero do Horário Unix (Epoch), usado por quase todos os servidores do mundo?",
  "Você sabia que em 2004, a Google lançou o Gmail por convite com 1GB de espaço, o que era 500 vezes mais que o Hotmail na época?",
  "Você sabia que o primeiro iPhone (2007) não tinha suporte para copiar e colar nem para gravar vídeos?",
  "Você sabia que em 1995, a Microsoft pagou pela música 'Start Me Up' dos Rolling Stones para promover o botão Iniciar do Windows 95?",
  "Você sabia que o primeiro bug de hardware de um microprocessador foi o 'Pentium FDIV bug' em 1994, que custou 475 milhões de dólares à Intel?",
  "Você sabia que o Y2K (Bug do Milênio) não causou o apocalipse porque programadores trabalharam bilhões de horas extras nos anos 90?",
  "Você sabia que o WiFi surgiu oficialmente em 1997, mas a tecnologia de rádio base foi desenvolvida pela atriz Hedy Lamarr na 2ª Guerra Mundial?",
  "Você sabia que o primeiro servidor do mundo (Tim Berners-Lee, 1990) tinha um adesivo dizendo: 'Esta máquina é um servidor. NÃO DESLIGUE!'?",
  "Você sabia que o roteador foi inventado na garagem de Leonard Bosack e Sandy Lerner em 1984, dando origem à Cisco?",
  "Você sabia que a primeira mensagem SMS foi enviada em 1992 por Neil Papworth para Richard Jarvis?",
  "Você sabia que o Bluetooth (1994) recebeu este nome em homenagem a Harald 'Bluetooth' Gormsson, um rei viking?",
  "Você sabia que em 1971, o engenheiro Ray Tomlinson enviou o primeiro e-mail da história entre dois computadores lado a lado?",
  "Você sabia que em 1998, a Google operava em uma garagem com apenas 3 computadores?",
  "Você sabia que o domínio facebook.com foi comprado por 200 mil dólares em 2005 para substituir o original thefacebook.com?",
  "Você sabia que em 2011, o IPv4 esgotou oficialmente todos os seus endereços principais disponíveis?",
  "Você sabia que a primeira transmissão Wi-Fi de longa distância foi feita através das montanhas da Califórnia em 1997?",
  "Você sabia que a CPU do primeiro PlayStation era um processador RISC de 33 MHz fabricado pela LSI Logic?",
  "Você sabia que o Game Boy original usava um processador Sharp LR35902, que era um híbrido entre o Z80 e o 8080?",
  "Você sabia que os chips modernos são feitos de silício porque é um semicondutor barato e abundante na areia?",
  "Você sabia que em 1980, a Seagate lançou o primeiro HD de 5,25 polegadas, com incríveis 5MB de capacidade?",
  "Você sabia que o supercomputador Cray-1 de 1976 pesava 5 toneladas e tinha apenas 8 mega-palavras de memória?",
  "Você sabia que um transistor moderno é cerca de 10.000 vezes menor do que um fio de cabelo humano?",
  "Você sabia que as salas limpas onde os processadores são feitos são 1000 vezes mais limpas do que um centro cirúrgico?",
  "Você sabia que o primeiro mouse óptico (1980) precisava de um mousepad especial com grade prateada para funcionar?",
  "Você sabia que o comando 'Ctrl+Alt+Del' foi inventado pelo engenheiro da IBM David Bradley nos anos 80?",
  "Você sabia que as baterias de lítio foram comercializadas pela primeira vez pela Sony em 1991?",
  "Você sabia que o pendrive foi patenteado em 1999 pela empresa M-Systems em parceria com a IBM?",
  "Você sabia que o primeiro microprocessador comercial, o Intel 4004 (1971), tinha apenas 2.300 transistores?",
  "Você sabia que a memória RAM é chamada de dinâmica (DRAM) porque precisa ser atualizada milhares de vezes por segundo para manter os dados?",
  "Você sabia que o clock de 1GHz significa que o processador executa 1 bilhão de ciclos por segundo?",
  "Você sabia que um disco rígido atual lê dados usando sensores que detectam campos magnéticos minúsculos?",
  "Você sabia que o laser azul no Blu-ray (2006) tem um comprimento de onda menor, permitindo gravar dados com mais densidade que o DVD?",
  "Você sabia que os teclados mecânicos voltaram à moda porque duram até 50 milhões de toques contra 5 milhões dos comuns?",
  "Você sabia que o chip M1 da Apple (2020) unificou a memória com o processador para eliminar o atraso da transferência de dados?",
  "Você sabia que a arquitetura x86 (Intel) domina os computadores desktop desde o lançamento do processador 8086 em 1978?",
  "Você sabia que os supercomputadores atuais medem performance em 'FLOPS' (operações de ponto flutuante por segundo)?",
  "Você sabia que o primeiro site brasileiro foi o do LNCC (Laboratório Nacional de Computação Científica) em 1991?",
  "Você sabia que o termo 'Deep Web' (1994) refere-se a qualquer conteúdo da internet que não é indexado por buscadores públicos?",
  "Você sabia que o Google Chrome ultrapassou o Internet Explorer como o navegador mais popular do mundo em 2012?",
  "Você sabia que o primeiro banner publicitário da internet foi vendido pela AT&T na revista HotWired em 1994?",
  "Você sabia que o HTTPS (1994) usa o protocolo SSL/TLS para criptografar a comunicação entre o seu navegador e o site?",
  "Você sabia que o primeiro malware para celular foi o worm 'Cabir' em 2004, que infectava o sistema Symbian?",
  "Você sabia que o termo 'Social Engineering' foi usado por Kevin Mitnick para descrever a manipulação psicológica como método de invasão?",
  "Você sabia que o ataque 'DDoS' mais antigo registrado ocorreu em 1999 contra a rede da Universidade de Minnesota?",
  "Você sabia que existem 13 endereços IP principais para os Servidores Raiz que gerenciam todo o tráfego de DNS do mundo?",
  "Você sabia que o protocolo HTTP/2 (2015) permite enviar múltiplos dados simultaneamente em uma única conexão?",
  "Você sabia que o primeiro scanner de vulnerabilidades, o SATAN, foi lançado publicamente na internet em 1995?",
  "Você sabia que o vírus 'I Love You' (2000) espalhou-se por e-mail e infectou 50 milhões de computadores em apenas 10 dias?",
  "Você sabia que a criptografia RSA (1977) foi nomeada em homenagem aos seus criadores Ron Rivest, Adi Shamir e Leonard Adleman?",
  "Você sabia que o primeiro site comercial de compras foi o NetMarket, que vendeu um CD do Sting em agosto de 1994?",
  "Você sabia que o termo 'Spam' (1978) originalmente veio de um esquete do Monty Python sobre uma carne enlatada onipresente?",
  "Você sabia que o navegador Mosaic (1993) foi o primeiro a exibir imagens na mesma linha de texto (inline images)?",
  "Você sabia que em 2016, um ataque DDoS usando câmeras de segurança derrubou metade da internet dos EUA por horas?",
  "Você sabia que o navegador Brave usa o mesmo motor de renderização do Chrome, o Chromium, mas foca em privacidade?",
  "Você sabia que o 'Cookie' recebeu esse nome porque programadores Unix chamavam pacotes de dados de 'Magic Cookies'?",
  "Você sabia que o primeiro domínio brasileiro (.br) registrado foi o da FAPESP em 1991?",
  "Você sabia que a Apollo 11 tinha um computador (AGC) com apenas 72KB de memória fixa (ROM)?",
  "Você sabia que o peso de todos os elétrons da internet atual somados eqüivale ao peso de um morango médio?",
  "Você sabia que os cartões perfurados eram usados para armazenar dados muito antes dos computadores, em máquinas de tear de 1801?",
  "Você sabia que a cada minuto, cerca de 500 horas de vídeo são carregadas no YouTube em todo o mundo?",
  "Você sabia que o criador de computadores Steve Wozniak vendeu seu HP-65 para ajudar a financiar a fundação da Apple em 1976?",
  "Você sabia que o código do jogo Doom (1993) foi um dos primeiros a ser escrito em C para garantir performance extrema em PCs da época?",
  "Você sabia que o primeiro serviço de streaming de vídeo foi o StarWorks em 1992, muito antes do YouTube ou Netflix?",
  "Você sabia que se você tentasse ler o código-fonte do Windows 10 em voz alta, levaria cerca de 30 anos sem parar?",
  "Você sabia que o primeiro site da internet explicava em apenas uma página o que era a World Wide Web e como usá-la?",
  "Você sabia que se o Facebook fosse um país, ele teria quase o dobro da população da China?",
  "Você sabia que a primeira interface de texto (Shell) foi criada para controlar computadores que ocupavam salas inteiras nos anos 60?",
  "Você sabia que o primeiro console com CD-ROM foi o PC Engine CD-ROM², lançado no Japão em 1988?",
  "Você sabia que se você digitasse 'google.com' em 1998, a página teria o aviso 'Search the Web using Google!'?",
  "Você sabia que a primeira versão do Photoshop rodava apenas em computadores Macintosh e vinha em disquetes de 800KB?",
  "Você sabia que o termo 'Hacker' era originalmente elogioso no MIT nos anos 60, descrevendo alguém mestre em hardware?",
  "Você sabia que os astronautas da estação espacial internacional usam laptops rodando Linux por ser mais estável no espaço?",
  "Você sabia que o código-fonte do computador de bordo da Apollo 11 continha comentários engraçados e referências a piadas da época?",
  "Você sabia que o primeiro robô inteligente (Shakey, 1966) levava horas para planejar o movimento de uma caixa entre salas?",
  "Você sabia que o processador M1 Ultra da Apple possui incríveis 114 bilhões de transistores?",
  "Você sabia que quase toda a infraestrutura da internet atual passa por apenas 300 cabos submarinos gigantes?",
  "Você sabia que o criador do Pascal, Niklaus Wirth, cunhou a lei que diz que 'o software fica lento mais rápido que o hardware ganha velocidade'?",
  "Você sabia que a linguagem Modula-2 (1978) foi criada para superar o Pascal em sistemas operacionais?",
  "Você sabia que o primeiro terminal de vídeo de baixo custo, o ADM-3A (1975), usava as teclas HJKL para mover o cursor, o que influenciou o editor Vim?",
  "Você sabia que o criador do CSS, Håkon Wium Lie, propôs a linguagem em 1994 enquanto trabalhava com Tim Berners-Lee?",
  "Você sabia que o criador da linguagem D, Walter Bright, também escreveu o primeiro compilador C++ nativo em 1988?",
  "Você sabia que a linguagem Go (2009) foi criada para resolver a lentidão na compilação de sistemas imensos no Google?",
  "Você sabia que o protocolo BitTorrent foi criado por Bram Cohen em 2001 e revolucionou a distribuição de arquivos pesados?",
  "Você sabia que o primeiro smartphone Nokia (9000 Communicator, 1996) pesava quase 400 gramas?",
  "Você sabia que a linguagem de programação Scratch (2007) foi criada no MIT para ensinar lógica a crianças através de blocos?",
  "Você sabia que o criador do Java, James Gosling, é um entusiasta de hardware e já construiu seus próprios processadores discretos?",
  "Você sabia que a linguagem Forth (1970) é baseada em pilhas e foi usada para controlar radiotelescópios e satélites?",
  "Você sabia que o primeiro teclado QWERTY foi patenteado por Christopher Sholes em 1867 para evitar o choque das hastes de máquinas de escrever?",
  "Você sabia que o criador do Linux, Linus Torvalds, recebeu o prêmio Millennium Technology em 2012 na Finlândia?",
  "Você sabia que o primeiro robô cirurgião controlado por computador foi o Robodoc em 1992?",
  "Você sabia que a linguagem PL/I (1964) foi criada pela IBM para ser a linguagem definitiva que substituiria o COBOL e o FORTRAN?",
  "Você sabia que em 1947, o Bell Labs inventou o transistor, o componente que substituiu as válvulas incandescentes?",
  "Você sabia que o termo 'Robot' veio da peça de teatro 'R.U.R.' (1920) do escritor tcheco Karel Čapek?",
  "Você sabia que em 1981, a IBM lançou o PC 5150, padronizando a arquitetura de computadores para as décadas seguintes?",
  "Você sabia que o criador do Unix, Ken Thompson, criou o jogo Space Travel antes de decidir escrever o sistema operacional?",
  "Você sabia que a linguagem Lisp (1958) é a segunda linguagem de alto nível mais antiga do mundo ainda em uso?",
  "Você sabia que a linguagem COBOL (1959) foi o primeiro esforço para criar uma linguagem que lesse como inglês?",
  "Você sabia que o criador do PHP, Rasmus Lerdorf, nasceu na Groenlândia e morou no Brasil durante a infância?",
  "Você sabia que em 1991, o CERN anunciou publicamente que a tecnologia da Web seria livre para qualquer pessoa usar sem pagar?",
  "Você sabia que a Microsoft quase lançou um sistema chamado 'Interface Manager' antes de decidir pelo nome Windows?",
  "Você sabia que o primeiro iMac (1998) foi o responsável por eliminar o drive de disquetes do mercado global?",
  "Você sabia que o criador do Ruby, Matz, escolheu o nome porque Rubi é a pedra de nascimento de julho, sucedendo o Perl (Pérola, pedra de junho)?",
  "Você sabia que em 1974, o primeiro código de barras foi escaneado em um supermercado em Ohio?",
  "Você sabia que a linguagem Delphi (1995) foi a primeira ferramenta visual a oferecer performance de código compilado real?",
  "Você sabia que o criador do Python nomeou a linguagem em homenagem ao programa de TV 'Monty Python's Flying Circus'?",
  "Você sabia que o criador da linguagem B, Ken Thompson, simplificou o BCPL para caber em computadores minúsculos da época?",
  "Você sabia que em 1993, o jogo Doom popularizou o modo multiplayer via rede, travando servidores de universidades inteiras?",
  "Você sabia que o termo 'Pixel' é a contração de 'Picture Element', surgido em 1965 no JPL da NASA?",
  "Você sabia que o criador do Git usou a filosofia 'se for devagar, é erro' para garantir a velocidade do software?",
  "Você sabia que a primeira câmera digital da Kodak (1975) levava 23 segundos para gravar uma imagem em preto e branco?",
  "Você sabia que a linguagem C++ foi considerada 'impossível de aprender totalmente' até pelo seu próprio criador, Bjarne Stroustrup?",
  "Você sabia que o domínio sex.com foi vendido em 2010 por 13 milhões de dólares após uma disputa judicial amarga?",
  "Você sabia que em 1976, a Apple I era vendida por 666,66 dólares porque Steve Wozniak gostava de números repetitivos?",
  "Você sabia que o criador do Java originalmente queria chamar a linguagem de 'Oak', em homenagem a um carvalho na janela dele?",
  "Você sabia que o primeiro site da Amazon apresentava apenas uma lista de livros e o logo era a letra A com um rio dentro?",
  "Você sabia que a linguagem Rust ganhou o prêmio de 'mais amada' no Stack Overflow por 8 anos consecutivos?",
  "Você sabia que em 1994, o Netscape Navigator detinha 90% de participação no mercado de navegadores?",
  "Você sabia que o criador do Linux também criou a licença GPLv2 como a 'constituição' do software livre?",
  "Você sabia que a linguagem Perl 5 foi o motor que moveu quase toda a Web dinâmica no final dos anos 90?",
  "Você sabia que o primeiro sistema operacional móvel com suporte total a multitarefa foi o Symbian OS?",
  "Você sabia que em 1970, a Honeywell lançou o primeiro computador comercial a usar circuitos integrados em larga escala?",
  "Você sabia que o termo 'Geek' originalmente descrevia artistas de circo bizarros, antes de ser adotado pela tecnologia?",
  "Você sabia que a linguagem Julia (2012) foi feita para unir a velocidade do C com a facilidade do Python?",
  "Você sabia que o criador do Vim, Bram Moolenaar, doava os lucros do software para um orfanato em Uganda?",
  "Você sabia que em 1984, a IBM lançou o PC/AT, introduzindo o barramento de expansão de 16 bits?",
  "Você sabia que a linguagem Simula 67 (1967) introduziu os conceitos de classes e objetos usados por quase todas as linguagens hoje?",
  "Você sabia que o primeiro servidor de e-mail brasileiro foi instalado na USP em 1988?",
  "Você sabia que o criador do PHP diz que ele nunca quis ser um programador, apenas criou a linguagem para resolver seus problemas?",
  "Você sabia que em 1999, o Napster permitiu que milhões de pessoas compartilhassem músicas P2P pela primeira vez?",
  "Você sabia que a linguagem Groovy (2003) trouxe a sintaxe do Ruby para o ecossistema corporativo do Java?",
  "Você sabia que em 2008, o Google lançou o projeto V8, tornando o JavaScript ordens de magnitude mais rápido?",
  "Você sabia que o criador da linguagem Elm (2012), Evan Czaplicki, focou em criar uma linguagem funcional sem erros em runtime?",
  "Você sabia que em 1972, a empresa Magnavox lançou o Odyssey, o primeiro console de videogame doméstico?",
  "Você sabia que o primeiro microcomputador brasileiro foi o Patinho Feio, desenvolvido na USP em 1971?",
  "Você sabia que a linguagem Pascal recebeu este nome em homenagem a Blaise Pascal, o inventor da primeira calculadora mecânica?",
  "Você sabia que em 1990, o Windows 3.0 permitiu pela primeira vez gerenciar memória acima de 640KB de forma eficiente?",
  "Você sabia que o criador da linguagem Scala, Martin Odersky, também escreveu o primeiro compilador Java genérico?",
  "Você sabia que o primeiro mouse óptico da Microsoft (1999) usava uma microcâmera para rastrear o movimento?",
  "Você sabia que a linguagem Dart (2011) foi criticada no início por tentar substituir o JavaScript de forma agressiva?",
  "Você sabia que em 1985, a Commodore lançou o Amiga 1000, o primeiro computador pessoal com capacidades multimídia avançadas?",
  "Você sabia que o criador do BitTorrent, Bram Cohen, tem Síndrome de Asperger e credita sua hiperfocagem ao sucesso do protocolo?",
  "Você sabia que o primeiro servidor web do Brasil foi o da FAPESP, no início dos anos 90?",
  "Você sabia que a linguagem Haskell é baseada puramente em cálculo lambda e não permite efeitos colaterais por padrão?",
  "Você sabia que em 1997, a IBM Deep Blue derrotou o campeão mundial de xadrez Garry Kasparov em um jogo histórico?",
  "Você sabia que o criador da linguagem Tcl, John Ousterhout, criou a biblioteca gráfica Tk para facilitar interfaces em Unix?",
  "Você sabia que o primeiro laptop a usar baterias de íon-lítio foi o Toshiba T3400 em 1993?",
  "Você sabia que a linguagem Clojure foi desenhada para facilitar a programação paralela em processadores multi-core?",
  "Você sabia que em 2004, o Facebook começou apenas para estudantes de Harvard antes de abrir para o mundo?",
  "Você sabia que o criador do PHP diz que 'programar é chato, por isso crio ferramentas que tornam o trabalho rápido'?",
  "Você sabia que em 1982, a revista Time elegeu o Computador como o 'Homem do Ano'?",
  "Você sabia que a linguagem Kotlin reduziu em 40% a quantidade de código Java necessária para apps Android?",
  "Você sabia que em 1994, o Mosaic foi renomeado para Netscape para evitar problemas legais de marca registrada?",
  "Você sabia que o criador da linguagem Ruby é um entusiasta de software livre e criou o lema 'MINAS' (Matz Is Nice And So Are We)?",
  "Você sabia que em 1978, o primeiro microprocessador de 16 bits da Intel foi o 8086, definindo a base do PC moderno?",
  "Você sabia que a linguagem Solidity (2014) foi criada por Gavin Wood especificamente para contratos inteligentes no Ethereum?",
  "Você sabia que o primeiro computador a oferecer reconhecimento de escrita manual foi o Apple Newton em 1993?",
  "Você sabia que o endereço IP '127.0.0.1' é o endereço de loopback, fazendo o PC falar consigo mesmo?",
  "Você sabia que o 'Ping of Death' era um ataque que enviava um pacote maior que o limite máximo de 65.535 bytes?",
  "Você sabia que um 'Endereço MAC' tem 48 bits e é único para cada placa de rede no mundo?",
  "Você sabia que no Linux, o processo de ID 1 (init) é o pai de absolutamente todos os outros processos?",
  "Você sabia que 'DPI' (Dots Per Inch) em mouses ópticos mede a sensibilidade do sensor de imagem interno?",
  "Você sabia que a 'Tela Azul da Morte' (BSOD) original foi escrita por Steve Ballmer em um rascunho rápido?",
  "Você sabia que o sinal 'WiFi' usa micro-ondas na mesma frequência de 2.4GHz que o seu forno elétrico?",
  "Você sabia que '8 bit', '16 bit' e '64 bit' referem-se ao tamanho da palavra que a CPU consegue processar de uma só vez?",
  "Você sabia que o 'Cache L1' da sua CPU é a memória mais rápida do planeta, operando à mesma velocidade do chip?",
  "Você sabia que o 'Firmware' é o software gravado em chips de memória ROM que não apaga ao desligar o PC?",
  "Você sabia que 'Overclocking' força o processador a trabalhar mais rápido gerando calor extremo por resistência elétrica?",
  "Você sabia que o 'Barramento' (Bus) é como uma rodovia de dados que conecta a CPU à memória e ao disco?",
  "Você sabia que no protocolo TCP, o remetente espera um 'ACK' (confirmação) antes de enviar o próximo dado?",
  "Você sabia que no protocolo UDP, o dado é enviado sem confirmação, sendo ideal para vídeos e jogos online?",
  "Você sabia que '1 Gigabyte' comercialmente são 1000 Megabytes, mas para o seu computador são 1024 Megabytes?",
  "Você sabia que a CPU faz bilhões de operações matemáticas simples (soma e subtração) a cada segundo?",
  "Você sabia que o 'Bitwise operator' permite manipular zeros e uns individuais de um número na memória?",
  "Você sabia que a instrução de Assembly 'NOP' diz ao processador para não fazer absolutamente nada naquele ciclo?",
  "Você sabia que o 'Thread' é uma linha de execução dentro de um processo; um app pode ter centenas de threads?",
  "Você sabia que o 'Memory Management Unit' (MMU) é o chip que organiza qual parte da RAM física pertence a qual programa?",
  "Você sabia que a cada segundo o seu monitor 60Hz redescreve a imagem inteira na tela 60 vezes?",
  "Você sabia que o 'HDMI' e o 'DisplayPort' transmitem dados de vídeo e áudio em forma de pacotes digitais?",
  "Você sabia que o 'Z-buffer' é o que impede que objetos que estão atrás apareçam na frente em jogos 3D?",
  "Você sabia que 'V-Sync' sincroniza os quadros da placa de vídeo com a taxa de atualização do seu monitor?",
  "Você sabia que a 'Pasta Térmica' serve para preencher as imperfeições de ar entre o chip e o dissipador?",
  "Você sabia que o 'SSD' morre mais rápido se você gravar e apagar dados nele exaustivamente todos os dias?",
  "Você sabia que o 'Format C:' no antigo DOS apagava a tabela de endereços, mas os dados continuavam lá até serem sobrescritos?",
  "Você sabia que o 'MAC Address' pode ser clonado via software para mascarar a identidade física do seu computador?",
  "Você sabia que as luzes do seu teclado (Caps, Num) eram controladas diretamente pela CPU em PCs antigos?",
  "Você sabia que quase todos os computadores atuais usam a arquitetura de 'Von Neumann', que separa CPU e Memória?",
  "Você sabia que o 'Hexadecimal' é usado em computação porque cada dígito (0-F) representa exatamente 4 bits?",
  "Você sabia que uma 'Porta Lógica' (AND, OR, NOT) é feita de grupos de transistores que decidem se a eletricidade passa?",
  "Você sabia que o calor do seu PC vem da eletricidade que 'escapa' pelos transistores e vira temperatura na carcaça?",
  "Você sabia que o 'Kernel' é o único programa que tem permissão para falar diretamente com o seu teclado e HD?",
  "Você sabia que o 'Shell' é uma casca que protege o Kernel e aceita os comandos que você digita no terminal?",
  "Você sabia que '1 Hertz' é uma vibração por segundo; um chip de 3GHz vibra 3 bilhões de vezes por segundo?",
  "Você sabia que 'Big Endian' e 'Little Endian' definem se o número começa pelo byte mais importante ou menos importante na RAM?",
  "Você sabia que a 'Tabela ASCII' tem apenas 128 códigos originais, suficientes para o alfabeto inglês e números?",
  "Você sabia que o 'Unicode' foi criado para caber todos os idiomas da Terra e milhares de emojis em um só padrão?",
  "Você sabia que a cada segundo seu computador gasta energia apenas para manter os dados vivos na memória RAM?",
  "Você sabia que o primeiro sistema de arquivos do Unix não permitia que os usuários fossem donos de arquivos?",
  "Você sabia que o criador do C++, Bjarne Stroustrup, originalmente chamou sua tese de 'C with Classes'?",
  "Você sabia que em 1988, o Morris Worm derrubou 10% de toda a internet da época em apenas 24 horas?",
  "Você sabia que a linguagem APL é tão densa que você pode escrever um interpretador inteiro em apenas uma linha de código?",
  "Você sabia que o Windows 95 foi o primeiro sistema a rodar no modo protegido de 32 bits por padrão, matando a era pura do DOS?",
  "Você sabia que o processador Intel 8008 foi originalmente encomendado pela Datapoint para ser o cérebro de um terminal de texto?",
  "Você sabia que a primeira linguagem de programação funcional real foi o LISP, criada para inteligência artificial no final dos anos 50?",
  "Você sabia que o termo 'Software' foi usado pela primeira vez em um artigo de John Tukey em 1958?",
  "Você sabia que a Apple quase foi vendida para a Sun Microsystems por uma fração do seu valor atual na década de 90?",
  "Você sabia que o primeiro browser do Windows se chamava 'Cello' e foi criado por um advogado?",
  "Você sabia que o protocolo Gopher era o rival da Web e usava um sistema de menus em vez de hipertexto?",
  "Você sabia que a linguagem Brainfuck foi criada para ser a menor linguagem de programação possível, com apenas 8 comandos?",
  "Você sabia que em 1970, o Ken Thompson criou o sistema operacional B, que era o pai direto da linguagem C?",
  "Você sabia que o primeiro servidor web fora da Europa foi instalado por um físico brasileiro no SLAC, nos EUA?",
  "Você sabia que o nome 'Ethernet' foi inspirado no conceito de 'Éter Luminífero', que os físicos do século XIX acreditavam que transmitia a luz?",
  "Você sabia que o primeiro videogame portátil da história foi o Microvision, lançado em 1979 com cartuchos trocáveis?",
  "Você sabia que o núcleo do Windows 10 ainda contém código escrito para o Windows NT 3.1 em 1993?",
  "Você sabia que o processador Zilog Z80 era tão popular que foi usado desde o Game Boy até máquinas de lavar?",
  "Você sabia que em 1992, o formato JPEG foi padronizado para permitir que fotos digitais ocupassem 10x menos espaço?",
  "Você sabia que o primeiro e-mail de spam foi enviado por um vendedor da DEC oferecendo novos modelos de computadores?",
  "Você sabia que o código original do Apollo 11 incluía um programa chamado 'BURN_BABY_BURN'?",
  "Você sabia que em 1996, o Deep Blue da IBM foi o primeiro computador a vencer um jogo individual contra Garry Kasparov?",
  "Você sabia que a linguagem de programação ADA foi batizada em homenagem a Ada Lovelace quase 130 anos após sua morte?",
  "Você sabia que o termo 'User Friendly' foi usado pela primeira vez em 1972 em um artigo sobre sistemas operacionais?",
  "Você sabia que o primeiro vírus de computador 'In-The-Wild' para Mac foi o Elk Cloner, criado por um estudante de 15 anos?",
  "Você sabia que a Microsoft comprou o QDOS por apenas 50 mil dólares para transformá-lo no MS-DOS?",
  "Você sabia que o comando 'ls' do Unix é uma das raras instruções que quase não mudou de sintaxe em 50 anos?",
  "Você sabia que o PDF foi criado por um cofundador da Adobe para permitir o 'escritório sem papel'?",
  "Você sabia que a primeira interface gráfica colorida para o público geral foi a do Apple II, lançado em 1977?",
  "Você sabia que a Hewlett-Packard foi a primeira empresa a fabricar uma calculadora científica de bolso, a HP-35?",
  "Você sabia que a linguagem COBOL ainda processa mais de 80% das transações financeiras presenciais no mundo?",
  "Você sabia que a primeira webcam do mundo foi vendida por 3.350 dólares em um leilão de itens históricos de Cambridge?",
  "Você sabia que o protocolo DNS foi inventado porque os cientistas da ARPANET não aguentavam mais atualizar o arquivo 'hosts.txt' manualmente?",
  "Você sabia que em 1973, a Xerox criou o Alto, que já tinha mouse, rede e janelas, mas nunca o vendeu comercialmente?",
  "Você sabia que o criador do PHP diz que aprendeu a programar apenas para poder rastrear quantas pessoas liam seu currículo online?",
  "Você sabia que o kernel do Linux pesava menos de 100KB em sua primeira versão de 1991?",
  "Você sabia que o termo 'Bit' foi cunhado por Claude Shannon, o pai da teoria da informação?",
  "Você sabia que a primeira versão do Java rodava apenas em uma pequena televisão interativa chamada Star7?",
  "Você sabia que o nome 'Nokia' vem da cidade de Nokia na Finlândia, onde a empresa fabricava borracha?",
  "Você sabia que o comando 'sudo' significa originalmente 'Substitute User DO'?",
  "Você sabia que o primeiro hard drive da Apple tinha apenas 5MB e custava quase 4 mil dólares?",
  "Você sabia que a linguagem C original foi considerada uma 'linguagem de montagem de alto nível'?",
  "Você sabia que o primeiro microprocessador de 32 bits real foi o Motorola 68000, usado nos primeiros Macs?",
  "Você sabia que a IBM 704 foi o primeiro computador capaz de realizar cálculos de ponto flutuante em hardware?",
  "Você sabia que o termo 'Virtual Memory' foi descrito teoricamente pela primeira vez na Universidade de Manchester em 1959?",
  "Você sabia que em 1989, o World Wide Web nem tinha o nome de 'Web', era chamado de 'Information Management: A Proposal'?",
  "Você sabia que o primeiro sistema de correio eletrônico em rede foi o SNDMSG em 1971?",
  "Você sabia que a linguagem Smalltalk influenciou Steve Jobs a colocar janelas no Macintosh?",
  "Você sabia que o primeiro 'Domain Name System' (DNS) usava apenas sete domínios de topo: .com, .edu, .gov, .mil, .net, .org e .arpa?",
  "Você sabia que o processador Intel 8086 não tinha uma unidade de ponto flutuante, você precisava comprar o coprocessador 8087 separado?",
  "Você sabia que o Windows 3.1 foi o primeiro a incluir fontes TrueType, permitindo design gráfico no PC?",
  "Você sabia que em 1993, o navegador Mosaic foi responsável por 90% de todo o tráfego da Web nascente?",
  "Você sabia que a primeira linguagem de script popular foi o Ousterhout's Tcl (Tool Command Language)?",
  "Você sabia que o primeiro roteador da Cisco foi montado em um corredor da Universidade de Stanford?",
  "Você sabia que a linguagem Forth é baseada em pilhas e não usa parênteses para chamadas de função?",
  "Você sabia que o termo 'Cookie' vem do termo Unix 'Magic Cookie', que descrevia blocos de dados trocados entre processos?",
  "Você sabia que o primeiro servidor web americano foi instalado por Paul Kunz após ele visitar o CERN e ver a ideia de Tim Berners-Lee?",
  "Você sabia que a linguagem ALGOL foi a primeira a usar a notação BNF para descrever sua própria sintaxe?",
  "Você sabia que o criador do Python, Guido van Rossum, é chamado de 'Ditador Benevolente Vitalício' da linguagem?",
  "Você sabia que a linguagem C++ introduziu o conceito de 'Destrutores' para garantir que a memória fosse limpa automaticamente?",
  "Você sabia que a primeira versão do Microsoft Excel foi lançada apenas para o Mac em 1985?",
  "Você sabia que o termo 'Kernel' vem do alemão e significa 'núcleo' ou 'semente'?",
  "Você sabia que o primeiro sistema operacional brasileiro de larga escala foi o SOS, desenvolvido nos anos 70?",
  "Você sabia que o processador MOS 6502 era tão barato que foi o preferido da Apple, Commodore e Nintendo?",
  "Você sabia que a primeira impressora laser foi a Xerox 9700, lançada em 1977?",
  "Você sabia que o termo 'Spam' foi oficialmente reconhecido pelo dicionário Oxford em 1998?",
  "Você sabia que em 1991, o primeiro site brasileiro foi hospedado no LNCC?",
  "Você sabia que a linguagem SQL foi originalmente chamada de SEQUEL (Structured English Query Language)?",
  "Você sabia que o primeiro laptop a ter um trackball integrado foi o PowerBook da Apple em 1991?",
  "Você sabia que o nome 'Intel' foi quase 'Moore Noyce', mas como soava como 'More Noise' (Mais Ruído), eles desistiram?",
  "Você sabia que o primeiro vírus de macro disparou em 1995 através de documentos do Microsoft Word?",
  "Você sabia que a arquitetura 'Von Neumann' é a base de quase todos os computadores que existem hoje?",
  "Você sabia que a primeira linguagem de programação para crianças foi o LOGO, que usava uma tartaruga robótica?",
  "Você sabia que o termo 'Bug' foi popularizado por Grace Hopper quando ela encontrou uma mariposa dentro de um computador Mark II?",
  "Você sabia que o primeiro microcomputador de 16 bits foi o TMS9900 da Texas Instruments?",
  "Você sabia que a linguagem PASCAL foi a primeira a padronizar o uso de 'Case' em vez de múltiplos 'Ifs'?",
  "Você sabia que em 1984, a revista Time escolheu o computador como o 'Indivíduo do Ano'?",
  "Você sabia que o primeiro computador pessoal comercial com interface gráfica foi o Lisa, da Apple?",
  "Você sabia que a linguagem C foi escrita para substituir o Assembly no desenvolvimento do Unix?",
  "Você sabia que o primeiro e-mail enviado entre dois países diferentes ocorreu em 1973?",
  "Você sabia que a linguagem PHP era originalmente apenas um conjunto de scripts em C chamado 'Personal Home Page Tools'?",
  "Você sabia que o primeiro smartphone real foi o Simon Personal Communicator da IBM em 1992?",
  "Você sabia que o termo 'Pixel' surgiu em 1965 para descrever os elementos das imagens de satélite?",
  "Você sabia que o primeiro videocame comercial de sucesso foi o Pong, da Atari?",
  "Você sabia que a linguagem COBOL foi a primeira a focar em processamento de dados para negócios?",
  "Você sabia que o primeiro servidor de nomes DNS foi implementado pela SRI em 1983?",
  "Você sabia que a linguagem BASIC foi criada para que alunos de humanidades pudessem usar computadores?",
  "Você sabia que o primeiro hard drive de 1 Gigabyte foi lançado pela IBM em 1980?",
  "Você sabia que o termo 'Robot' vem da palavra tcheca 'Robota', que significa trabalho forçado?",
  "Você sabia que a primeira mensagem enviada pela internet foi apenas 'lo', antes de o sistema cair?",
  "Você sabia que o primeiro computador a oferecer cores integradas foi o Apple II?",
  "Você sabia que o termo 'Internet' é a abreviação de 'Internetworking'?",
  "Você sabia que em 1985, a Microsoft lançou o Windows 1.0 custando 99 dólares?",
  "Você sabia que a linguagem JAVA foi criada originalmente para ser usada em eletrodomésticos inteligentes?",
  "Você sabia que o primeiro browser popular a suportar imagens foi o Mosaic?",
  "Você sabia que a linguagem PYTHON foi batizada em homenagem ao grupo Monty Python?",
  "Você sabia que o primeiro microprocessador comercial foi o Intel 4004 de 4 bits?",
  "Você sabia que em 1991, o CERN lançou a World Wide Web de forma totalmente gratuita?",
  "Você sabia que o termo 'Hypertext' foi cunhado em 1963?",
  "Você sabia que o primeiro sistema operacional multitarefa para PC foi o OS/2?",
  "Você sabia que a linguagem ASSEMBLY é específica para cada arquitetura de processador?",
  "Você sabia que o primeiro laser foi inventado em 1960 pelo físico Theodore Maiman?",
  "Você sabia que a linguagem C++ foi a primeira a popularizar a Programação Orientada a Objetos extensiva?",
  "Você sabia que em 1994, o Netscape Navigator mudou o nome de Mosaic para evitar disputas?",
  "Você sabia que o termo 'Web' foi sugerido por Tim Berners-Lee em um restaurante?",
  "Você sabia que o primeiro computador portável real foi o Osborne 1, que pesava 11kg?",
  "Você sabia que a linguagem RUBY foi criada no Japão por Yukihiro Matsumoto?",
  "Você sabia que o primeiro disquete comercial tinha 8 polegadas de diâmetro?",
  "Você sabia que a linguagem PERL foi lançada em 1987 para facilitar o processamento de relatórios?",
  "Você sabia que em 1976, Steve Jobs e Wozniak fundaram a Apple na garagem dos pais de Jobs?",
  "Você sabia que o termo 'Bit' é a abreviação de 'Binary Digit'?",
  "Você sabia que o primeiro supercomputador, o CDC 6600, foi projetado por Seymour Cray?",
  "Você sabia que em 1983, o protocolo TCP/IP tornou-se o padrão oficial da internet?",
  "Você sabia que a linguagem LISP usa parênteses para definir todas as suas estruturas?",
  "Você sabia que o primeiro mouse de computador era feito de madeira com apenas um botão?",
  "Você sabia que em 1998, Larry Page e Sergey Brin fundaram o Google em uma garagem?",
  "Você sabia que o primeiro smartphone Android não tinha conector para fones de ouvido?",
  "Você sabia que a linguagem SWIFT foi criada pela Apple para substituir o Objective-C?",
  "Você sabia que em 1995, a Microsoft lançou o Internet Explorer como um add-on do Windows 95?",
  "Você sabia que o termo 'Geek' originalmente descrevia artistas de circo que comiam galinhas vivas?",
  "Você sabia que a linguagem SCALA foi criada para unir o funcional ao orientado a objetos?",
  "Você sabia que o primeiro computador a usar interface gráfica e mouse foi o Xerox Alto?",
  "Você sabia que em 1982, o primeiro CD player foi lançado comercialmente?",
  "Você sabia que o termo 'Mnemônico' é usado para descrever os comandos encurtados do Assembly?",
  "Você sabia que a linguagem FORTRAN foi a primeira a permitir que cientistas escrevessem fórmulas matemáticas direto no código?",
  "Você sabia que em 1971, o primeiro processador comercial da Intel continha 2.300 transistores?",
  "Você sabia que o termo 'Desktop' surgiu para diferenciar computadores que cabiam em mesas dos mainframes gigantes?",
  "Você sabia que a linguagem KOTLIN foi criada pela JetBrains para ser 100% compatível com Java?",
  "Você sabia que em 1988, o IRC foi criado para permitir conversas em tempo real na rede?",
  "Você sabia que o primeiro hacker de hardware famoso foi John Draper, conhecido como Captain Crunch?",
  "Você sabia que a linguagem SCHEME foi a primeira a introduzir o escopo estático para variáveis?",
  "Você sabia que em 1996, o primeiro browser da Microsoft foi incluído gratuitamente no Windows para vencer a guerra dos browsers?",
  "Você sabia que o termo 'Wi-Fi' não tem significado técnico e foi criado por uma agência de marketing?",
  "Você sabia que a linguagem D foi criada para unir o poder do C++ com a facilidade do Python?",
  "Você sabia que em 1972, a Magnavox lançou o primeiro videogame doméstico, o Odyssey?",
  "Você sabia que o primeiro servidor web brasileiro foi hospedado na FAPESP?",
  "Você sabia que a linguagem HASKELL é nomeada em homenagem ao lógico Haskell Curry?",
  "Você sabia que em 1987, o Photoshop foi criado como um projeto de mestrado?",
  "Você sabia que o termo 'Blog' é a abreviação de Weblog?",
  "Você sabia que a linguagem PROLOG é a base de muitos sistemas especialistas em IA?",
  "Você sabia que em 1999, o Napster mudou para sempre a indústria da música via P2P?",
  "Você sabia que o primeiro navegador gráfico moderno foi o Netscape Navigator?",
  "Você sabia que o termo 'Cache' vem do francês e significa esconderijo?",
  "Você sabia que na década de 60, programar significava furar cartões de papel?",
  "Você sabia que a primeira webcam filmava uma cafeteira para evitar viagens perdidas até a cozinha?",
  "Você sabia que o kernel do Linux pesava menos de 100KB em sua primeira versão?",
  "Você sabia que o termo 'Bit' foi cunhado por Claude Shannon?",
  "Você sabia que a primeira versão do Java rodava apenas em uma pequena televisão interativa?",
  "Você sabia que o nome 'Nokia' vem da cidade de Nokia na Finlândia?",
  "Você sabia que o primeiro hard drive da Apple tinha apenas 5MB?",
  "Você sabia que a linguagem C original foi considerada uma linguagem de montagem de alto nível?",
  "Você sabia que o primeiro microprocessador de 32 bits real foi o Motorola 68000?",
  "Você sabia que a IBM 704 foi o primeiro computador capaz de realizar cálculos de ponto flutuante?",
  "Você sabia que o termo 'Virtual Memory' foi descrito teoricamente pela primeira vez em 1959?",
  "Você sabia que em 1989, o World Wide Web nem tinha o nome de 'Web'?",
  "Você sabia que o primeiro sistema de correio eletrônico em rede foi o SNDMSG?",
  "Você sabia que o primeiro DNS usava apenas sete domínios de topo?",
  "Você sabia que o processador Intel 8086 não tinha uma unidade de ponto flutuante nativa?",
  "Você sabia que o Windows 3.1 foi o primeiro a incluir fontes TrueType?",
  "Você sabia que em 1993, o navegador Mosaic foi responsável por 90% do tráfego da Web?",
  "Você sabia que o primeiro roteador da Cisco foi montado em um corredor?",
  "Você sabia que a linguagem Forth é baseada em pilhas?",
  "Você sabia que o termo 'Cookie' vem do termo Unix 'Magic Cookie'?",
  "Você sabia que o primeiro servidor web americano foi instalado após uma visita ao CERN?",
  "Você sabia que a linguagem ALGOL foi a primeira a usar a notação BNF?",
  "Você sabia que o criador do Python é chamado de Ditador Benevolente Vitalício?",
  "Você sabia que a linguagem C++ introduziu o conceito de Destrutores?",
  "Você sabia que a primeira versão do Microsoft Excel foi lançada apenas para o Mac?",
  "Você sabia que o termo 'Kernel' vem do alemão e significa núcleo?",
  "Você sabia que o primeiro sistema operacional brasileiro de larga escala foi o SOS?",
  "Você sabia que o processador MOS 6502 era tão barato que fundou a Apple e o Nintendo?",
  "Você sabia que a primeira impressora laser foi lançada em 1977?",
  "Você sabia que o termo 'Spam' foi oficialmente reconhecido em 1998?",
  "Você sabia que a linguagem SQL foi originalmente chamada de SEQUEL?",
  "Você sabia que o primeiro laptop com trackball foi o PowerBook?",
  "Você sabia que o nome 'Intel' foi quase Moore Noyce?",
  "Você sabia que o primeiro vírus de macro disparou em 1995?",
  "Você sabia que a arquitetura Von Neumann é a base de quase todos os PCs?",
  "Você sabia que a primeira linguagem para crianças foi o LOGO?",
  "Você sabia que o termo 'Bug' foi popularizado por Grace Hopper?",
  "Você sabia que o primeiro microcomputador de 16 bits foi o TMS9900?",
  "Você sabia que a linguagem PASCAL foi a primeira a padronizar o Case?",
  "Você sabia que em 1984, a Time escolheu o computador como o 'Indivíduo do Ano'?",
  "Você sabia que o primeiro computador pessoal comercial com GUI foi o Lisa?",
  "Você sabia que a linguagem C foi escrita para substituir o Assembly no Unix?",
  "Você sabia que o primeiro e-mail transnacional ocorreu em 1973?",
  "Você sabia que a linguagem PHP era originalmente apenas scripts em C?",
  "Você sabia que o primeiro smartphone real foi o Simon da IBM?",
  "Você sabia que o termo 'Pixel' surgiu em 1965 no JPL?",
  "Você sabia que o primeiro videogame comercial foi o Pong?",
  "Você sabia que a linguagem COBOL foi a primeira focada em negócios?",
  "Você sabia que o primeiro servidor DNS foi implementado em 1983?",
  "Você sabia que a linguagem BASIC foi criada para alunos de humanidades?",
  "Você sabia que o primeiro hard drive de 1 Gigabyte foi lançado pela IBM?",
  "Você sabia que o termo 'Robot' vem de uma peça de teatro tcheca?",
  "Você sabia que a primeira mensagem da internet foi 'lo'?",
  "Você sabia que o primeiro computador com cores integradas foi o Apple II?",
  "Você sabia que o termo 'Internet' é a abreviação de Internetworking?",
  "Você sabia que em 1985, a Microsoft lançou o Windows 1.0?",
  "Você sabia que a linguagem JAVA foi criada para TVs interativas?",
  "Você sabia que a linguagem PYTHON foi batizada em homenagem ao Monty Python?",
  "Você sabia que o primeiro microprocessador comercial foi o Intel 4004?",
  "Você sabia que em 1991, o CERN lançou a Web de forma gratuita?",
  "Você sabia que o primeiro SO multitarefa para PC foi o OS/2?",
  "Você sabia que a linguagem ASSEMBLY é específica por arquitetura?",
  "Você sabia que o primeiro laser foi inventado em 1960?",
  "Você sabia que a linguagem C++ popularizou a Orientação a Objetos?",
  "Você sabia que em 1994, o Netscape mudou o nome para evitar brigas?",
  "Você sabia que o termo 'Web' foi sugerido por Tim Berners-Lee?",
  "Você sabia que o primeiro computador portável real foi o Osborne 1?",
  "Você sabia que a linguagem RUBY foi criada no Japão?",
  "Você sabia que o primeiro disquete comercial tinha 8 polegadas?",
  "Você sabia que a linguagem PERL foi lançada em 1987?",
  "Você sabia que em 1976, a Apple foi fundada em uma garagem?",
  "Você sabia que o termo 'Bit' é Binary Digit?",
  "Você sabia que o primeiro supercomputador foi o CDC 6600?",
  "Você sabia que em 1983, o TCP/IP tornou-se o padrão oficial?",
  "Você sabia que a linguagem LISP usa muitos parênteses?",
  "Você sabia que o primeiro mouse de computador era de madeira?",
  "Você sabia que em 1998, o Google foi fundado em uma garagem?",
  "Você sabia que o primeiro Android não tinha fone de ouvido?",
  "Você sabia que a linguagem SWIFT foi feita para substituir o Objective-C?",
  "Você sabia que em 1995, o Internet Explorer foi lançado no Windows 95?",
  "Você sabia que o termo 'Geek' descrevia artistas de circo?",
  "Você sabia que a linguagem SCALA une funcional e objetos?",
  "Você sabia que o primeiro PC com mouse e GUI foi o Xerox Alto?",
  "Você sabia que em 1982, o primeiro CD player foi lançado?",
  "Você sabia que o termo 'Mnemônico' descreve comandos do Assembly?",
  "Você sabia que a linguagem FORTRAN permitiu fórmulas matemáticas?",
  "Você sabia que em 1971, o primeiro processador Intel tinha 2.300 transistores?",
  "Você sabia que o termo 'Desktop' diferenciou PCs de mainframes?",
  "Você sabia que a linguagem KOTLIN é 100% compatível com Java?",
  "Você sabia que em 1988, o IRC foi criado para chat em rede?",
  "Você sabia que o primeiro hacker famoso foi Captain Crunch?",
  "Você sabia que a linguagem SCHEME introduziu o escopo estático?",
  "Você sabia que em 1996, o browser da Microsoft foi incluído no Windows?",
  "Você sabia que o termo 'Wi-Fi' não tem significado técnico?",
  "Você sabia que a linguagem D une C++ com Python?",
  "Você sabia que em 1972, o primeiro videogame Odyssey foi lançado?",
  "Você sabia que o primeiro servidor web brasileiro foi na FAPESP?",
  "Você sabia que a linguagem HASKELL homenageia um lógico?",
  "Você sabia que em 1987, o Photoshop nasceu como tese?",
  "Você sabia que o termo 'Blog' é Weblog?",
  "Você sabia que a linguagem PROLOG é usada em IA?",
  "Você sabia que em 1999, o Napster mudou a música via P2P?",
  "Você sabia que o primeiro navegador moderno foi o Netscape?",
  "Você sabia que o termo 'Cache' significa esconderijo?",
  "Você sabia que o algoritmo de compactação LZW é a base do formato GIF?",
  "Você sabia que a primeira linguagem de programação de alto nível compilada foi o FORTRAN?",
  "Você sabia que o termo 'Software Engineering' foi cunhado para combater a crise do software?",
  "Você sabia que o primeiro computador com transistores foi o Manchester Transistor Computer em 1953?",
  "Você sabia que a linguagem de programação ML foi a primeira com inferência de tipos polimórficos?",
  "Você sabia que o processador Intel 80386 foi o primeiro x86 de 32 bits real?",
  "Você sabia que em 1981, Bill Gates disse que 640KB de RAM seriam suficientes para todos?",
  "Você sabia que o kernel do Mac (XNU) é baseado no microkernel Mach?",
  "Você sabia que a linguagem de programação rust foi inspirada em linguagens como Cyclone e OCaml?",
  "Você sabia que o primeiro sistema de arquivos a usar 'journaling' comercialmente foi o JFS da IBM?",
  "Você sabia que a linguagem de programação Go foi desenhada para ser compilada em segundos?",
  "Você sabia que o protocolo HTTPS usa criptografia assimétrica para troca de chaves?",
  "Você sabia que o termo 'Open Source' foi criado para ser mais 'amigável aos negócios' que Free Software?",
  "Você sabia que o primeiro disco rígido comercial de 5MB pesava mais de uma tonelada?",
  "Você sabia que a linguagem de programação Swift usa contagem automática de referências (ARC)?",
  "Você sabia que o primeiro modem comercial transmitia apenas 300 bits por segundo?",
  "Você sabia que o termo 'Bit' foi sugerido originalmente como 'Binit' antes de virar Bit?",
  "Você sabia que a linguagem de programação Ruby foi lançada publicamente em 1995?",
  "Você sabia que o primeiro roteador moderno foi o IMP, usado na ARPANET?",
  "Você sabia que a linguagem de programação Pascal foi a primeira a ser portada amplamente para microcomputadores?",
  "Você sabia que o protocolo FTP originalmente não exigia senhas?",
  "Você sabia que o termo 'Cybersecurity' tornou-se comum apenas na década de 90?",
  "Você sabia que a linguagem de programação Julia é otimizada para computação técnica e científica?",
  "Você sabia que o primeiro browser do Windows a usar a engine do Chrome foi o Microsoft Edge?",
  "Você sabia que o termo 'Cloud' começou a ser usado no sentido moderno pela Amazon em 2006?",
  "Você sabia que a linguagem de programação TypeScript compila direto para JavaScript?",
  "Você sabia que o primeiro sistema de virtualização comercial foi o CP-67 da IBM em 1967?",
  "Você sabia que o termo 'Algoritmo' homenageia o matemático Al-Khwarizmi?",
  "Você sabia que a linguagem de programação Dart foi criada pelo Google para apps mobile?",
  "Você sabia que o primeiro console com internet nativa foi o Sega Dreamcast?",
  "Você sabia que a linguagem de programação Elixir foi criada no Brasil por José Valim?",
  "Você sabia que o protocolo TCP faz controle de congestionamento para não derrubar a rede?",
  "Você sabia que o termo 'Legacy' é um eufemismo técnico para sistemas velhos que não podem ser desligados?",
  "Você sabia que a linguagem de programação Clojure roda sobre a JVM do Java?",
  "Você sabia que o primeiro e-mail da história dizia algo como 'QWERTYUIOP'?",
  "Você sabia que o termo 'Firewall' veio da construção civil, onde paredes isolam incêndios?",
  "Você sabia que a linguagem de programação Lua é usada no jogo World of Warcraft para scripts de interface?",
  "Você sabia que o primeiro computador a oferecer multitasking real foi o Amiga?",
  "Você sabia que o termo 'Daemon' no Linux refere-se a programas que rodam em segundo plano?",
  "Você sabia que a linguagem de programação Haskell não permite que funções alterem variáveis globais?",
  "Você sabia que o primeiro SSD comercial foi lançado pela SanDisk?",
  "Você sabia que o termo 'Dot-com' surgiu em 1985 com o primeiro registro de domínio?",
  "Você sabia que a linguagem de programação Perl foi a 'facil operacional' da web original?",
  "Você sabia que o primeiro vídeo do YouTube tem apenas 18 segundos?",
  "Você sabia que o termo 'Avatar' foi popularizado pelo jogo de computador Ultima?",
  "Você sabia que a linguagem de programação COBOL é insensível a maiúsculas e minúsculas?",
  "Você sabia que o primeiro framework MVC popular para a web foi o Ruby on Rails?",
  "Você sabia que o termo 'Sandbox' isola um programa do resto do sistema operacional?",
  "Você sabia que a linguagem de programação C foi a base para o desenvolvimento do Windows e Linux?",
  "Você sabia que o primeiro mouse óptico da Microsoft usava luz infravermelha?",
  "Você sabia que o termo 'Bandwidth' refere-se à largura de banda de frequência de rádio original?",
  "Você sabia que a linguagem de programação PHP 7 foi 2x mais rápida que a versão 5.6?",
  "Você sabia que o primeiro blog famoso foi o de Justin Hall em 1994?",
  "Você sabia que o termo 'Vulnerability' refere-se a uma fraqueza no software que permite explorações?",
  "Você sabia que a linguagem de programação SQL foi baseada na álgebra relacional?",
  "Você sabia que o primeiro teclado mecânico IBM Model M é considerado o melhor teclado já feito?",
  "Você sabia que o termo 'Social Engineering' foca na falha humana, não na técnica?",
  "Você sabia que a linguagem de programação Assembly permite controle total sobre os registradores da CPU?",
  "Você sabia que o primeiro site da internet explicava como criar servidores web?",
  "Você sabia que o termo 'Hack' originalmente significava uma solução rápida e deselegante para um problema?",
  "Você sabia que a linguagem de programação Java usa o conceito de bytecode para ser multiplataforma?",
  "Você sabia que o primeiro domínio .com do mundo foi o symbolics.com?",
  "Você sabia que o termo 'Spam' tornou-se comum após um esquete do Monty Python?",
  "Você sabia que a linguagem de programação C++ foi criada por Bjarne Stroustrup no Bell Labs?",
  "Você sabia que o primeiro computador portátil real foi o Osborne 1?",
  "Você sabia que o termo 'WiFi' não tem significado técnico oficial?",
  "Você sabia que a linguagem de programação LISP significa List Processing?",
  "Você sabia que o primeiro navegador gráfico moderno foi o NCSA Mosaic?",
  "Você sabia que o termo 'Bit' é a fusão de Binary e Digit?",
  "Você sabia que o primeiro sistema operacional a introduzir o conceito de 'links simbólicos' foi o Multics?",
  "Você sabia que o protocolo HTTP 1.1 introduziu o cabeçalho 'Host', permitindo hospedar múltiplos sites no mesmo IP?",
  "Você sabia que o termo 'Zero Day' refere-se ao fato de o desenvolvedor ter tido zero dias para corrigir a falha?",
  "Você sabia que a linguagem de programação ML foi a primeira a ter um sistema de tipos seguro e inferência de tipos?",
  "Você sabia que o primeiro computador comercial com monitor vetorial foi o Tektronix 4010?",
  "Você sabia que a linguagem de programação APL usa um teclado com símbolos matemáticos gregos e especiais?",
  "Você sabia que o termo 'Core Dump' refere-se a quando a memória RAM de um programa é escrita no disco após um crash?",
  "Você sabia que o primeiro sistema de arquivos a usar 'copy-on-write' em larga escala foi o ZFS da Sun Microsystems?",
  "Você sabia que a linguagem de programação Scheme foi a primeira a popularizar as 'continuações' de primeira classe?",
  "Você sabia que o protocolo SMTP para e-mails originalmente transmitia apenas texto ASCII de 7 bits?",
  "Você sabia que o termo 'Middleware' descreve o software que conecta sistemas diferentes em uma rede corporativa?",
  "Você sabia que a linguagem de programação Erlang foi desenhada para nunca precisar ser reiniciada por décadas?",
  "Você sabia que o primeiro computador a oferecer 'plug and play' real foi o Apple Macintosh original?",
  "Você sabia que a linguagem de programação Forth foi usada para controlar a sonda espacial espacial Deep Space 1?",
  "Você sabia que o primeiro sistema operacional a usar uma estrutura de árvore para diretórios foi o Unix?",
  "Você sabia que o termo 'Kernel Panic' foi cunhado pelos desenvolvedores do sistema Multics?",
  "Você sabia que a linguagem de programação Simula 67 foi a base para quase toda a POO moderna?",
  "Você sabia que o primeiro roteador comercial da Cisco era um computador AGS montado em uma garagem?",
  "Você sabia que a linguagem de programação Modula-2 foi criada para ser a sucessora profissional do Pascal?",
  "Você sabia que o protocolo Bluetooth usa 'frequency hopping' para evitar interferências de micro-ondas?",
  "Você sabia que o termo 'Favicon' é a abreviação de 'Favorite Icon', introduzido pelo IE5 em 1999?",
  "Você sabia que o primeiro antivírus comercial de sucesso foi o McAfee VirusScan, lançado em 1987?",
  "Você sabia que a arquitetura 'ARM' significa 'Advanced RISC Machine', focada em baixo consumo de energia?",
  "Você sabia que a linguagem de programação Ruby on Rails popularizou o padrão 'Convention Over Configuration'?",
  "Você sabia que o primeiro drone controlado por computador foi desenvolvido pela Marinha dos EUA na década de 50?",
  "Você sabia que a linguagem de programação Lua é a única linguagem brasileira amplamente usada no mundo tech?",
  "Você sabia que o protocolo SSH usa criptografia assimétrica apenas para autenticar e trocar chaves simétricas?",
  "Você sabia que o termo 'Daemon' refere-se a um programa que roda sem intervenção humana, como um espírito guardião?",
  "Você sabia que a linguagem de programação Julia consegue atingir a velocidade do C usando compilação JIT?",
  "Você sabia que o primeiro computador pessoal a usar o microprocessador Intel 8088 foi o IBM PC?",
  "Você sabia que a linguagem de programação Kotlin foi desenhada para substituir o Java em sistemas Android?",
  "Você sabia que o sistema de arquivos NTFS da Microsoft é baseado no sistema de arquivos do OS/2 da IBM?",
  "Você sabia que a linguagem de programação Elixir usa a máquina virtual do Erlang para processar milhões de tarefas simultâneas?",
  "Você sabia que o primeiro servidor web do CERN usava o sistema operacional NeXTSTEP, criado pela empresa de Steve Jobs?",
  "Você sabia que o termo 'Responsive Design' foi cunhado por Ethan Marcotte em um artigo de 2010?",
  "Você sabia que a linguagem de programação TypeScript foi criada por Anders Hejlsberg para resolver problemas de escala do JavaScript?",
  "Você sabia que o protocolo TCP faz o 'Three-way Handshake' para estabelecer uma conexão confiável?",
  "Você sabia que a linguagem de programação Rust garante a segurança da memória sem precisar de um Garbage Collector?",
  "Você sabia que o primeiro smartphone a rodar Android comercialmente foi o HTC Dream (G1) em 2008?",
  "Você sabia que a linguagem de programação Swift lançou sua versão open source em 2015 pela Apple?",
  "Você sabia que o primeiro processador consumer a romper a barreira de 1 GHz foi o AMD Athlon em 2000?",
  "Você sabia que o termo 'Blockchain' foi descrito pela primeira vez em 1991 como uma forma de carimbar documentos digitais?",
  "Você sabia que a linguagem de programação C++ foi batizada pelo desenvolvedor Rick Mascitti em 1983?",
  "Você sabia que o primeiro 'Domain Name' registrado foi o symbolics.com em março de 1985?",
  "Você sabia que o protocolo HTTPS garante que ninguém consiga ver o conteúdo da sua conexão através do provedor?",
  "Você sabia que a linguagem de programação Python foi criada como uma sucessora da linguagem ABC?",
  "Você sabia que o primeiro videogame portátil de sucesso, o Game Boy, vendia quase 120 milhões de unidades?",
  "Você sabia que o termo 'Open Source' foi adotado em 1998 para tornar o software livre mais atraente para empresas?",
  "Você sabia que a linguagem de programação LISP foi a base para a criação da lógica do GPS original?",
  "Você sabia que o primeiro computador transistorizado comercial foi o Philco Transac S-2000?",
  "Você sabia que o protocolo SSL 3.0 foi desabilitado globalmente após a descoberta da vulnerabilidade POODLE?",
  "Você sabia que a linguagem de programação Perl ajudou a mapear o genoma humano devido ao seu poder de texto?",
  "Você sabia que o termo 'Spam' tornou-se uma gíria técnica oficial somente no final da década de 80?",
  "Você sabia que o primeiro site da internet ainda pode ser lido exatamente como era em 1991 no endereço do CERN?",
  "Você sabia que a linguagem de programação PHP 4 impulsionou o crescimento da web dinâmica nos anos 2000?",
  "Você sabia que o primeiro microcomputador de 16 bits consumer foi o Texas Instruments TI-99/4?",
  "Você sabia que o termo 'Debug' foi usado por Thomas Edison para descrever problemas mecânicos em suas invenções?",
  "Você sabia que a linguagem de programação COBOL foi a primeira a focar na leitura humana por não especialistas?",
  "Você sabia que em 1974, o primeiro item escaneado com código de barras foi um pacote de chicletes Wrigley's?",
  "Você sabia que a linguagem de programação Scheme foi a primeira a introduzir o escopo léxico em dialetos de Lisp?",
  "Você sabia que o primeiro servidor de nomes DNS do mundo rodava em uma máquina PDP-11?",
  "Você sabia que o termo 'Virtual Memory' permite que um programa use mais memória do que a RAM física instalada?",
  "Você sabia que a linguagem de programação Fortran é a mais antiga linguagem de alto nível ainda em uso científico?",
  "Você sabia que em 1947, o transistor foi inventado por John Bardeen, Walter Brattain e William Shockley?",
  "Você sabia que o primeiro computador brasileiro de 32 bits foi o Pegasus, desenvolvido no LNCC?",
  "Você sabia que o termo 'Bit' foi cunhado por John Tukey para descrever dígitos binários?",
  "Você sabia que a linguagem de programação JavaScript foi quase batizada de 'Mocha'?",
  "Você sabia que o primeiro smartphone a ter tela sensível ao toque foi o IBM Simon em 1992?",
  "Você sabia que o termo 'Robot' vem da palavra tcheca que significa trabalho involuntário?",
  "Você sabia que a primeira mensagem transmitida via ARPANET continha apenas a palavra 'LOGIN', mas travou no 'G'?",
  "Você sabia que o primeiro computador a oferecer 256 cores na tela foi o IBM PS/2 com o padrão VGA?",
  "Você sabia que o termo 'Internet' significa literalmente 'entre redes'?",
  "Você sabia que em 1985, a Microsoft lançou o Windows 1.0 por apenas 99 dólares?",
  "Você sabia que a linguagem de programação Java foi o motor dos primeiros telefones móveis com internet (WAP)?",
  "Você sabia que o primeiro navegador a permitir navegar com abas foi o NetCaptor em 1997?",
  "Você sabia que a linguagem de programação Ruby foi criada para ser centrada na felicidade do desenvolvedor?",
  "Você sabia que o primeiro microprocessador comercial, o Intel 4004, processava apenas 4 bits por vez?",
  "Você sabia que em 1991, Tim Berners-Lee recusou-se a patentear a World Wide Web para que ela crescesse livremente?",
  "Você sabia que o termo 'Hypertext' foi criado para descrever uma forma de ler textos de forma não linear?",
  "Você sabia que o primeiro sistema operacional a rodar em um PC IBM foi o PC-DOS, fornecido pela Microsoft?",
  "Você sabia que a linguagem de programação assembly é a camada de tradução mais próxima do silício da CPU?",
  "Você sabia que em 1960, o primeiro laser funcional usava um cristal de rubi sintético?",
  "Você sabia que a linguagem de programação C++ introduziu a sobrecarga de operadores no mundo mainstream?",
  "Você sabia que em 1994, o Netscape Navigator era o browser mais rápido do mercado?",
  "Você sabia que o termo 'Web' foi escolhido porque descrevia matematicamente as interconexões da rede?",
  "Você sabia que o primeiro computador 'laptop' da história foi o Grid Compass 1101 de 1982?",
  "Você sabia que a linguagem de programação Ruby é amplamente usada em automação de servidores com o Chef e Puppet?",
  "Você sabia que o primeiro disquete comercial tinha 8 polegadas e armazenava apenas 80 Kilobytes?",
  "Você sabia que a linguagem de programação Perl 6 levou 15 anos para ser lançada e acabou virando a linguagem Raku?",
  "Você sabia que em 1976, Steve Jobs convidou Steve Wozniak para fundar a Apple após ele construir um computador sozinho?",
  "Você sabia que o término 'Bit' representa um estado booleano de 0 ou 1?",
  "Você sabia que o primeiro supercomputador a usar multiprocessamento paralelo foi o Illiac IV?",
  "Você sabia que em 1983, a ARPANET mudou para o TCP/IP em um único dia, evento chamado de 'Flag Day'?",
  "Você sabia que a linguagem de programação Lisp é a avó de linguagens como Clojure e AutoLISP do AutoCAD?",
  "Você sabia que o primeiro mouse de computador era movido por duas rodas perpendiculares de metal?",
  "Você sabia que em 1998, o Google recebia apenas 10.000 buscas por dia em seu início?",
  "Você sabia que o primeiro sistema operacional para o Android foi demonstrado em um protótipo sem touch-screen?",
  "Você sabia que a linguagem de programação Swift usa a tecnologia LLVM para otimizar o código de forma nativa?",
  "Você sabia que o termo 'Geek' mudou de significado de 'artista bizarro' para 'entusiasta de tecnologia' nos anos 80?",
  "Você sabia que a linguagem de programação Scala oferece a melhor integração entre Java e programação funcional?",
  "Você sabia que o primeiro PC comercial baseado no Xerox Alto foi o Xerox Star em 1981?",
  "Você sabia que em 1982, o Sony CDP-101 foi o primeiro aparelho de reprodução de música digital a laser?",
  "Você sabia que o termo 'Mnemônico' ajuda o humano a lembrar de códigos binários como JMP ou MOV?",
  "Você sabia que a linguagem de programação Fortran foi a primeira a permitir o uso de nomes de variáveis complexas?",
  "Você sabia que em 1971, o engenheiro Federico Faggin desenhou o primeiro chip Intel baseado em tecnologia de silício?",
  "Você sabia que o termo 'Desktop' surgiu quando os computadores finalmente ficaram pequenos o suficiente para mesas?",
  "Você sabia que a linguagem de programação Kotlin permite eliminar o erro de 'Null Pointer Exception' por design?",
  "Você sabia que em 1988, o IRC tornou-se a primeira rede social de mensagens instantâneas do mundo?",
  "Você sabia que o primeiro hacker de telefonia usava um apito de brinde de cereal para enganar as centrais telefônicas?",
  "Você sabia que a linguagem de programação Scheme foi a primeira a tratar funções como 'cidadãos de primeira classe'?",
  "Você sabia que em 1996, o Windows 95 OSR2 introduziu o sistema de arquivos FAT32 que usamos até hoje?",
  "Você sabia que o termo 'Wi-Fi' é uma marca da Wi-Fi Alliance e não é abreviação de nada?",
  "Você sabia que a linguagem de programação D foi criada para oferecer a performance do C++ sem a sua complexidade?",
  "Você sabia que em 1972, a Atari lançou o Pong e iniciou a era de ouro dos arcades?",
  "Você sabia que o primeiro servidor DNS brasileiro foi operado dentro da rede da USP?",
  "Você sabia que a linguagem de programação Haskell possui um sistema de tipos tão forte que 'se compila, geralmente funciona'?",
  "Você sabia que em 1987, o Photoshop 1.0 foi desenvolvido exclusivamente para o Macintosh?",
  "Você sabia que o termo 'Blog' foi cunhado por Peter Merholz a partir da expressão 'web log'?",
  "Você sabia que a linguagem de programação Prolog foi a base para o projeto de inteligência artificial de quinta geração do Japão?",
  "Você sabia que em 1999, o Napster foi o aplicativo de crescimento mais rápido na história da internet até então?"
]